<?php

use App\Models\Map;
use App\Models\Npc;
use App\Models\Produce;
use Illuminate\Support\Carbon;
use Illuminate\Database\Seeder;

class NpcsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = [
            [
                "name" => "御林军左护卫",
                "cover" => "御林军左护卫人物.png",
                "relations" => ["御林军右护卫", "蟹兵", "鱼兵", "巡山小妖"],
                "favorites" => ["防具", "武器"],
                "map" => "长安城",
                "description" => "虽出身于普通家庭，但长期的军旅生涯使其练得一身好武艺，目前是长安城御林军之一，希望有朝一日能成为像右统领那般的大人物。"
            ],
            [
                "name" => "南极仙翁",
                "cover" => "南极仙翁人物.png",
                "relations" => ["玉皇大帝", "青莲", "镇元子", "大觉金仙", "文曲星君", "红线童子", "太上老君"],
                "favorites" => ["三级药"],
                "map" => "临仙镇",
                "description" => "南极仙翁乃元始天尊座下大弟子，主寿命。人皆称其为“寿星”，常以鹤发童颜的老翁形象示人。如今他老人家仙游至临仙镇，如果有幸相遇，必定身体康健、福寿绵长。"
            ],
            [
                "name" => "小倩",
                "cover" => "小倩人物.png",
                "relations" => ["小雅", "秀兰", "农夫"],
                "favorites" => ["美食"],
                "map" => "青河镇",
                "description" => "与其他孩子截然不同的是，小倩对玩耍甜食不甚热心，却对四书五经有浓厚的兴趣。每天最快乐的时光就是趴在青河镇私塾的破窗边，偷听上一段诗经或者论语。"
            ],
            [
                "name" => "秀兰",
                "cover" => "秀兰人物.png",
                "relations" => ["农夫", "小倩", "小雅"],
                "favorites" => ["鲜花", "百花露", "宝石", "一级庭院装饰"],
                "map" => "青河镇",
                "description" => "秀兰性情温婉、美丽动人，是青河一带有名的美人儿。众多青年才俊趋之若鹜，向她大献殷勤，殊不知佳人早已芳心暗许。"
            ],
            [
                "name" => "文曲星君",
                "cover" => "文曲星君人物.png",
                "relations" => ["红线童子", "大慧禅师", "青莲", "南极仙翁", "云游僧人", "观音菩萨", "太上老君"],
                "favorites" => ["三级药"],
                "map" => "临仙镇",
                "description" => "文曲星君乃主管文运的星宿，是文才的象征，诗歌歌赋无所不精，琴棋书画无所不通。世人常称博学多才之人为“文曲星下凡”，足见其在文人墨客心中的地位。"
            ],
            [
                "name" => "秦琼",
                "cover" => "秦琼人物.png",
                "relations" => ["侯君集", "李世民", "魏征", "杨戬", "房玄龄", "殷丞相", "李总镖头", "程将军"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "当世名将，战功赫赫，深受太宗皇帝器重，任左武卫大将军，居长安秦府。"
            ],
            [
                "name" => "土匪",
                "cover" => "土匪人物.png",
                "relations" => ["山贼", "平天大圣", "毛贼", "野猪王", "恶熊"],
                "favorites" => ["武器"],
                "map" => "野外",
                "description" => "少壮不努力，老大成土匪。土匪本是富贾公子，因年少厌学，以致于身无所长。后恰逢隋末乱世，家道中落，迫于生计只能落草为寇，在大唐国境打劫过往行人，聊以度日。"
            ],
            [
                "name" => "渔夫",
                "cover" => "渔夫人物.png",
                "relations" => ["农夫", "衙役", "流浪艺人", "掌柜"],
                "favorites" => ["水产品"],
                "map" => "野外",
                "description" => "渔夫自小跟随爷爷在泾河边以打渔为生。他有个奇怪的习惯，每次捕鱼都要放掉所有小鱼和一半大鱼，绝不滥杀滥捕，足够度日即可。"
            ],
            [
                "name" => "翼仙",
                "cover" => "翼仙人物.png",
                "relations" => ["盘丝大仙", "彩翼", "媚灵", "龙女", "秋水", "女御史"],
                "favorites" => ["二级药"],
                "map" => "野外",
                "description" => "翼仙本是仙禽青鸟所化，天生仙脉，修来起来事半功倍。她在昆仑修行千年，与当地飞禽走兽关系亲密。如今即将白日飞升，心中渐生不舍之心。"
            ],
            [
                "name" => "柳乘风",
                "cover" => "柳乘风人物.png",
                "relations" => ["千里眼", "幽蓝", "翰林学士", "杨戬", "太上老君", "房玄龄", "李员外", "顺风耳", "巨灵神", "刘举人", "吕大人"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => " 长安一儒生，生得是面如冠玉、目若朗星，在诗歌书画各方面都有很高造诣，为人风流儒雅、气宇不凡，风靡长安万千少女，深得达官显贵的青睐。"
            ],
            [
                "name" => "晴佳",
                "cover" => "晴佳人物.png",
                "relations" => ["盘丝大仙", "嫦娥", "雪瑶", "夏荷", "秋水", "如意"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "傲来国",
                "description" => "傲来国人杰地灵，这里有瑶草奇花、奇珍异兽，更有晴佳这般美艳动人的姑娘。晴佳显然也喜欢这里的生活，无忧无虑、与世无争。"
            ],
            [
                "name" => "夏荷",
                "cover" => "夏荷人物.png",
                "relations" => ["盘丝大仙", "豆豆", "曾浩迟", "秋水", "雪瑶", "女御史", "嫦娥", "如意", "晴佳"],
                "favorites" => ["鲜花", "百花露", "宝石", "二级家具"],
                "map" => "女儿国",
                "description" => "临仙镇人氏，民间科学家，在胭脂水粉的研制领域有着极高的造诣。听闻女儿国有制造胭脂的上佳材料，于是不远千里奔赴女儿国，希望能够造出独一无二的优质化妆品。"
            ],
            [
                "name" => "女御史",
                "cover" => "女御史人物.png",
                "relations" => ["盘丝大仙", "媚灵", "秋水", "彩翼", "吕大人", "龙女", "翼仙", "夏荷", "秋菊"],
                "favorites" => ["二级庭院装饰"],
                "map" => "女儿国",
                "description" => "女儿国的官员，性格豪爽，不让须眉。她行事果断，有勇有谋，深得女儿国国王倚重。不过近来常有她里通外敌的谣传，具体来龙去脉却无人知晓。"
            ],
            [
                "name" => "云游僧人",
                "cover" => "云游僧人人物.png",
                "relations" => ["通灵道人", "大慧禅师", "何道长", "观音菩萨", "文曲星君", "太上老君"],
                "favorites" => ["素斋", "农产品"],
                "map" => "野外",
                "description" => "无人知晓他从何而来，又要往何处去，有人说曾在傲来之滨见过他，也有人在巍巍昆仑发现过他的踪迹。如今他似乎发现了什么，暂且在乌斯藏停留。"
            ],
            [
                "name" => "李总镖头",
                "cover" => "李总镖头人物.png",
                "relations" => ["小虎", "杨戬", "太上老君", "李大嫂", "秦琼", "侯君集"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "天下第一镖局长安镖局的创始人，正在逐渐把镖局的运营交给儿子。年轻时曾征战沙场、屡立战功，战后因厌倦官场，回乡经营起了镖局生意，在江湖上大名鼎鼎，人脉极广。"
            ],
            [
                "name" => "李员外",
                "cover" => "李员外人物.png",
                "relations" => ["翰林学士", "魏征", "房玄龄", "包夫人", "吕大人", "柳乘风", "刘举人"],
                "favorites" => ["一级庭院装饰"],
                "map" => "长安城",
                "description" => "李员外人到中年，膝下并无子嗣，夫人又因恶疾去世，只留下员外孤零零一个人与万贯家财。心灰意冷的他就这么虚度了几年光阴，直到有人走入他的生活。"
            ],
            [
                "name" => "凤瑶",
                "cover" => "凤瑶人物.png",
                "relations" => ["百合", "雪瑶", "秋菊", "如花"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "凤瑶天生丽质，自小便是招蜂引蝶的主，心性极高。如今到了婚配年纪，媒婆都快将她家的门槛给踏破了，但始终没有能让凤瑶另眼相看的人。"
            ],
            [
                "name" => "掌柜",
                "cover" => "掌柜人物.png",
                "relations" => ["曾浩迟", "农夫", "戏院老板", "香客", "花狐狸", "衙役", "渔夫", "流浪艺人"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "掌柜表面上只是长安客栈里笑眯眯的老头，实际上却有着神秘的江湖身份，知晓之人寥寥无几。"
            ],
            [
                "name" => "如意",
                "cover" => "如意人物.png",
                "relations" => ["盘丝大仙", "雪瑶", "秋水", "夏荷", "嫦娥", "晴佳"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "如意姑娘是长安乐艺坊的伶官，与临仙镇的宫羽姑娘并称为“乐艺双绝”。其琵琶技艺之高，足以让善才羞愧，其身姿容貌之好，足以让秋水姑娘嫉妒。"
            ],
            [
                "name" => "御林军右护卫",
                "cover" => "御林军右护卫人物.png",
                "relations" => ["巡山小妖", "御林军左护卫", "包夫人", "牛头", "马面", "蟹兵", "鱼兵"],
                "favorites" => ["防具", "武器"],
                "map" => "长安城",
                "description" => "将门之后，自小熟读兵法，武艺高超，平身所恨唯有不能身在乱世，也好血战疆场、指点江山。"
            ],
            [
                "name" => "长臂猿",
                "cover" => "长臂猿人物.png",
                "relations" => ["平天大圣", "巨灵神", "有来有去", "灰猿", "野猪王", "大耳怪", "媚灵", "花狐狸", "野蛇精", "万兽之王", "幽蓝"],
                "favorites" => ["变身卡"],
                "map" => "傲来国",
                "description" => "从花果山来傲来国定居的猴子，偶像是齐天大圣，幻想着有朝一日能像大圣爷一般神通广大。作为一只温顺的猴子，长臂猿深受傲来孩童的喜爱。"
            ],
            [
                "name" => "通灵道人",
                "cover" => "通灵道人人物.png",
                "relations" => ["何道长", "云游僧人", "地藏菩萨", "吴朴智", "大慧禅师", "慧痴", "孤魂"],
                "favorites" => ["素斋", "农产品"],
                "map" => "临仙镇",
                "description" => "不知来历，神龙见首不见尾的道士，从未在常人面前施展法术，但观其周身精气流动，显然并非等闲之辈。常在临仙镇出没，一副“闲看庭前花开落”的模样。"
            ],
            [
                "name" => "游客",
                "cover" => "游客人物.png",
                "relations" => ["刘举人", "香客", "村长", "钱夫人", "程府管家"],
                "favorites" => ["二级庭院装饰"],
                "map" => "女儿国",
                "description" => "青河人氏，本是默默无闻的普通商贾，为寻求商机背井离乡，一路西行至女儿国。有感于当地风土人情，渐生置业久居的打算。"
            ],
            [
                "name" => "山贼",
                "cover" => "山贼人物.png",
                "relations" => ["土匪", "毛贼", "恶熊"],
                "favorites" => ["武器"],
                "map" => "野外",
                "description" => "大唐境外的不安定因素之一，武功平平，轻功却是一流，江湖人称“过山风”。虽是江湖草莽，却总以劫富济贫的侠客自居，往往不会打劫过路的穷苦百姓。"
            ],
            [
                "name" => "何道长",
                "cover" => "何道长人物.png",
                "relations" => ["护剑弟子", "大慧禅师", "通灵道人", "玄弘", "吴朴智", "泽野", "玄明", "小雅", "袁飞", "云游僧人", "大觉金仙", "流浪艺人"],
                "favorites" => ["素斋", "农产品"],
                "map" => "青河镇",
                "description" => "何道长虽然是青河镇的传奇人物，却一直谦恭有礼、不骄不躁。坊间传闻他修得一身通天法术，甚至与天庭众神相交甚笃。"
            ],
            [
                "name" => "农夫",
                "cover" => "农夫人物.png",
                "relations" => ["渔夫", "掌柜", "秀兰", "衙役", "小倩", "流浪艺人"],
                "favorites" => ["二级庭院装饰"],
                "map" => "青河镇",
                "description" => "农夫为人忠厚老实、吃苦耐劳，是青河镇年轻一辈的好大哥。凭借一手精妙绝伦的木工手艺，在这天下初定的乱世之中也算衣食无忧。"
            ],
            [
                "name" => "戏院老板",
                "cover" => "戏院老板人物.png",
                "relations" => ["曾浩迟", "掌柜", "花狐狸", "香客"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "长安乐艺坊老板，为人慷慨，好善乐施，对音律诗乐有独到见解。在他的经营之下，长安城三教九流纷之沓来，坊内日日笙歌、座无虚席。"
            ],
            [
                "name" => "蒙面人",
                "cover" => "蒙面人人物.png",
                "relations" => ["泽野", "秋水", "奈良"],
                "favorites" => ["暗器"],
                "map" => "傲来国",
                "description" => "常年徘徊在天魔里外的可疑面具男，姓甚名谁无人知晓，唯一的爱好就是说一些不着调的话。偶尔见他凝视着天魔里的方向，眼中似有忧愁，其中应当也有些隐情吧。"
            ],
            [
                "name" => "程府管家",
                "cover" => "程府管家人物.png",
                "relations" => ["县令", "程将军", "村长", "御林军右统领", "刘举人", "小石头", "钱夫人", "香客", "游客"],
                "favorites" => ["二级庭院装饰"],
                "map" => "天策",
                "description" => "也许这位天策府内平平无奇的中年大汉很容易被人忽略，但平日里见他龙行虎步，说话中气十足，显然也是一位武道高人。"
            ],
            [
                "name" => "包夫人",
                "cover" => "包夫人人物.png",
                "relations" => ["李员外", "程夫人", "李大嫂", "御林军右护卫", "周大婶", "钱夫人"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "包夫人早年丧夫，但碍于世俗偏见，她孤身一人，并未改嫁，就这么蹉跎了十年岁月。如今一个人闯入了她的生活，她是否能挣脱世俗的枷锁，坦然接受呢？"
            ],
            [
                "name" => "如花",
                "cover" => "如花人物.png",
                "relations" => ["秋菊", "百合", "凤瑶"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "身在金悦院这等风月场所，出淤泥而不染实非易事，而如花姑娘却做到了。这位看起来有点呆萌的年轻女孩实则极为聪明、极有主见。"
            ],
            [
                "name" => "吕大人",
                "cover" => "吕大人人物.png",
                "relations" => ["刘举人", "房玄龄", "女御史", "李员外", "魏征", "柳乘风", "翰林学士"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "当今大唐知名的朝廷命官，官职正三品，从官前曾是一私塾的先生，个性不徐不急，为大唐培养了众多人才，可谓“桃李满天下”。"
            ],
            [
                "name" => "御林军右统领",
                "cover" => "御林军右统领人物.png",
                "relations" => ["程将军", "程府管家", "县令", "小石头"],
                "favorites" => ["防具", "武器"],
                "map" => "长安城",
                "description" => "早年跟随李世民东征西讨，天下一统之后被封为御林军右统领，负责长安城城池的安全事务。虽然高官厚禄加身，他却依旧怀念当年征战沙场的生活。"
            ],
            [
                "name" => "百合",
                "cover" => "百合人物.png",
                "relations" => ["凤瑶", "翰林学士", "如花", "侯君集", "秋菊"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "京城第一名妓，金悦院头牌，终日笑脸迎人，始终坚持只卖艺不卖身。青楼女子大多身世凄苦，百合是否也有着不为人知的故事呢。"
            ],
            [
                "name" => "钱夫人",
                "cover" => "钱夫人人物.png",
                "relations" => ["程夫人", "周大婶", "村长", "李大嫂", "程府管家", "刘举人", "郑妈妈", "游客", "包夫人"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "正所谓爱财之心人皆有之，钱夫人既爱美更爱财。偌大的家业在她手中不仅没有垮掉，反倒经营的井井有条、蒸蒸日上，是不可多得的女强人。"
            ],
            [
                "name" => "小石头",
                "cover" => "小石头人物.png",
                "relations" => ["村长", "周夫人", "县令", "小雅", "周大婶", "程将军", "程府管家", "御林军右统领"],
                "favorites" => ["美食"],
                "map" => "青河镇",
                "description" => "青河孩子王，平日里上房揭瓦，下河摸鱼，“无恶不作”。他虽然调皮捣蛋，对武道却有着孜孜不倦的追求。"
            ],
            [
                "name" => "红线童子",
                "cover" => "红线童子人物.png",
                "relations" => ["文曲星君", "白云", "青莲", "南极仙翁"],
                "favorites" => ["美食"],
                "map" => "长安城",
                "description" => "相传乃月老伴童，负责撮合人世间的姻缘和见证美好的爱情诞生，正所谓“千里姻缘一线牵”，其手中红线便是爱情的象征。"
            ],
            [
                "name" => "刘举人",
                "cover" => "刘举人人物.png",
                "relations" => ["吕大人", "魏征", "翰林学士", "房玄龄", "游客", "程府管家", "钱夫人", "村长", "柳乘风", "香客", "李员外"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "青河镇人氏，自幼好学，颇有才华。他中举后来到长安，攻读于国子监，渴望有朝一日能够施展抱负。"
            ],
            [
                "name" => "流浪艺人",
                "cover" => "流浪艺人人物.png",
                "relations" => ["渔夫", "吴朴智", "袁飞", "泽野", "衙役", "农夫", "何道长", "玄明", "掌柜"],
                "favorites" => ["美食"],
                "map" => "傲来国",
                "description" => "背着一个小药篓去闯荡江湖，多年的江湖经验使她精通药理，是个医术高明的奇女子。路过傲来之时，她被傲来的风景人文所吸引，决定暂时停留一阵子，也靠医术挣点盘缠。"
            ],
            [
                "name" => "衙役",
                "cover" => "衙役人物.png",
                "relations" => ["渔夫", "农夫", "侯君集", "流浪艺人", "掌柜"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "衙役自小在长安城长大，长安的一草一木他都了如指掌，虽然只是长安衙门的一名小小差役，但从未失去梦想，一直在成为一名捕头努力着。"
            ],
            [
                "name" => "翰林学士",
                "cover" => "翰林学士人物.png",
                "relations" => ["百合", "刘举人", "魏征", "柳乘风", "李员外", "殷丞相", "房玄龄", "吕大人"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "当世才俊，才华横溢，因愤于前朝暴政而归隐山林、不问世事。李世民登基之后广纳天下贤才，下诏宣其入京，册封为翰林学士。"
            ],
            [
                "name" => "李大嫂",
                "cover" => "李大嫂人物.png",
                "relations" => ["程夫人", "包夫人", "小虎", "李总镖头", "周大婶", "钱夫人"],
                "favorites" => ["二级庭院装饰"],
                "map" => "傲来国",
                "description" => "李大嫂因某种原因回到傲来婆家，赌气再也不回去，但时日一长，对孩子的思念与日俱增，也有些担心自家老头的身体，所以渐生归意。"
            ],
            [
                "name" => "秋菊",
                "cover" => "秋菊人物.png",
                "relations" => ["盘丝大仙", "媚灵", "如花", "彩翼", "袁飞", "凤瑶", "女御史", "百合"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "女儿国",
                "description" => "女儿国土生土长的姑娘，温婉动人，心地质朴，因为异常反感饮用子母河水而成为当地人眼中的异类，对傲来国的奇闻异事很感兴趣。"
            ],
            [
                "name" => "恶熊",
                "cover" => "恶熊人物.png",
                "relations" => ["毛贼", "野猪王", "灰猿", "有来有去", "大耳怪", "土匪", "山贼", "巡山小妖"],
                "favorites" => ["变身卡"],
                "map" => "野外",
                "description" => "恶熊并非是一头普通的熊，作为一头熊，其智谋可谓震古烁今，不仅掌管着乌斯藏的劫道行业，甚至将业务扩展到了大唐境外和大唐国境。"
            ],
            [
                "name" => "小雅",
                "cover" => "小雅人物.png",
                "relations" => ["小倩", "秀兰", "小石头", "何道长"],
                "favorites" => ["美食"],
                "map" => "青河镇",
                "description" => "小雅是个心地善良的小姑娘，深受青河镇民的喜爱。虽然还未到情窦初开的年纪，却对某个”傻小子“青睐有加。"
            ],
            [
                "name" => "村长",
                "cover" => "村长人物.png",
                "relations" => ["程府管家", "周夫人", "小石头", "刘举人", "游客", "钱夫人", "香客"],
                "favorites" => ["二级家具", "酒类"],
                "map" => "青河镇",
                "description" => "青河现任村长，上任至今一直兢兢业业，前些年头还大兴土木，把青河镇里里外外翻新了一遍，使一位尽忠职守的好村长。"
            ],
            [
                "name" => "曾浩迟",
                "cover" => "曾浩迟人物.png",
                "relations" => ["豆豆", "花狐狸", "掌柜", "戏院老板", "夏荷", "香客"],
                "favorites" => ["烹饪"],
                "map" => "临仙镇",
                "description" => "年近耄耄的老翁，在临仙镇经营着不小的产业，信奉“无商不奸”的至理名言。私下里确实个慈父，十分疼爱自己的孙女。偶有贪杯的坏习惯，但是瑕不掩瑜。"
            ],
            [
                "name" => "灰猿",
                "cover" => "灰猿人物.png",
                "relations" => ["万兽之王", "野猪王", "长臂猿", "恶熊", "有来有去"],
                "favorites" => ["变身卡"],
                "map" => "野外",
                "description" => "曾追随大圣大闹凌霄天宫的猴子，当年只是最低等的小猴兵，如今已经成为花果山的长老级人物，对孙悟空极为崇拜。"
            ],
            [
                "name" => "县令",
                "cover" => "县令人物.png",
                "relations" => ["奈良", "御林军右统领", "程将军", "程府管家", "小石头", "御林军左统领", "大耳怪", "慧仁"],
                "favorites" => ["二级庭院装饰"],
                "map" => "青河镇",
                "description" => "青河县令性情刚烈，嫉恶如仇，虽是文官出身，却练得一身好武艺。他在青河任职期间两袖清风、治县有方，深受百姓爱戴。"
            ],
            [
                "name" => "吴朴智",
                "cover" => "吴朴智人物.png",
                "relations" => ["何道长", "通灵道人", "流浪艺人", "大慧禅师", "周大婶", "袁飞", "泽野", "玄明"],
                "favorites" => ["二级家具", "二级药"],
                "map" => "长安城",
                "description" => "长安一老叟，虽然年事已高，身体却还算硬朗。表面上是个平平无奇的枯瘦老头，实则却是“大隐隐于市”的一代大儒。"
            ],
            [
                "name" => "小虎",
                "cover" => "小虎人物.png",
                "relations" => ["李总镖头", "李大嫂", "白云", "清风"],
                "favorites" => ["美食"],
                "map" => "长安城",
                "description" => "一个活泼好动的小不点，对纷繁的世界充满好奇心。十分崇拜戏剧中的帝王将相，去长安城戏院肯定看得到他的身影。"
            ],
            [
                "name" => "毛贼",
                "cover" => "毛贼人物.png",
                "relations" => ["山贼", "土匪", "恶熊"],
                "favorites" => ["武器"],
                "map" => "长安城",
                "description" => "胆小怕事的菜鸟小贼，不知为何却犯下杀人重罪，只能暂且潜藏于大雁塔之中，每日战战兢兢，觉得未来希望渺茫。"
            ],
            [
                "name" => "野猪王",
                "cover" => "野猪王人物.png",
                "relations" => ["平天大圣", "大耳怪", "恶熊", "野蛇精", "土匪", "灰猿", "有来有去", "长臂猿", "巨灵神"],
                "favorites" => ["变身卡"],
                "map" => "野外",
                "description" => "大唐境外修炼多年的野猪，统领着境外数万野猪，可谓一呼百猪应。凭它的修为本可划为人形，只是不屑于凡人尔虞我诈、笑里藏刀，因而一直保持着原型。"
            ],
            [
                "name" => "大耳怪",
                "cover" => "大耳怪人物.png",
                "relations" => ["平天大圣", "野猪王", "恶熊", "长臂猿", "幽蓝", "县令", "媚灵", "万兽之王", "有来有去"],
                "favorites" => ["变身卡"],
                "map" => "野外",
                "description" => "神秘洞窟"
            ],
            [
                "name" => "程夫人",
                "cover" => "程夫人人物.png",
                "relations" => ["程将军", "李大嫂", "郑妈妈", "包夫人", "钱夫人", "周大婶"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "天策",
                "description" => "程夫人早年随程将军东奔西走，一直过着颠沛流离的生活，夫妻二人聚少离多。如今天下已定，却又因程将军俗务缠身，二人也难得说上几句暖心话。为此，程夫人多少有些神伤。"
            ],
            [
                "name" => "程将军",
                "cover" => "程将军人物.png",
                "relations" => ["程府管家", "房玄龄", "县令", "小石头", "殷丞相", "秦琼", "御林军右统领", "李世民", "程夫人", "侯君集", "魏征"],
                "favorites" => ["古玩", "酒类"],
                "map" => "天策",
                "description" => "程将军乃唐朝开国大将，早年随李世民南征北战，威震天下。玄武门之变后，李世民命程将军执掌天策府，号令天下兵马，威风一时无两。"
            ],
            [
                "name" => "周夫人",
                "cover" => "周夫人人物.png",
                "relations" => ["周大婶", "村长", "小石头"],
                "favorites" => ["鲜花", "百花露", "宝石", "一级家具"],
                "map" => "青河镇",
                "description" => "从临仙远嫁青河镇的大小姐，待人和善，偶尔会使点小性子。因为丈夫远征未还，所以一直有些闷闷不乐。"
            ],
            [
                "name" => "百晓通",
                "cover" => "百晓通人物.png",
                "relations" => ["殷丞相", "千里眼", "大觉金仙", "顺风耳", "镇元子"],
                "favorites" => ["一级家具", "烹饪"],
                "map" => "长安城",
                "description" => "作为“包打听”一行的佼佼者，百晓通的信息网路四通八达，没有他不知道的，只有他不敢说的。“知无不言，必须给钱。言无不尽，不给没命”是他的座右铭。"
            ],
            [
                "name" => "雪瑶",
                "cover" => "雪瑶人物.png",
                "relations" => ["盘丝大仙", "凤瑶", "夏荷", "秋水", "如意", "晴佳", "嫦娥"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "雪瑶姑娘也许不是特别美丽，但她学得一手精湛的厨艺，多次蝉联长安美食大会的冠军。据说她能制作出传说中的鸳鸯八珍脍，是让神仙也垂涎三尺的美味。"
            ],
            [
                "name" => "御林军左统领",
                "cover" => "御林军左统领人物.png",
                "relations" => ["护剑弟子", "县令", "慧仁", "蟹将军", "牛头", "奈良"],
                "favorites" => ["防具", "武器"],
                "map" => "长安城",
                "description" => "因为玄武门之变中立下大功，唐皇甚为赏识，将其擢升为御林军左护卫。平日里有些作威作福，治下极严，属下们颇有微词"
            ],
            [
                "name" => "殷丞相",
                "cover" => "殷丞相人物.png",
                "relations" => ["房玄龄", "李世民", "魏征", "百晓通", "镇元子", "翰林学士", "大觉金仙", "侯君集", "秦琼", "程将军"],
                "favorites" => ["二级庭院装饰"],
                "map" => "长安城",
                "description" => "殷丞相名开山，随李世民征战多年，为唐朝立下汗马功劳，后官至丞相，协助李世民定国安邦。他为人高风亮节，饱受赞誉，目前居住于长安相府。"
            ],
            [
                "name" => "郑妈妈",
                "cover" => "郑妈妈人物.png",
                "relations" => ["程夫人", "周大婶", "钱夫人"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "长安城",
                "description" => "金悦院的老板娘，虽已徐娘半老，却犹存几分风韵。天子脚下，一言一行须得小心谨慎，否则转瞬之间便会万劫不复。郑妈妈一介女流能在这长安城中混得风生水起，想来手段必定十分高明。"
            ],
            [
                "name" => "豆豆",
                "cover" => "豆豆人物.png",
                "relations" => ["夏荷", "曾浩迟"],
                "favorites" => ["美食"],
                "map" => "女儿国",
                "description" => "来自临仙镇的可爱小女生，几个月前随姑姑来女儿国游玩，生平最大的愿望是有吃不尽的糖葫芦，第二大愿望则是天天有人陪她玩耍。"
            ],
            [
                "name" => "周大婶",
                "cover" => "周大婶人物.png",
                "relations" => ["周夫人", "钱夫人", "吴朴智", "村长", "小石头", "李大嫂", "程夫人", "郑妈妈", "包夫人"],
                "favorites" => ["鲜花", "百花露", "宝石", "二级家具"],
                "map" => "长安城",
                "description" => "周大婶本是青河人氏，儿子在长安做了点小买卖，就将她接到长安享清福。如今几年过去，虽早已习惯长安的繁华拥挤，却还是念念不忘她的故乡。"
            ],
            [
                "name" => "泽野",
                "cover" => "泽野人物.png",
                "relations" => ["奈良", "蒙面人", "袁飞", "秋水", "何道长", "流浪艺人", "吴朴智", "玄明"],
                "favorites" => ["暗器"],
                "map" => "天魔里",
                "description" => "泽野曾追随袁飞西渡，刺杀之术不甚精纯，迷幻之术的造诣却是极高。相传他的迷幻之术可以改变人的思维，并将此人囚禁于永恒的幻境之中。"
            ],
            [
                "name" => "善财童子",
                "cover" => "善财童子人物.png",
                "relations" => ["龙女", "平天大圣", "青莲", "玲珑", "观音菩萨", "明月", "慧心", "慧痴", "玄弘"],
                "favorites" => ["二级药", "三级药"],
                "map" => "南海普陀",
                "description" => "状若孩童却法力滔天，擅使一杆丈八火尖枪，武艺非凡，在枯松涧一带横行霸道。后被观音大士点化，历经五十三参后修得正果，被赐名善财童子。"
            ],
            [
                "name" => "太上老君",
                "cover" => "太上老君人物.png",
                "relations" => ["玉皇大帝", "大觉金仙", "千里眼", "李总镖头", "柳乘风", "观音菩萨", "镇元子", "杨戬", "云游僧人", "南极仙翁", "文曲星君", "大慧禅师"],
                "favorites" => ["三级药"],
                "map" => "凌霄天宫",
                "description" => "太上老君乃万道之宗、万仙之祖，居大赤天太清境，道法无边、永生不灭。传闻他随方设教、历劫度人、化生诸天，是道的本源。"
            ],
            [
                "name" => "香客",
                "cover" => "香客人物.png",
                "relations" => ["掌柜", "戏院老板", "游客", "村长", "曾浩迟", "程府管家", "花狐狸", "刘举人"],
                "favorites" => ["素斋", "农作物"],
                "map" => "佛门",
                "description" => "焚香者未必信佛，这位神秘的香客如今久居于佛门的厢房之中，虽每日佛理，但明眼人一眼就能看出他并无敬佛之心。他究竟有何目的，旁人无从得知。"
            ],
            [
                "name" => "巡山小妖",
                "cover" => "巡山小妖人物.png",
                "relations" => ["万兽之王", "有来有去", "平天大圣", "御林军右护卫", "花狐狸", "马面", "御林军左护卫", "恶熊"],
                "favorites" => ["变身卡"],
                "map" => "万兽岭",
                "description" => "“大王叫我来巡山呦”，倘若在万兽岭听到这一嗓子，定是巡山小妖又在例行巡山了。作为万兽岭巡逻小队的负责人，巡山小妖对近期环境改造的成果相当满意。"
            ],
            [
                "name" => "孤魂",
                "cover" => "孤魂人物.png",
                "relations" => ["牛头", "卜世仁", "马面", "慧痴", "通灵道人", "地藏菩萨"],
                "favorites" => ["变身卡"],
                "map" => "幽冥地府",
                "description" => "在地狱里游荡的孤魂，因为心事未了，无法重入轮回。前世因果与红尘孽缘在他灵魂之中散逸不去，即使是孟婆汤也无法驱逐。"
            ],
            [
                "name" => "野蛇精",
                "cover" => "野蛇精人物.png",
                "relations" => ["平天大圣", "野猪王", "有来有去", "花狐狸", "长臂猿"],
                "favorites" => ["变身卡"],
                "map" => "魔王山",
                "description" => "原在乌斯藏占山为王，自立门户，后被天兵围剿，不得已投靠平天大圣。始终不甘心寄人篱下，一直在谋划东山再起。"
            ],
            [
                "name" => "卜世仁",
                "cover" => "卜世仁人物.png",
                "relations" => ["孤魂", "牛头", "孟婆"],
                "favorites" => ["变身卡"],
                "map" => "幽冥地府",
                "description" => "卜世仁生前乃是某香料铺老板，因其所作所为极为市侩，以致被世人称为“不是人”，同时其险恶的个性也决定了死后不能轮回的结局。"
            ],
            [
                "name" => "孟婆",
                "cover" => "孟婆人物.png",
                "relations" => ["马面", "龙女", "牛头", "地藏菩萨", "牛头", "卜世仁"],
                "favorites" => ["三级药"],
                "map" => "幽冥地府",
                "description" => "生前饱毒儒释道典籍，劝人为善、潜心修佛，直到八十而终。玉帝感其仁义，命她为“幽冥之神”，常驻与奈何桥旁，为所有前往投胎的灵体提供孟婆汤。"
            ],
            [
                "name" => "地藏菩萨",
                "cover" => "地藏菩萨人物.png",
                "relations" => ["镇元子", "龙王敖广", "通灵道人", "慧痴", "李世民", "马面", "牛头", "孟婆", "玉皇大帝", "孤魂"],
                "favorites" => ["古玩"],
                "map" => "幽冥地府",
                "description" => "地藏菩萨曾发大愿，要普渡世间众生成佛。为了度尽邪魔，他甘心堕入地狱，在地狱森罗殿中创立幽冥地府一派，希望能够藉由佛法普度众生。"
            ],
            [
                "name" => "慧心",
                "cover" => "慧心人物.png",
                "relations" => ["慧仁", "明月", "慧痴", "大慧禅师", "慧真", "明月", "善财童子", "玄弘"],
                "favorites" => ["素斋", "农作物"],
                "map" => "佛门",
                "description" => "作为大慧禅师的关门弟子，慧心深受佛门众师兄的照顾。这个小和尚平时寡言少语，对认定的事情却异常执拗，在佛法上也有着极高的悟性。"
            ],
            [
                "name" => "秋水",
                "cover" => "秋水人物.png",
                "relations" => ["盘丝大仙", "泽野", "蒙面人", "雪瑶", "女御史", "幽蓝", "龙女", "翼仙", "如意", "奈良", "袁飞", "晴佳", "夏荷"],
                "favorites" => ["鲜花", "百花露", "宝石"],
                "map" => "天魔里",
                "description" => "有人说，秋水之美，抚弄少年心弦，羡煞满园樱花。她如今幽居于天魔里，似乎在等待某人归来。"
            ],
            [
                "name" => "顺风耳",
                "cover" => "顺风耳人物.png",
                "relations" => ["巨灵神", "千里眼", "护剑弟子", "杨戬", "柳乘风", "百晓通"],
                "favorites" => ["三级药"],
                "map" => "凌霄天宫",
                "description" => "顺风耳使山中柳枝所化，天生目盲，耳朵却极其敏锐，能够听清千里之外蚊蝇翅膀扇动的声音。后随千里眼加入天庭，司职情报收集工作。"
            ],
            [
                "name" => "青莲",
                "cover" => "青莲人物.png",
                "relations" => ["龙女", "南极仙翁", "玲珑", "善财童子", "文曲星君", "观音菩萨", "红线童子"],
                "favorites" => ["二级药", "三级药"],
                "map" => "南海普陀",
                "description" => "本是观音大士莲花池中的一株青莲，后受佛法熏陶、感之既久，最终修成人形。曾偷下凡间，回来之后因难忘人间美食，所以经常挂在嘴边。"
            ],
            [
                "name" => "媚灵",
                "cover" => "媚灵人物.png",
                "relations" => ["盘丝大仙", "女御史", "彩翼", "平天大圣", "翼仙", "秋菊", "长臂猿", "幽蓝", "万兽之王", "大耳怪"],
                "favorites" => ["二级药", "三级药"],
                "map" => "盘丝岭",
                "description" => "媚灵自幼体弱，无法像其他盘丝弟子一般修习术法。但她天生丽质，如西子再生，所以在媚术上颇有造诣。"
            ],
            [
                "name" => "巨灵神",
                "cover" => "巨灵神人物.png",
                "relations" => ["长臂猿", "顺风耳", "杨戬", "柳乘风", "野猪王"],
                "favorites" => ["三级药"],
                "map" => "凌霄天宫",
                "description" => "巨灵神为天庭先锋，力能移山、武力超凡。五百年前花果山一战，他惨败于齐天大圣之手。战后他闭关修炼，期待将来有机会能够再战“弼马温”。"
            ],
            [
                "name" => "慧痴",
                "cover" => "慧痴人物.png",
                "relations" => ["大慧禅师", "慧真", "慧心", "地藏菩萨", "明月", "慧仁", "孤魂", "玄弘", "通灵道人", "善财童子"],
                "favorites" => ["素斋", "农作物"],
                "map" => "佛门",
                "description" => "独居佛门后山的疯和尚，不受戒律约束，举止似痴若狂，寺中众人避之唯恐不及，唯有大慧禅师对他嘉许有加。为避免他惊扰香客，大慧禅师让他在后山面壁思过、体悟佛法。"
            ],
            [
                "name" => "蟹将军",
                "cover" => "蟹将军人物.png",
                "relations" => ["龟千岁", "牛头", "御林军左护卫", "龙王敖广", "幽蓝", "护剑弟子", "巡海鱼兵"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "东海龙宫近卫水军统领，常年镇守东海迷宫入口，缉拿一切擅闯东海龙宫者，在东海水族中威望颇高。"
            ],
            [
                "name" => "镇元子",
                "cover" => "镇元子人物.png",
                "relations" => ["南极仙翁", "清风", "地藏菩萨", "侯君集", "明月", "白云", "大觉金仙", "太上老君", "殷丞相", "玉皇大帝", "百晓通"],
                "favorites" => ["古玩"],
                "map" => "镇元五庄",
                "description" => "镇元子坐镇五庄乾坤殿，执掌镇元五庄一派，其修为通天彻地，被三界共尊为“天下地仙之祖”。"
            ],
            [
                "name" => "大觉金仙",
                "cover" => "大觉金仙人物.png",
                "relations" => ["玄明", "太上老君", "护剑弟子", "玄弘", "殷丞相", "镇元子", "百晓通", "何道长", "南极仙翁", "玉皇大帝"],
                "favorites" => ["古玩"],
                "map" => "七星方寸",
                "description" => "大觉金仙是何来历，即便是七星方寸众弟子都知之甚少。很多人都认为大觉金仙本身就是“道”的化身，是超脱轮回、不朽不灭的存在。"
            ],
            [
                "name" => "护剑弟子",
                "cover" => "护剑弟子人物.png",
                "relations" => ["玄明", "玄弘", "何道长", "牛头", "御林军左护卫", "彩翼", "御林军右护卫", "大觉金仙", "蟹将军"],
                "favorites" => ["武器", "防具"],
                "map" => "七星方寸",
                "description" => "护剑弟子拜入七星方寸不久，本该守卫山门。恰逢灵剑峰前代护剑弟子失踪，师尊便委派他镇守灵剑峰入口。他心性善良，始终相信人魔并无本质区别，只有善恶之分。"
            ],
            [
                "name" => "奈良",
                "cover" => "奈良人物.png",
                "relations" => ["泽野", "县令", "慧仁", "袁飞", "蒙面人", "秋水", "御林军左护卫"],
                "favorites" => ["暗器"],
                "map" => "天魔里",
                "description" => "奈良隐居于樱花烂漫的天魔里，他是一个浪人，却不免为爱所困，为情所伤。"
            ],
            [
                "name" => "龙女",
                "cover" => "龙女人物.png",
                "relations" => ["善财童子", "玲珑", "青莲", "龙王敖广", "盘丝大仙", "观音菩萨", "龟千岁", "幽蓝", "翼仙", "孟婆", "秋水", "女御史"],
                "favorites" => ["二级药", "三级药"],
                "map" => "南海普陀",
                "description" => "龙女出生于东海，从小就展示出惊人的悟性，儿时偶听文殊菩萨演说法华经，豁然觉悟。从此通达佛法。后前往南海普陀随观音大士修习佛法，以龙身成就佛道。"
            ],
            [
                "name" => "蟹兵",
                "cover" => "蟹兵人物.png",
                "relations" => ["鱼兵", "青壳蚌精", "龙王敖广", "牛头", "御林军左护卫", "幽蓝", "马面", "御林军右护卫"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "来自东海迷宫的小海蟹，武艺平平，还有些小迷糊。虽只是一介无名小卒，却一直有着封王拜相的梦想。"
            ],
            [
                "name" => "白云",
                "cover" => "白云人物.png",
                "relations" => ["明月", "玲珑", "红线童子", "镇元子", "清风", "小虎", "侯君集"],
                "favorites" => ["二级药", "三级药"],
                "map" => "镇元五庄",
                "description" => "白云是镇元子座下的小道童，随大仙修道百余载，却依旧保持稚童的身体与心性。性格有些懦弱，但是关键时刻能爆发出远超常人的实力。"
            ],
            [
                "name" => "盘丝大仙",
                "cover" => "盘丝大仙人物.png",
                "relations" => ["彩翼", "媚灵", "秋菊", "女御史", "龙女", "嫦娥", "晴佳", "翼仙", "夏荷", "雪瑶", "如意", "秋水"],
                "favorites" => ["古玩", "鲜花"],
                "map" => "盘丝岭",
                "description" => "盘丝岭一脉自古修习媚术，而掌门盘丝大仙更是达到了登峰造极的地步。数百年来，她始终肤如凝脂、面若桃花，美艳不可方物。"
            ],
            [
                "name" => "慧仁",
                "cover" => "慧仁人物.png",
                "relations" => ["大慧禅师", "慧真", "慧心", "御林军左统领", "奈良", "慧痴", "县令"],
                "favorites" => ["素斋", "农作物"],
                "map" => "佛门",
                "description" => "慧仁现居佛门，跟随师父修行，坊间传言慧仁本是江湖中人，因为感情纠葛，遁入空门。"
            ],
            [
                "name" => "慧真",
                "cover" => "慧真人物.png",
                "relations" => ["慧仁", "慧痴", "慧心", "大慧禅师"],
                "favorites" => ["素斋", "农作物"],
                "map" => "佛门",
                "description" => "作为佛门首席后勤弟子，慧真每日的工作无法使打扫厢房、浇水种菜，有些碌碌无为。与之攀谈后才知慧真小师傅对佛法有着自己独到的理解。"
            ],
            [
                "name" => "千里眼",
                "cover" => "千里眼人物.png",
                "relations" => ["巨灵神", "杨戬", "百晓通", "柳乘风", "顺风耳", "太上老君"],
                "favorites" => ["三级药"],
                "map" => "凌霄天宫",
                "description" => "千里眼本是棋盘山上一桃精，偶然修得眼观千里之术，能够辨识千里之外的奇珍异兽。玉帝怜其才，擢升他为天庭常侍将军，负责天庭情报收集工作。"
            ],
            [
                "name" => "龟千岁",
                "cover" => "龟千岁人物.png",
                "relations" => ["龙王敖广", "蟹将军", "龙女", "幽蓝", "巡海鱼兵"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "龟千岁已经记不清自己到底有几千岁了，那年猴子撒泼，抢走了定海神针，仿佛还是昨天的事。为了东海，为了东海龙宫，他可是操碎了心。"
            ],
            [
                "name" => "玲珑",
                "cover" => "玲珑人物.png",
                "relations" => ["龙女", "青莲", "善财童子", "白云", "观音菩萨"],
                "favorites" => ["二级药", "三级药"],
                "map" => "南海普陀",
                "description" => "玲珑本是清贫人家的女儿，尚在襁褓之中就被当地乡绅抢走，以祭奠海神。幼小的玲珑再海上漂了一天一夜，将死之际被龙女发现，带至南海普陀抚养长大。"
            ],
            [
                "name" => "青壳蚌精",
                "cover" => "青壳蚌精人物.png",
                "relations" => ["幽蓝", "蟹兵", "龙王敖广", "鱼兵"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "青壳蚌精本是青河中一枚小河蚌，得水精而渐生灵性。后龙王设东海龙宫一派，有教无类，将小蚌精收至门下。她随龙王修炼呼风唤雨之术，不足百年便修成人形。"
            ],
            [
                "name" => "马面",
                "cover" => "马面人物.png",
                "relations" => ["鱼兵", "孤魂", "孟婆", "牛头", "地藏菩萨", "蟹兵", "巡山小妖", "御林军右护卫"],
                "favorites" => ["变身卡"],
                "map" => "幽冥地府",
                "description" => "自地府创立以来，马面一直是阎王的左膀右臂。他手持烈焰剑追魂铃，捉拿三界一切游魂秽物，与“牛头”并称为“地府双煞”。"
            ],
            [
                "name" => "大慧禅师",
                "cover" => "大慧禅师人物.png",
                "relations" => ["通灵道人", "文曲星君", "太上老君", "吴朴智", "慧仁", "观音菩萨", "何道长", "慧痴", "云游僧人", "慧心", "慧真"],
                "favorites" => ["古玩"],
                "map" => "佛门",
                "description" => "没人知道大慧禅师的过往，只知他不惑之年才落发出家，拜在佛门前代方丈座下，潜心修行佛法。前代方丈涅槃之后，大慧成为佛门的掌门。"
            ],
            [
                "name" => "观音菩萨",
                "cover" => "观音菩萨人物.png",
                "relations" => ["大慧禅师", "龙女", "嫦娥", "善财童子", "青莲", "玲珑", "太上老君", "云游僧人", "文曲星君"],
                "favorites" => ["古玩", "三级药"],
                "map" => "南海普陀",
                "description" => "观音大士佛法无边、普渡众生，拯救万民于危难，也受到万民的景仰朝拜。传说她住在虚无缥缈的南海普陀中，回应着三界众生的祷告。"
            ],
            [
                "name" => "平天大圣",
                "cover" => "平天大圣人物.png",
                "relations" => ["巡山小妖", "土匪", "野猪王", "野蛇精", "善财童子", "媚灵", "长臂猿", "幽蓝", "大耳怪", "万兽之王"],
                "favorites" => ["古玩"],
                "map" => "魔王山",
                "description" => "平天大圣为灵牛修炼千年得道，法力深不可测，能够法天地象，无所不能。在他的领导下，魔王山广交天下英雄，成为三界中不可忽视的力量。"
            ],
            [
                "name" => "清风",
                "cover" => "清风人物.png",
                "relations" => ["镇元子", "明月", "白云", "侯君集", "小虎"],
                "favorites" => ["二级药", "三级药"],
                "map" => "镇元五庄",
                "description" => "镇元五庄弟子，顽皮聪慧，悟性颇高，只是时常捣蛋惹祸，常常被镇元子罚去后院面壁思过。"
            ],
            [
                "name" => "牛头",
                "cover" => "牛头人物.png",
                "relations" => ["护剑弟子", "孤魂", "蟹兵", "蟹将军", "御林军右护卫", "卜世仁", "马面", "御林军左护卫", "孟婆", "地藏菩萨", "鱼兵"],
                "favorites" => ["变身卡"],
                "map" => "幽冥地府",
                "description" => "当今之世，提及牛头必定不会忘了马面。但牛头的来历似乎比马面更加扑朔迷离，他手持拘魂锁判官令，是一切妖魔鬼怪的克星。"
            ],
            [
                "name" => "彩翼",
                "cover" => "彩翼人物.png",
                "relations" => ["盘丝大仙", "媚灵", "护剑弟子", "翼仙", "女御史", "秋菊"],
                "favorites" => ["二级药", "三级药"],
                "map" => "盘丝岭",
                "description" => "“柳下金兰魅影随，花间蝴舞暖心扉”，如此诗词大概也只有盘丝岭的彩翼可当。她在花间轻盈飞舞的动人身影也撩动了某个少年的心房。"
            ],
            [
                "name" => "玄弘",
                "cover" => "玄弘人物.png",
                "relations" => ["玄明", "护剑弟子", "何道长", "大觉金仙", "慧痴", "慧心", "明月", "善财童子"],
                "favorites" => ["素斋", "农作物"],
                "map" => "七星方寸",
                "description" => "玄弘自小拜入七星方寸，不精修法术，却沉醉于道术典籍，出言无不引经据典，人人皆称其为“道痴”。"
            ],
            [
                "name" => "玄明",
                "cover" => "玄明人物.png",
                "relations" => ["护剑弟子", "玄弘", "大觉金仙", "袁飞", "何道长", "泽野", "吴朴智", "流浪艺人"],
                "favorites" => ["素斋", "农作物"],
                "map" => "七星方寸",
                "description" => "玄明本是一方显贵，后因家中变故导致厌弃世俗。他毅然散尽万贯家财，拜入七星方寸修道，过起了闲云野鹤般的生活。"
            ],
            [
                "name" => "袁飞",
                "cover" => "袁飞人物.png",
                "relations" => ["秋菊", "泽野", "玄明", "何道长", "秋水", "奈良", "流浪艺人", "吴朴智"],
                "favorites" => ["暗器", "古玩"],
                "map" => "天魔里",
                "description" => "十数年前，扶桑第一忍者袁飞毅然出海、远渡重洋，在傲来国附近创建天魔里。他广收弟子，传承忍法秘术，短时间内将默默无闻的天魔里发展为一个庞然大物。"
            ],
            [
                "name" => "嫦娥",
                "cover" => "嫦娥人物.png",
                "relations" => ["盘丝大仙", "观音菩萨", "晴佳", "杨戬", "夏荷", "雪瑶", "如意"],
                "favorites" => ["三级药"],
                "map" => "凌霄天宫",
                "description" => "嫦娥常年幽居广寒宫，有闭月羞花之容，沉鱼落雁之貌，一笑倾城，再笑倾国。似乎与天蓬元帅有着一段纠缠不清的情史。"
            ],
            [
                "name" => "杨戬",
                "cover" => "杨戬人物.png",
                "relations" => ["玉皇大帝", "大觉金仙", "千里眼", "顺风耳", "李总镖头", "柳乘风", "太上老君", "嫦娥", "巨灵神", "秦琼", "侯君集"],
                "favorites" => ["古玩"],
                "map" => "凌霄天宫",
                "description" => "二郎神杨戬天生与道亲和、法力无边。五百年前，杨戬奉旨出山，力敌齐天大圣，并将之生擒活捉，可谓居功至伟。战后受命执掌凌霄天宫一脉，深受玉帝器重。"
            ],
            [
                "name" => "鱼兵",
                "cover" => "鱼兵人物.png",
                "relations" => ["幽蓝", "蟹兵", "马面", "青壳蚌精", "御林军左护卫", "龙王敖广", "牛头", "御林军右护卫"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "东海龙宫大门前的站岗小兵，虽是名不见经传的小人物，却也过得逍遥快活，常常在夜里偷偷浮出水面，去不远处的青河镇外东海湾玩耍。"
            ],
            [
                "name" => "龙王敖广",
                "cover" => "龙王敖广人物.png",
                "relations" => ["李世民", "玉皇大帝", "龙女", "龟千岁", "蟹兵", "幽蓝", "地藏菩萨", "蟹将军", "巡海鱼兵", "青壳蚌精", "鱼兵"],
                "favorites" => ["古玩", "水产品"],
                "map" => "东海龙宫",
                "description" => "敖广是司雨之神，能够飞天遁地、呼风唤雨。为培养人才，他创立东海龙宫一派，将无上妙法倾囊想授，希望能够造福四海、泽被苍生。"
            ],
            [
                "name" => "巡海鱼兵",
                "cover" => "巡海鱼兵人物.png",
                "relations" => ["幽蓝", "龙王敖广", "蟹将军", "龟千岁"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "龙王敖广麾下一名出色的战士，在魔主出世、引发浩劫之时拯救无数东海水族。战功累累的他放弃了晋升将领的资格，独自巡视东海迷宫，似乎在等什么人归来。"
            ],
            [
                "name" => "花狐狸",
                "cover" => "花狐狸人物.png",
                "relations" => ["有来有去", "戏院老板", "曾浩迟", "万兽之王", "长臂猿", "野蛇精", "巡山小妖", "掌柜", "香客"],
                "favorites" => ["变身卡"],
                "map" => "万兽岭",
                "description" => "妖族的经商奇才，不愧为狐中之狐，目光之敏锐，心思之缜密，无出其右者，常说“若是生在人间，恐怕皇帝老子一半的财富都是属于本狐的~！”"
            ],
            [
                "name" => "有来有去",
                "cover" => "有来有去人物.png",
                "relations" => ["巡山小妖", "花狐狸", "长臂猿", "野蛇精", "野猪王", "恶熊", "万兽之王", "灰猿", "大耳怪"],
                "favorites" => ["变身卡"],
                "map" => "万兽岭",
                "description" => "万兽岭首席传令兵，掌管万兽岭上万只信鸽与上千匹驿马。相貌虽丑陋却义气为先，为了兄弟义气可以两肋插刀、在所不辞，算得上是妖中豪杰。"
            ],
            [
                "name" => "万兽之王",
                "cover" => "万兽之王人物.png",
                "relations" => ["巡山小妖", "平天大圣", "灰猿", "幽蓝", "花狐狸", "有来有去", "媚灵", "大耳怪", "长臂猿"],
                "favorites" => ["古玩", "宠物装备"],
                "map" => "万兽岭",
                "description" => "万兽之王统领着万兽岭三千六百洞，其人力大无穷、法力高绝，可移山填海、毁天灭地，手下精兵强将更是不计其数，是当之无愧的一方妖雄。"
            ],
            [
                "name" => "玉皇大帝",
                "cover" => "玉皇大帝人物.png",
                "relations" => ["李世民", "杨戬", "太上老君", "南极仙翁", "龙王敖广", "大觉金仙", "镇元子", "地藏菩萨"],
                "favorites" => ["三级药"],
                "map" => "凌霄天宫",
                "description" => "玉帝居于凌霄天宫凌霄殿，统御三界众生，凡违逆者，必受雷劫天罚，永世不得超生。"
            ],
            [
                "name" => "幽蓝",
                "cover" => "幽蓝人物.png",
                "relations" => ["青壳蚌精", "巡海鱼兵", "柳乘风", "龙王敖广", "平天大圣", "龙女", "龟千岁", "彩翼", "万兽之王", "大耳怪", "鱼兵", "秋水", "媚灵", "蟹兵", "蟹将军", "长臂猿"],
                "favorites" => ["变身卡"],
                "map" => "东海龙宫",
                "description" => "美丽的氏人族姑娘，氏人族本生长于东海迷宫之中，与龙族素无往来，不知为何幽蓝竟在东海龙宫久住，而且一住就是百年。"
            ],
            [
                "name" => "明月",
                "cover" => "明月人物.png",
                "relations" => ["白云", "清风", "镇元子", "侯君集", "慧心", "慧痴", "善财童子", "玄弘"],
                "favorites" => ["二级药", "三级药"],
                "map" => "镇元五庄",
                "description" => "镇元五庄弟子，乖巧听话，心地善良。他天生通灵之体，能够勾动日精月华，修炼事半功倍，镇元子一直对他疼爱有加。"
            ],
            [
                "name" => "李世民",
                "cover" => "李世民人物.png",
                "relations" => ["程将军", "侯君集", "龙王敖广", "殷丞相", "玉皇大帝", "房玄龄", "魏征", "秦琼", "地藏菩萨"],
                "favorites" => ["二级庭院装饰"],
                "map" => "金銮殿",
                "description" => "唐皇李世民一代豪雄，先助高祖太原起兵、平定天下，后发动玄武门之变，正式登基为皇，雄才大略堪比秦皇汉武。在位期间轻徭薄税、休养生息，开创一派贞观之治的盛世繁华。"
            ],
            [
                "name" => "魏征",
                "cover" => "魏征人物.png",
                "relations" => ["刘举人", "殷丞相", "翰林学士", "李员外", "李世民", "秦琼", "吕大人", "侯君集", "房玄龄", "程将军"],
                "favorites" => ["二级庭院装饰"],
                "map" => "金銮殿",
                "description" => "魏征乃当朝宰相，以直谏感言著称，因主张仁义治国而备受赞誉。与李世民的“明君贤臣”组合更成为一时佳话。"
            ],
            [
                "name" => "房玄龄",
                "cover" => "房玄龄人物.png",
                "relations" => ["程将军", "殷丞相", "李员外", "吕大人", "刘举人", "李世民", "柳乘风", "翰林学士", "秦琼", "侯君集", "魏征"],
                "favorites" => ["二级庭院装饰"],
                "map" => "金銮殿",
                "description" => "唐初柱国贤臣，处事果断、善于谋划，早年随李世民经营四方、挫败群雄，后参与策划玄武门之变，助秦王夺取天下，有筹谋帷幄，定社稷之功。"
            ],
            [
                "name" => "侯君集",
                "cover" => "侯君集人物.png",
                "relations" => ["李世民", "程将军", "秦琼", "衙役", "镇元子", "百合", "明月", "清风", "白云", "殷丞相", "房玄龄", "杨戬", "李总镖头"],
                "favorites" => ["二级庭院装饰"],
                "map" => "金銮殿",
                "description" => "侯君集年轻时不学无术，轻浮放荡，加入秦王府后洗心革面，在隋末乱战中屡立战功。天下初定之后，侯君集因居功自傲、私藏宝物获罪，后心灰意懒，渐渐淡出政事。"
            ],
            [
                "name" => "姬长歌",
                "cover" => "姬长歌人物.png",
                "relations" => ["拓跋玉瑾", "御虚真人", "孟非梦"],
                "favorites" => ["古玩", "美酒"],
                "map" => "无名谷",
                "description" => "现任无名谷谷主，年少时曾违逆祖训私自离开无名谷，也因此意识到无名谷重归三界的重要性。执掌无名谷以后，力排众议，最终使得这个沉寂数千年之久的神秘势力重新出现在世人眼前。"
            ],
            [
                "name" => "拓跋玉瑾",
                "cover" => "拓跋玉瑾.png",
                "relations" => ["姬长歌"],
                "favorites" => ["鲜花", "百花露"],
                "map" => "无名谷",
                "description" => "祖辈曾是北魏皇室，机缘巧合之下成为了无名谷弟子。虽生自名门望族，却毫无纨绔之气。聪颖伶俐，深得无名谷众人喜爱。"
            ],
            [
                "name" => "御虚真人",
                "cover" => "御虚真人.png",
                "relations" => ["姬长歌"],
                "favorites" => ["三级药"],
                "map" => "无名谷",
                "description" => "四处云游修行的散仙，来到无名谷之后与姬长歌一见如故。最终决定放弃云游，留在无名谷助姬长歌一臂之力。"
            ],
            [
                "name" => "孟非梦",
                "cover" => "孟非梦.png",
                "relations" => ["姬长歌"],
                "favorites" => ["百花露", "宝石"],
                "map" => "无名谷",
                "description" => "大家只知道非梦是一个有故事的人，至于是什么样的故事，无人知晓。非梦从来不愿意与人提及自己的过往，只是时常站在廊桥上失神地眺望远方。"
            ],
        ];

        // 创建数据
        $maps = Map::get()->keyBy('name');
        Npc::insert(collect($items)->map(function ($item) use ($maps) {
            $map = $maps[$item['map']];

            unset($item['map']);
            unset($item['relations']);
            unset($item['favorites']);

            return array_merge($item, [
                'map_id' => $map['id'],
                "created_at" => Carbon::now(),
                "updated_at" => Carbon::now(),
            ]);
        })->toArray());

        // 创建关联
        $items = collect($items)->keyBy('name');
        $produces = Produce::where('category', '角色喜好')->get()->keyBy('name');
        $npcs = Npc::get()->keyBy('name');

        Npc::get()->map(function ($npc) use ($produces, $items, $npcs) {
            $relations = [];
            $data = $items[$npc['name']]['favorites'];

            foreach($data as $key => $value) {
                if ($value === '变身卡' || $value === '百花露') return;
                $relations[$key] = $produces[$value]['id'];
            }

            $npc->favorites()->attach($relations);

            $relations = [];
            $data = $items[$npc['name']]['relations'];

            foreach($data as $key => $value) {
                $relations[$key] = $npcs[$value]['id'];
            }

            $npc->friends()->attach($relations);
        });
    }
}
