<?php

use App\Models\Question;
use Illuminate\Support\Carbon;
use Illuminate\Database\Seeder;

class QuestionsLiteratureSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $questions = [
            [
                "category" => "文学",
                "question" => "《寒号鸟的故事》这则寓言告诉我们做事要有远见，今天的事情今天做，寄希望于明天的人，是一事无成的人。那你知道寒号鸟是什么动物吗？",
                "answer" => "鼹鼠"
            ],
            [
                "category" => "文学",
                "question" => "鸿鹄是指鸟类中的大雁和天鹅，是用来比喻有远大志向的人，请问这个成语是什么呢？",
                "answer" => "鸿鹄之志"
            ],
            [
                "category" => "文学",
                "question" => "有“六十年间万首诗”之称的著名爱国诗人是？",
                "answer" => "陆游"
            ],
            [
                "category" => "文学",
                "question" => "商人的商最早的意思是",
                "answer" => "商朝"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“春色满园关不住，一枝红杏出墙来”是宋代龙泉大诗人叶绍翁的千古名句，它出自哪篇诗作？",
                "answer" => "《游园不值》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“在天愿做比翼鸟，在地愿为连理枝”出自哪首诗？",
                "answer" => "长恨歌"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“天上星河转”的下一句是什么？",
                "answer" => "人间帘幕垂"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“七月七日长生殿”的下半句是",
                "answer" => "夜半无人私语时"
            ],
            [
                "category" => "文学",
                "question" => "法国文学巨著《茶花女》是谁的作品？",
                "answer" => "小仲马"
            ],
            [
                "category" => "文学",
                "question" => "《孔乙己》,《药》,《阿Q正传》这几部作品均出自中国现代文学的哪位大文豪？",
                "answer" => "鲁迅"
            ],
            [
                "category" => "文学",
                "question" => "“烟花三月下扬州”这首诗句出自李白的哪首诗？",
                "answer" => "黄鹤楼送孟浩然之广陵"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“但使龙城飞将在，不教胡马度阴山”出自谁的作品？",
                "answer" => "王昌龄"
            ],
            [
                "category" => "文学",
                "question" => "“天无三日晴，地无三尺平”指的是我国的哪一个省份？",
                "answer" => "贵州"
            ],
            [
                "category" => "文学",
                "question" => "“偃武修文”的“偃”字是什么意思？",
                "answer" => "停止"
            ],
            [
                "category" => "文学",
                "question" => "“青梅竹马”指少年男女天真纯洁的感情长远而深厚。请问它来自哪个诗人的名句？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "下面哪个是对“惊蛰”这个节气的正确描述？",
                "answer" => "天暖打雷，万物复苏"
            ],
            [
                "category" => "文学",
                "question" => "下列哪位唐朝诗人是边塞诗的代表人物？",
                "answer" => "岑参"
            ],
            [
                "category" => "文学",
                "question" => "诗词《过故人庄》的作者是谁？",
                "answer" => "孟浩然"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“两情若是长久时，又岂在朝朝暮暮”语出哪位诗人？",
                "answer" => "秦观"
            ],
            [
                "category" => "文学",
                "question" => "开创了豪放诗派，“出新意于法度之中，寄妙理于豪放之外”，说的是谁？",
                "answer" => "苏轼"
            ],
            [
                "category" => "文学",
                "question" => "《范进中举》一文中，范进“中举”是参加了哪场考试？",
                "answer" => "乡试"
            ],
            [
                "category" => "文学",
                "question" => "“玉兔”“蟾蜍”“桂魄”都是用来形容什么的？",
                "answer" => "月亮"
            ],
            [
                "category" => "文学",
                "question" => "“风声雨声读书声，声声入耳；家事国事天下事，事事关心”这幅对联是题写在哪座书院的？",
                "answer" => "东林书院"
            ],
            [
                "category" => "文学",
                "question" => "古诗的体制称为“风雅颂”，其中“颂”是指？",
                "answer" => "宗庙乐歌"
            ],
            [
                "category" => "文学",
                "question" => "“民为贵，社稷次之，君为轻”这句话出自哪部作品？",
                "answer" => "《孟子》"
            ],
            [
                "category" => "文学",
                "question" => "明代戏剧《牡丹亭》又称作？",
                "answer" => "《还魂梦》"
            ],
            [
                "category" => "文学",
                "question" => "“旦辞爷娘去，暮宿黄河边”摘自《乐府诗集》中的“木兰诗”，这句开头的“旦”是什么意思？",
                "answer" => "早晨，清早"
            ],
            [
                "category" => "文学",
                "question" => "“上知天文下知地理”形容一个人博学多才，无所不知。它最初是用来形容谁？",
                "answer" => "伍子胥"
            ],
            [
                "category" => "文学",
                "question" => "诗仙李白的诗作风格豪迈，气势磅礴，名句“飞流直下三千尺，疑是银河落九天”出自他的哪一首诗？",
                "answer" => "望庐山瀑布"
            ],
            [
                "category" => "文学",
                "question" => "《草原》的作者是？",
                "answer" => "老舍"
            ],
            [
                "category" => "文学",
                "question" => "“中庸之道”是哪个流派的理论？",
                "answer" => "儒家"
            ],
            [
                "category" => "文学",
                "question" => "格言“今天所做之事勿侯明天，自己所做之事勿侯他人。”出自哪位诗人？",
                "answer" => "歌德"
            ],
            [
                "category" => "文学",
                "question" => "《孔乙己》、《药》、《阿Q正传》这几部作品均出自中国现代文学的哪位大文豪？",
                "answer" => "鲁迅"
            ],
            [
                "category" => "文学",
                "question" => "白居易曾经在琵琶行里用“大珠小珠落玉盘”来形容的乐器是？",
                "answer" => "琵琶"
            ],
            [
                "category" => "文学",
                "question" => "假如你是关汉卿《窦娥冤》中的一个角色，你最可能遇到的情况是？",
                "answer" => "六月飞雪"
            ],
            [
                "category" => "文学",
                "question" => "曹操不仅是杰出的政治家，军事家，而且是出色的文学家，以下哪一部是他的作品？",
                "answer" => "《观沧海》"
            ],
            [
                "category" => "文学",
                "question" => "赵翼《论诗》“江山代有才人出”的下句是？",
                "answer" => "各领风骚数百年"
            ],
            [
                "category" => "文学",
                "question" => "《西游记》中的火焰山原型是在现在的哪个地方？",
                "answer" => "新疆"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“问世间，情为何物，直教生死相许”语出？",
                "answer" => "元好问"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“山重水复疑无路，柳暗花明又一村。”此句的作者是？",
                "answer" => "陆游"
            ],
            [
                "category" => "文学",
                "question" => "在诗歌创作上主张“文章合为时而著，歌诗合为事而作”的唐代诗人是？",
                "answer" => "白居易"
            ],
            [
                "category" => "文学",
                "question" => "我国古典文学名著《三国演义》中塑造了一个过五关，斩六将，千里走单骑的英雄形象，这位英雄是谁？",
                "answer" => "关羽"
            ],
            [
                "category" => "文学",
                "question" => "通假字在文言文里经常出现,“虽有千里之能,食不饱,力不足,才美不外见”摘自唐朝学者韩愈的《马说》,这句话里的通假字是？",
                "answer" => "见,通“现”"
            ],
            [
                "category" => "文学",
                "question" => "以下不是白居易《长恨歌》中抒发爱情的诗句是？",
                "answer" => "两情若是久长时，又岂在朝朝暮暮。"
            ],
            [
                "category" => "文学",
                "question" => "“丑八怪”用以形容外貌丑陋的人。它最初来源于哪里？",
                "answer" => "扬州八怪"
            ],
            [
                "category" => "文学",
                "question" => "“敏而好学，不耻下问”这句《论语》指出在学习中，应该注意哪一些方面？",
                "answer" => "学习态度"
            ],
            [
                "category" => "文学",
                "question" => "“六如居士”是谁的别号？",
                "answer" => "唐伯虎"
            ],
            [
                "category" => "文学",
                "question" => "“红娘”是哪部作品中的人物？",
                "answer" => "西厢记"
            ],
            [
                "category" => "文学",
                "question" => "下列哪个字具有汉字的八字基本笔画“点，横，竖，撇，捺，折，钩，提”的特征？",
                "answer" => "永"
            ],
            [
                "category" => "文学",
                "question" => "《晏子使楚》节选自古文《晏子春秋》,这段文章标题里的“使楚”意思是？",
                "answer" => "出使去楚国"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“国家兴亡，匹夫有责”语出？",
                "answer" => "顾炎武"
            ],
            [
                "category" => "文学",
                "question" => "“山药蛋派”属于以下哪类流派？",
                "answer" => "文学流派"
            ],
            [
                "category" => "文学",
                "question" => "子曰“敏而好学,不耻下问”,这句文言文里的“下问”是指？",
                "answer" => "向不如自己的人请教"
            ],
            [
                "category" => "文学",
                "question" => "汉字“卅”的意思是？",
                "answer" => "三十"
            ],
            [
                "category" => "文学",
                "question" => "文言文《乐羊子妻》里有一句“羊子尝行路，得遗金一饼”，这句话后半句的意思是？",
                "answer" => "拾到一块别人丢失的金饼"
            ],
            [
                "category" => "文学",
                "question" => "人们熟悉的“八卦”是出自？",
                "answer" => "周易"
            ],
            [
                "category" => "文学",
                "question" => "《论语》的作者是谁？",
                "answer" => "孔子的弟子"
            ],
            [
                "category" => "文学",
                "question" => "古诗“风，雅，颂”中的“风”指的是什么？",
                "answer" => "国风"
            ],
            [
                "category" => "文学",
                "question" => "据《不列颠百科全书》所载，迄今为止世界上最大的百科全书是？",
                "answer" => "永乐大典"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“天苍苍，野茫茫，风吹草低见牛羊”描绘的是哪个地方的景色？",
                "answer" => "内蒙古高原"
            ],
            [
                "category" => "文学",
                "question" => "“肉食者鄙，未能远谋”摘自《左传》“曹刿论战”一文，这句话里的“肉食者”是指？",
                "answer" => "有权势有地位的人"
            ],
            [
                "category" => "文学",
                "question" => "相传清代女诗人何佩玉的数字诗写得特别好。比如小诗：“一花一枝一矶石，一抹斜阳一鸟飞，一山一水一寺中，一林黄叶一僧归。”不但未使人感到重复，而且意境悠远，妙趣横生。请问此诗中共有几个“一”字？",
                "answer" => "10"
            ],
            [
                "category" => "文学",
                "question" => "对联“吴学究双掌连环计，宋公明三打祝家庄”应该是哪部小说的目录？",
                "answer" => "《水浒传》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“横看成岭侧成峰,远近高低各不同”出自苏轼的《题西林壁》,它所描写的是哪里的景观？",
                "answer" => "江西庐山"
            ],
            [
                "category" => "文学",
                "question" => "桓侯曰“医之好治不病以为功”，这句文言文里“好治不病”的意思是什么？",
                "answer" => "喜欢给没有病的人看病"
            ],
            [
                "category" => "文学",
                "question" => "“唐宋八大家”主要靠写哪方面的文章闻名？",
                "answer" => "散文"
            ],
            [
                "category" => "文学",
                "question" => "“其”是文言文里的常用字，以下句子里，“其”作代词用的(相当于“他、他的”)是哪一句？",
                "answer" => "秦王恐其破壁，乃辞谢"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“与君离别意,同是宦游人”出自唐代诗人王勃的《杜少府之任蜀州》,这句里的“宦游人”指的是？",
                "answer" => "外出做官的人"
            ],
            [
                "category" => "文学",
                "question" => "“将军既帝室之胃，信义著于四海”摘自陈寿所著《三国志》的“隆中对”一节，这里的“帝室之胃”意思是？",
                "answer" => "帝王的后代"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“一门三父子，都是大文豪，诗赋传千古，峨眉共比高”。诗中“三父子”是指？",
                "answer" => "苏洵，苏轼，苏辙"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“十年树木，百年树人”出自谁的名言？",
                "answer" => "管仲"
            ],
            [
                "category" => "文学",
                "question" => "“扁鹊见蔡桓公，立有间”，这句文言文里“立有间”可以翻译为？",
                "answer" => "站了一会"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“常记溪亭日暮，沉醉不知归路。兴尽晚回舟，误入藕花深处。争渡，争渡，惊起一滩鸥鹭。”出自谁的词？",
                "answer" => "李清照"
            ],
            [
                "category" => "文学",
                "question" => "“问苍茫大地，谁主浮沉？”是出自谁作的词？",
                "answer" => "毛泽东"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“抽刀断水水更流，举杯浇愁愁更愁”出自哪位诗人笔下？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "“阿爷无大儿，木兰无长兄，愿为市鞍马，从此替爷征”摘自《乐府诗集》中的《木兰诗》(《木兰辞》)一文，其中“愿为市鞍马”的“市”是指？",
                "answer" => "去集市购买"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“欲穷千里目,更上一层楼”是唐朝诗人王之涣的名句,这里的“更上一层楼”指的是哪座楼？",
                "answer" => "山西鹳雀楼"
            ],
            [
                "category" => "文学",
                "question" => "维纳斯是希腊神话中的什么神？",
                "answer" => "爱神和美神"
            ],
            [
                "category" => "文学",
                "question" => "“阡陌交通,鸡犬相闻”出自晋代学者陶渊明的《桃花源记》一文,这句里的“交通”的意思是？",
                "answer" => "交错相通"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“无意苦争春，一任群芳妒，零落成泥碾作尘，只有香如故”是南宋诗人陆游的名句，借描写花卉来抒发自己的情怀，这种花卉是？",
                "answer" => "梅花"
            ],
            [
                "category" => "文学",
                "question" => "“无丝竹之乱耳，无案牍之劳形”摘自唐代学者刘禹锡的《陋室铭》，这句话里的“丝竹”指的是？",
                "answer" => "乐器，代指音乐"
            ],
            [
                "category" => "文学",
                "question" => "“旦辞爷娘去,幕宿黄河边”摘自《乐府诗集》中的《木兰诗》(《木兰辞》)一文,这句开头的“旦”指的是？",
                "answer" => "早晨,清早"
            ],
            [
                "category" => "文学",
                "question" => "“先帝不以臣卑鄙，猥自枉屈，三顾臣于草庐之中”摘自诸葛亮的《出师表》，这句话里的“卑鄙”意思是？",
                "answer" => "身份低微"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“姑苏城外寒山寺,夜半钟声到客船”出自唐朝诗人张继的《枫桥夜泊》,这里的“姑苏城”是哪座城市的别名？",
                "answer" => "苏州城"
            ],
            [
                "category" => "文学",
                "question" => "“老翁逾墙走，老妇出门看”摘自唐朝杜甫的《石壕吏》一文，这句话里的“逾墙走”可以翻译为？",
                "answer" => "越墙逃跑"
            ],
            [
                "category" => "文学",
                "question" => "“一骑红尘妃子笑”中的“妃子”是指的谁？",
                "answer" => "杨玉环"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“停车坐爱枫林晚，霜叶红于二月花”这两句诗的作者是？",
                "answer" => "杜牧"
            ],
            [
                "category" => "文学",
                "question" => "“不宜妄自菲薄，引喻失义”摘自诸葛亮的《出师表》，这句话里的“妄自菲薄”意思是？",
                "answer" => "过分自卑"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“二十四桥明月夜,玉人何处教吹萧”,“二十四桥仍在,波心荡,冷月无声”这两句古诗所提到的二十四桥在哪里？",
                "answer" => "江苏扬州"
            ],
            [
                "category" => "文学",
                "question" => "“胡人大入塞，丁壮者引弦而战。近塞之人，死者十九”摘自《淮南子》的“塞翁失马”一文，这句话里的“死者十九”意思是？",
                "answer" => "每十人就有九人战死"
            ],
            [
                "category" => "文学",
                "question" => "“一把紫竹伞，一场清明的雨，引出西湖边一段爱情”这段话描述的应该是以下哪个民间故事？",
                "answer" => "白蛇传"
            ],
            [
                "category" => "文学",
                "question" => "“道狭草木长,夕露沾我衣”出自晋代学者陶渊明的《归园田居》一文,这句话里的“夕露”指的是？",
                "answer" => "夜晚的露水"
            ],
            [
                "category" => "文学",
                "question" => "“学而不厌，诲人不倦”出自《论语》，这句话里的“诲”意思是？",
                "answer" => "教导，教诲"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“出师未捷身先死，长使英雄泪满襟”是杜甫的著名诗句，这首诗所怀念的是哪位古人？",
                "answer" => "诸葛亮"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“朝辞白帝彩云间，千里江陵一日还”李白的这首诗词描绘的是哪个地方的景色？",
                "answer" => "三峡"
            ],
            [
                "category" => "文学",
                "question" => "“昨夜见军贴，可汗大点兵。军书十二卷，卷卷有爷名。”这句诗词是出自哪里？",
                "answer" => "《木兰诗》(《木兰辞》)"
            ],
            [
                "category" => "文学",
                "question" => "“无他,但手熟尔”摘自北宋学者欧阳修的《卖油翁》一文,这句话里的“但”意思是？",
                "answer" => "只是,只不过"
            ],
            [
                "category" => "文学",
                "question" => "“尝贻余核舟一,盖大苏泛赤壁云”摘自明朝学者魏学洢的《核舟记》,这句话里的“大苏”指的是？",
                "answer" => "宋朝诗人苏东坡"
            ],
            [
                "category" => "文学",
                "question" => "“永州之野产异蛇，黑质而白章”摘自唐代学者柳宗元的《捕蛇者说》，这句话里的“黑质而白章”意思是？",
                "answer" => "黑色的皮，白色的花纹"
            ],
            [
                "category" => "文学",
                "question" => "“芳草鲜美，落英缤纷”出自陶渊明的《桃花源记》，这句古文里的“鲜美”是指？",
                "answer" => "鲜艳美丽"
            ],
            [
                "category" => "文学",
                "question" => "“北通巫峡,南极潇湘,迁客骚人,多会于此”摘自宋代学者范仲淹的《岳阳楼记》,这句话里的“骚人”是指？",
                "answer" => "诗人,文人"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“日出江花红胜火，春来江水绿如蓝”是白居易的著名诗句，这首诗所描写的是哪里的风景？",
                "answer" => "景色如画的江南"
            ],
            [
                "category" => "文学",
                "question" => "“色即是空，空即是色”此句出自哪部佛教著作？",
                "answer" => "心经"
            ],
            [
                "category" => "文学",
                "question" => "“且”是文言文里的常用字，“被山愚公者，年且九十”这句话里的“且”的意思是？",
                "answer" => "将近"
            ],
            [
                "category" => "文学",
                "question" => "“余幼好书,家贫难致”摘自清代学者袁枚的《黄生借书说》,这句话里的“好书” 意思是？",
                "answer" => "喜欢读书"
            ],
            [
                "category" => "文学",
                "question" => "“益州险赛，沃野千里，天府之土，高祖因之以成帝业”摘自陈寿所著《三国志》的“隆中对”一节，这里的“高祖”是指？",
                "answer" => "汉高祖刘邦"
            ],
            [
                "category" => "文学",
                "question" => "“寡人欲以五百里之地易安陵，安陵君其许寡人”摘自西汉学者刘向的《战国策》，这句话里的“易”的意思是？",
                "answer" => "交换"
            ],
            [
                "category" => "文学",
                "question" => "著名画家徐悲鸿以擅长画什么而闻名？",
                "answer" => "奔马"
            ],
            [
                "category" => "文学",
                "question" => "佛曰：“救人一命，胜造七级浮屠。”其中浮屠的意思是什么？",
                "answer" => "宝塔"
            ],
            [
                "category" => "文学",
                "question" => "《悲惨世界》中的人物是？",
                "answer" => "沙威"
            ],
            [
                "category" => "文学",
                "question" => "《义勇军进行曲》是哪部电影的主题曲？",
                "answer" => "风云儿女"
            ],
            [
                "category" => "文学",
                "question" => "中国无声影片的最高峰《神女》是谁的代表作？",
                "answer" => "阮玲玉"
            ],
            [
                "category" => "文学",
                "question" => "在古希腊古罗马神话中的诸神中，被称为“爱神”的是？",
                "answer" => "丘比特"
            ],
            [
                "category" => "文学",
                "question" => "中国“八仙过海”中倒骑驴的张果老有一天去酒馆购买美酒，但是酒馆小二却告诉张果老，酒馆最近有小贼专偷毛驴，请张果老小心毛贼，请问发生以下哪种事情是符合张果老毛驴特性的？",
                "answer" => "张果老将毛驴化作纸毛驴折叠存放起来"
            ],
            [
                "category" => "文学",
                "question" => "“八仙过海”中的八仙除铁拐李，张果老，吕洞宾，曹国舅外还有？",
                "answer" => "韩湘子，蓝采和，何仙姑，汉钟离"
            ],
            [
                "category" => "文学",
                "question" => "被鲁迅誉之为“史家之绝唱，无韵之离骚”的作品是？",
                "answer" => "《史记》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“身无彩凤双飞翼”的上一句是:",
                "answer" => "画楼西畔桂堂东"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“身无彩凤双飞翼”的下一句是：",
                "answer" => "心有灵犀一点通"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“身无彩凤双飞翼，心有灵犀一点通”是哪一个诗人的诗句？",
                "answer" => "李商隐"
            ],
            [
                "category" => "文学",
                "question" => "《水浒传》中有108位好汉，请问有多少人是天罡星？",
                "answer" => "36"
            ],
            [
                "category" => "文学",
                "question" => "《水浒传》中有108位好汉，请问有多少人是地煞星？",
                "answer" => "72"
            ],
            [
                "category" => "文学",
                "question" => "根据几个词语选出相关联的历史人物:草堂,诗圣,江南逢李龟年？",
                "answer" => "杜甫"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“国破山河在，城春草木深、”出自杜甫的哪首诗？",
                "answer" => "春望"
            ],
            [
                "category" => "文学",
                "question" => "唐朝两位最著名的诗人中，被称为诗圣的是？",
                "answer" => "杜甫"
            ],
            [
                "category" => "文学",
                "question" => "杜甫《新婚别》《垂老别》《离家别》合称什么？",
                "answer" => "三别"
            ],
            [
                "category" => "文学",
                "question" => "杜甫的《石壕吏》《新安吏》《潼关吏》合称什么？",
                "answer" => "三吏"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“飘飘何所似，天地一沙鸥”的作者是",
                "answer" => "杜甫"
            ],
            [
                "category" => "文学",
                "question" => "诗歌在唐代发展到了一个高峰，唐朝诗人杜甫被尊为？",
                "answer" => "诗圣"
            ],
            [
                "category" => "文学",
                "question" => "诗歌在唐代发展到了一个高峰，唐朝诗人白居易被尊为？",
                "answer" => "诗史"
            ],
            [
                "category" => "文学",
                "question" => "杜甫的诗句“忆昔与开元全盛日，小邑犹藏万家室”是描述哪一位皇帝统治时期的社会状况？",
                "answer" => "唐玄宗"
            ],
            [
                "category" => "文学",
                "question" => "“世上疮痍，诗中圣哲；民间疾苦，笔底波澜。”这副对联称颂的是",
                "answer" => "杜甫"
            ],
            [
                "category" => "文学",
                "question" => "杜甫的“稻米流脂粟米白，公私仓廪俱丰实“的诗句反映了唐朝的",
                "answer" => "经济繁荣"
            ],
            [
                "category" => "文学",
                "question" => "诗圣诗仙各是谁？",
                "answer" => "杜甫和李白"
            ],
            [
                "category" => "文学",
                "question" => "杜甫诗云:“晓看红湿处,花重锦官城”,李白诗云:“锦城虽云乐,不如早还家”,请问,成都为什么又叫做“锦城”或“锦官城”？",
                "answer" => "因蜀锦而得名"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“两只黄鹂鸣翠柳，一行白鹭上青天。窗含西岭千秋雪，门泊东吴万里船。”这是大诗人杜甫的诗作，其中“两个黄鹂鸣翠柳，一行白鹭上青天”这一句中包含了几种颜色？",
                "answer" => "4"
            ],
            [
                "category" => "文学",
                "question" => "杜甫的《丹青引赠曹将军霸》中有个名句“但恨无过王右军”，这位王右军是指谁？",
                "answer" => "王羲之"
            ],
            [
                "category" => "文学",
                "question" => "杜甫的《赠卫八处士》中有一句“动如参与商”，请问参与商是指什么？",
                "answer" => "星宿"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“文章千古事，得失寸心知”是谁的名句？",
                "answer" => "杜甫"
            ],
            [
                "category" => "文学",
                "question" => "杜甫诗句“故人入我梦，明我长相忆。君今在罗网，何以有羽翼？”中“故人”是指谁？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“长使英雄泪满襟”这首诗句出自杜甫的哪首诗？",
                "answer" => "蜀相"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“枝上柳绵吹又少”的下一句是什么？",
                "answer" => "天涯何处无芳草"
            ],
            [
                "category" => "文学",
                "question" => "为徐敬业讨伐武则天的义兵起草了《讨武氏檄》的诗人是",
                "answer" => "骆宾王"
            ],
            [
                "category" => "文学",
                "question" => "歇后语“周瑜打黄盖--一个愿打，一个愿挨”是从哪部作品中演绎出来的？",
                "answer" => "《三国演义》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“东边日出西边雨”的下句是什么？",
                "answer" => "道是无睛还有晴"
            ],
            [
                "category" => "文学",
                "question" => "《梦溪笔谈》是一本有关历史、文艺、科学等各种只是的古代名著，它的作者是？",
                "answer" => "沈括"
            ],
            [
                "category" => "文学",
                "question" => "春秋时期，创办私学，广收门徒而不问出身贵贱和家境贫富的著名思想家是？",
                "answer" => "孔子"
            ],
            [
                "category" => "文学",
                "question" => "“有教无类”是以下哪位提出的观点？",
                "answer" => "孔子"
            ],
            [
                "category" => "文学",
                "question" => "在中央电视台《百家讲坛》栏目中热播的《论语心得》，引起了人们对传统文化经典的关注。《论语》中所记载的言论出自我国古代思想家",
                "answer" => "孔子"
            ],
            [
                "category" => "文学",
                "question" => "湖北宜昌的一中、夷陵中学分别在美国、德国和越南等国开设了“孔子课堂”教授汉语，把在国外开设的教授汉语的课堂取名为“孔子课堂”是因为孔子",
                "answer" => "有卓越的教育思想与成就"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“三军可夺帅也，匹夫不可夺志也。”这句名言是谁说的？",
                "answer" => "孔子"
            ],
            [
                "category" => "文学",
                "question" => "魏晋之际出现“玄学”，其特点是用老庄思想解释儒家易经，把儒家和道家三部典籍奉为“三玄”，崇尚“清谈”。据此，请推断“三玄”不包括下列哪一项？",
                "answer" => "《论语》"
            ],
            [
                "category" => "文学",
                "question" => "李贺《梦天》诗云：“遥望齐州九点烟，一泓海水杯中泻。”这里“齐州”是指哪里？",
                "answer" => "代指中国"
            ],
            [
                "category" => "文学",
                "question" => "尧舜禹是古代倍受尊敬的三位帝王，其中有“三过家门而不入”这一典故的是哪一位？",
                "answer" => "大禹"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“竹杖芒鞋轻胜马”的后两个字是什么？出自哪部作品？",
                "answer" => "“谁怕”，出自苏轼的《定风波》"
            ],
            [
                "category" => "文学",
                "question" => "“破釜沉舟”这个典故说的是谁？",
                "answer" => "项羽"
            ],
            [
                "category" => "文学",
                "question" => "《项羽本纪》记述项羽“破釜沉舟”是发生在什么时候？",
                "answer" => "钜鹿之战"
            ],
            [
                "category" => "文学",
                "question" => "你在阅读中国古代四大名著的时候,基本不会看到对下面哪个人物的描述？",
                "answer" => "韩信"
            ],
            [
                "category" => "文学",
                "question" => "四大名著里有两位“行者”,他们分别是《西游记》中的孙悟空和《水浒传》中的谁？",
                "answer" => "武松"
            ],
            [
                "category" => "文学",
                "question" => "你翻遍中国古代四大名著，以下故事情节基本找不到的是哪一个？",
                "answer" => "退避三舍"
            ],
            [
                "category" => "文学",
                "question" => "四大名著里有两位“行者”,他们分别是《水浒传》中的武松和《西游记》中的谁？",
                "answer" => "孙悟空"
            ],
            [
                "category" => "文学",
                "question" => "四大名著中的《红楼梦》，最初的名字是什么？",
                "answer" => "石头记"
            ],
            [
                "category" => "文学",
                "question" => "三国中卧龙，凤雏指的是哪两位？",
                "answer" => "诸葛亮，庞统"
            ],
            [
                "category" => "文学",
                "question" => "武侠名著玉钗盟是谁的作品",
                "answer" => "卧龙生"
            ],
            [
                "category" => "文学",
                "question" => "三国演义中的“卧龙”是？",
                "answer" => "诸葛亮"
            ],
            [
                "category" => "文学",
                "question" => "古代著名的兵书《孙子兵法》的作者是？",
                "answer" => "孙武"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“今宵酒醒何处，杨柳岸，晓风残月”出自谁的作品？",
                "answer" => "柳永"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“寒蝉凄切，对长亭晚，骤雨初歇”这首词的作者是谁？",
                "answer" => "柳永，出自《雨霖铃》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“对潇潇暮雨洒江天，一番洗清秋、”的作者是谁？",
                "answer" => "柳永"
            ],
            [
                "category" => "文学",
                "question" => "《西厢记》脱胎于唐传奇故事",
                "answer" => "《会真记》"
            ],
            [
                "category" => "文学",
                "question" => "红娘是哪部作品中的人物",
                "answer" => "《西厢记》"
            ],
            [
                "category" => "文学",
                "question" => "《西厢记》中，张生与崔莺莺第一次相遇在？",
                "answer" => "普救寺"
            ],
            [
                "category" => "文学",
                "question" => "“碧云天，黄叶地，北雁南飞”语出哪一部著作？",
                "answer" => "《西厢记》"
            ],
            [
                "category" => "文学",
                "question" => "根据几个词语选出相关联的古代名著：四大名剧、崔莺莺、王实甫？",
                "answer" => "《西厢记》"
            ],
            [
                "category" => "文学",
                "question" => "在看白话小说的时候，如果有一个被描写为“手握三尺”的人，你认为他应该是什么身份？",
                "answer" => "侠客"
            ],
            [
                "category" => "文学",
                "question" => "被称为“书圣”的古代书法家是？",
                "answer" => "王羲之"
            ],
            [
                "category" => "文学",
                "question" => "被称为“天下第一行书”的是",
                "answer" => "王羲之的《兰亭序》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“落花时节又逢君”中的“君”指的是",
                "answer" => "李龟年"
            ],
            [
                "category" => "文学",
                "question" => "三国时期人物与字号的搭配不正确的是",
                "answer" => "张飞,字玄德"
            ],
            [
                "category" => "文学",
                "question" => "“长板桥头杀气生，一声好似轰雷震，独退曹家百万兵”赞颂是哪位英雄？",
                "answer" => "张飞"
            ],
            [
                "category" => "文学",
                "question" => "“先天下之优而优，后天下之乐而乐”出自范仲淹的哪篇作品？",
                "answer" => "岳阳楼记"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“举杯邀明月”的下句是？",
                "answer" => "对影成三人"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“君不见黄河之水天上来,奔流到海不复回”是出自诗仙李白的哪首诗？",
                "answer" => "将进酒"
            ],
            [
                "category" => "文学",
                "question" => "以下哪件事是《水浒传》中梁山好汉武松所为？",
                "answer" => "醉打蒋门神"
            ],
            [
                "category" => "文学",
                "question" => "下列哪部作品不是以谥号来命名的？",
                "answer" => "《聊斋志异》"
            ],
            [
                "category" => "文学",
                "question" => "根据几个词语选出相关联的古代名著:短篇小说集,民间传说,清代文学作品？",
                "answer" => "《聊斋志异》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“床前明月光,疑是地上霜”,我们平常所看到的“明月光”实际源自于？",
                "answer" => "太阳光"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“床前明月光”的“床”是什么意思？",
                "answer" => "井栏"
            ],
            [
                "category" => "文学",
                "question" => "三国演义中：小乔嫁周瑜，大乔嫁给了谁？",
                "answer" => "孙策"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“路漫漫其修远兮，吾将上下而求索”是楚国哪一位诗人的诗句？",
                "answer" => "屈原"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“人生得意须尽欢”的下一句是什么？",
                "answer" => "莫使金樽空对月"
            ],
            [
                "category" => "文学",
                "question" => "以通俗易懂见长，有“诗魔”之称的诗人是？",
                "answer" => "白居易"
            ],
            [
                "category" => "文学",
                "question" => "赵翼《论诗》“江山代有人才出”的下句是什么？",
                "answer" => "各领风骚数百年"
            ],
            [
                "category" => "文学",
                "question" => "我国第一部语录体著作是什么？",
                "answer" => "《论语》"
            ],
            [
                "category" => "文学",
                "question" => "楚辞中《九歌》和《离骚》的作者是谁？",
                "answer" => "屈原"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“饮甘品茗话茶事，抚今追忆昔陆翁”，古代文人多好品茶，而品茶最有名的当属唐代的“茶圣”，他的名字是",
                "answer" => "陆羽"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“旅馆寒灯独不眠，客心何事转凄然？故乡今夜思潜力，霜鬓明朝又一年。”听到这首诗的时候你应该会想做什么？",
                "answer" => "守岁"
            ],
            [
                "category" => "文学",
                "question" => "描绘北宋东京汴河沿岸繁华景象的《清明上河图》的作者是？",
                "answer" => "张择端"
            ],
            [
                "category" => "文学",
                "question" => "《清明上河图》是哪个朝代的作品？",
                "answer" => "北宋"
            ],
            [
                "category" => "文学",
                "question" => "宋朝张择端所绘《清明上河图》反映了当时哪一城市的繁华景象？",
                "answer" => "东京"
            ],
            [
                "category" => "文学",
                "question" => "我国北宋时期反映百姓生活的长篇画卷是什么画？",
                "answer" => "清明上河图"
            ],
            [
                "category" => "文学",
                "question" => "表示一句话中间的停顿要用什么标点符号？",
                "answer" => "逗号"
            ],
            [
                "category" => "文学",
                "question" => "王湾《次北固山下》“江春入旧年”的上句是？",
                "answer" => "海日生残夜"
            ],
            [
                "category" => "文学",
                "question" => "我国古代诗歌史上被称为“双璧”的一篇是《孔雀东南飞》，另一篇是什么？",
                "answer" => "《木兰诗》(《木兰辞》)"
            ],
            [
                "category" => "文学",
                "question" => "《道德经》的作者是？",
                "answer" => "老子"
            ],
            [
                "category" => "文学",
                "question" => "大话西游里至尊宝向紫霞仙子说了哪三个字？",
                "answer" => "我爱你"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“前度刘郎今又来”中的刘郎是指？",
                "answer" => "刘禹锡"
            ],
            [
                "category" => "文学",
                "question" => "诗句“每逢佳节倍思亲”中的“佳节”原意是指的哪个节日？",
                "answer" => "重阳节"
            ],
            [
                "category" => "文学",
                "question" => "“每逢佳节倍思亲”这首诗句出自王维的什么诗？",
                "answer" => "《九月九日忆山东兄弟》"
            ],
            [
                "category" => "文学",
                "question" => "“此时无声胜有声”一句出自何处？",
                "answer" => "《琵琶行》"
            ],
            [
                "category" => "文学",
                "question" => "《琵琶行》的作者是谁？",
                "answer" => "白居易"
            ],
            [
                "category" => "文学",
                "question" => "“娉娉袅袅()余，豆蔻梢头二月初”。括号中应填入什么？",
                "answer" => "十三"
            ],
            [
                "category" => "文学",
                "question" => "“遥遥万里辉,荡荡空中景”是哪个诗人说的？",
                "answer" => "陶渊明"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“大弦嘈嘈如急雨，小弦切切如私语”描述的是哪种乐器？",
                "answer" => "琵琶"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“大珠小珠落玉盘”所形容的是那种乐器的演奏？",
                "answer" => "琵琶"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“夕阳无限好”的下句是什么？",
                "answer" => "只是近黄昏"
            ],
            [
                "category" => "文学",
                "question" => "《三国演义》中的“三英战吕布”发生在哪里？",
                "answer" => "虎牢关"
            ],
            [
                "category" => "文学",
                "question" => "《三国演义》中的“凤雏”是？",
                "answer" => "庞统"
            ],
            [
                "category" => "文学",
                "question" => "《三国演义》里“木牛流马”是谁制造的？",
                "answer" => "诸葛亮"
            ],
            [
                "category" => "文学",
                "question" => "药酒是在哪个朝代之后出现的？",
                "answer" => "唐代"
            ],
            [
                "category" => "文学",
                "question" => "《三国演义》里“火烧连营”的敌对双方分别是？",
                "answer" => "陆逊和刘备"
            ],
            [
                "category" => "文学",
                "question" => "“红藕香残玉簟秋”出自南宋著名女词人李清照哪首佳作？",
                "answer" => "《一剪梅》"
            ],
            [
                "category" => "文学",
                "question" => "“花自飘零水自流，一种相思，两处闲愁。此情无计可消除，才下眉头。”出自南宋著名女词人李清照那首佳作？",
                "answer" => "《一剪梅》"
            ],
            [
                "category" => "文学",
                "question" => "“茶居”的“居”原意是什么？",
                "answer" => "隐"
            ],
            [
                "category" => "文学",
                "question" => "走马荐诸葛的人是谁？",
                "answer" => "徐庶"
            ],
            [
                "category" => "文学",
                "question" => "明代是短篇小说的兴盛时期，著名的短篇小说“三言、二拍”的作者分别是谁？",
                "answer" => "冯梦龙、凌蒙初"
            ],
            [
                "category" => "文学",
                "question" => "芈怎么读的？",
                "answer" => "mi"
            ],
            [
                "category" => "文学",
                "question" => "元曲四大家是哪四个？",
                "answer" => "马致远，白朴，郑光祖，关汉卿"
            ],
            [
                "category" => "文学",
                "question" => "元曲四大家除了关汉卿、白朴、马致远外还有谁？",
                "answer" => "郑光祖"
            ],
            [
                "category" => "文学",
                "question" => "“王侯将相，宁有种乎”这句话出自谁之口？",
                "answer" => "陈胜、吴广"
            ],
            [
                "category" => "文学",
                "question" => "“闲敲棋子落灯花”的作者是？",
                "answer" => "赵师秀"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“两个黄鹂鸣翠柳”的下句是？",
                "answer" => "一行白鹭上青天"
            ],
            [
                "category" => "文学",
                "question" => "清代文人王士祯作过一首有名的数字诗《题秋江独钓图》，诗中写道：“一蓑一笠一扁舟，一丈丝纶一寸钩;一曲高歌一樽酒，一人独钓一江秋。”请数一下此诗中共有几个“一”字？",
                "answer" => "9个"
            ],
            [
                "category" => "文学",
                "question" => "提出“心外无物、心外无理”之说的明朝思想家是？",
                "answer" => "王守仁"
            ],
            [
                "category" => "文学",
                "question" => "清代著名小说《儒林外史》的作者是？",
                "answer" => "吴敬梓"
            ],
            [
                "category" => "文学",
                "question" => "吴敬梓写了什么书？",
                "answer" => "儒林外史"
            ],
            [
                "category" => "文学",
                "question" => "“范进中举”的故事出自哪部小说？",
                "answer" => "《儒林外史》"
            ],
            [
                "category" => "文学",
                "question" => "中国古代历法名著《授时历》的作者是？",
                "answer" => "郭守敬"
            ],
            [
                "category" => "文学",
                "question" => "与《木兰诗》(《木兰辞》)并称乐府双璧的是？",
                "answer" => "《孔雀东南飞》"
            ],
            [
                "category" => "文学",
                "question" => "中国古代最长的一首叙事诗是什么？",
                "answer" => "《孔雀东南飞》"
            ],
            [
                "category" => "文学",
                "question" => "奇门遁甲“八门”中，哪一门不属于吉门？",
                "answer" => "死门"
            ],
            [
                "category" => "文学",
                "question" => "化蝶是出自何典故？",
                "answer" => "梁山伯与祝英台"
            ],
            [
                "category" => "文学",
                "question" => "“无事不登三宝殿”中的“三宝”是指哪个三宝？",
                "answer" => "佛、法、僧"
            ],
            [
                "category" => "文学",
                "question" => "山西洪桐县的明代监狱，因为谁的故事而著名",
                "answer" => "苏三"
            ],
            [
                "category" => "文学",
                "question" => "词语“芊芊”代表什么颜色？",
                "answer" => "翠绿色"
            ],
            [
                "category" => "文学",
                "question" => "古时“茶”字从什么字简化出来的？",
                "answer" => "荼"
            ],
            [
                "category" => "文学",
                "question" => "古人说的“三尺青峰”指的是？",
                "answer" => "剑"
            ],
            [
                "category" => "文学",
                "question" => "关于琴的古代故事“说琴谏国王”所说的是？",
                "answer" => "邹忌谏齐王"
            ],
            [
                "category" => "文学",
                "question" => "词语“同气”是指什么关系？",
                "answer" => "兄弟"
            ],
            [
                "category" => "文学",
                "question" => "“金屋藏娇”说的是哪一位皇帝？",
                "answer" => "汉武帝"
            ],
            [
                "category" => "文学",
                "question" => "“名不正则言不顺”是哪家的思想",
                "answer" => "儒家"
            ],
            [
                "category" => "文学",
                "question" => "古人称弱冠，是指多大年龄的人？",
                "answer" => "20"
            ],
            [
                "category" => "文学",
                "question" => "古人称花甲，是指多大年龄的人？",
                "answer" => "60"
            ],
            [
                "category" => "文学",
                "question" => "我国第一个伟大的浪漫主义爱国诗人是？",
                "answer" => "屈原"
            ],
            [
                "category" => "文学",
                "question" => "彗星在古代称为扫帚星(扫把星)，如果形容某人为“扫帚星”是指？",
                "answer" => "此人会代来不祥之事"
            ],
            [
                "category" => "文学",
                "question" => "从我国古代的神话传说来看，以下与月亮无关的是",
                "answer" => "夸父"
            ],
            [
                "category" => "文学",
                "question" => "“月上柳梢头，人约黄昏后。”写的是中国哪个传统节日？",
                "answer" => "元宵"
            ],
            [
                "category" => "文学",
                "question" => "清初四画僧中，“八大山人”指的是？",
                "answer" => "朱统銮，又名朱耷"
            ],
            [
                "category" => "文学",
                "question" => "传说中的“八大山人”有几个人？",
                "answer" => "1个"
            ],
            [
                "category" => "文学",
                "question" => "唐朝著名诗人被称作诗佛的是谁？",
                "answer" => "王维"
            ],
            [
                "category" => "文学",
                "question" => "“白头宫女在，闲坐说玄宗。”出自哪首诗？",
                "answer" => "王维的《相思》"
            ],
            [
                "category" => "文学",
                "question" => "生于盛唐时期，诗画双绝；被苏轼评价“诗中有画，画中有诗”；因崇信佛教被世人称为“诗佛”的是谁？",
                "answer" => "王维"
            ],
            [
                "category" => "文学",
                "question" => "“独在异乡为异客，每份佳节倍思亲。”出自王维的《九月九日忆山东兄弟》，诗中的“重阳”是指得是中国传统节日中的哪一个节日？",
                "answer" => "重阳节"
            ],
            [
                "category" => "文学",
                "question" => "道家著作《庄子》别称叫什么？",
                "answer" => "《南华经》"
            ],
            [
                "category" => "文学",
                "question" => "书画工艺中所称的“裱画”是指？",
                "answer" => "为书画配上衬纸卷轴以便张贴和收藏"
            ],
            [
                "category" => "文学",
                "question" => "“安能摧眉折腰事权贵，使我不得开心颜!”出自李白的？",
                "answer" => "《梦游天姥吟留》"
            ],
            [
                "category" => "文学",
                "question" => "“昔年有狂客，号尔谛仙人。笔落惊风雨，诗成泣鬼神”是纪念谁的诗词？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "“寻寻觅觅，冷冷清清，凄凄惨惨戚戚。”出自谁的作品？",
                "answer" => "出自李清照《声声慢》"
            ],
            [
                "category" => "文学",
                "question" => "李清照《如梦令》中“昨夜雨疏风骤”的下一句是",
                "answer" => "浓睡不消残酒"
            ],
            [
                "category" => "文学",
                "question" => "“莫道不销魂，帘卷西风，人比黄花瘦。”作品叫什么名字？",
                "answer" => "李清照的《醉花阴》"
            ],
            [
                "category" => "文学",
                "question" => "“莫道不销魂，帘卷西风，人比()瘦”括号内的文字是？",
                "answer" => "黄花"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“一骑红尘妃子笑”的下句是什么？",
                "answer" => "无人知是荔枝来"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“乱花渐欲迷人眼”的下句是什么？",
                "answer" => "浅草才能没马蹄"
            ],
            [
                "category" => "文学",
                "question" => "韩愈曾写过一篇有关教育的文章是？",
                "answer" => "《师说》"
            ],
            [
                "category" => "文学",
                "question" => "“欲剪湘中一尺天，吴娥莫道吴刀涩”盛赞什么？",
                "answer" => "葛布的精美"
            ],
            [
                "category" => "文学",
                "question" => "“飞鸟尽，良弓藏，狡兔死，走狗烹”是谁最先说的？",
                "answer" => "范蠡"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“蓬头稚子学垂纶”的下句是？",
                "answer" => "侧坐莓苔草映身"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“应怜屐齿印苍苔”的下句是？",
                "answer" => "小扣柴扉久不开"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“男儿何不带吴钩”的下句是？",
                "answer" => "收取关山五十州"
            ],
            [
                "category" => "文学",
                "question" => "“力拔南山三壮士，齐相杀之费二桃。”齐相是谁？",
                "answer" => "晏婴"
            ],
            [
                "category" => "文学",
                "question" => "中国现代杰出画家(艺术家)，世界文化名人齐白石在诗，书，印，画方面均有惊人造诣，齐白石最擅长画的是以下哪样东西？",
                "answer" => "虾"
            ],
            [
                "category" => "文学",
                "question" => "唐朝的“朝”字由多少笔画组成？",
                "answer" => "十二画"
            ],
            [
                "category" => "文学",
                "question" => "隋朝的“隋”字由多少笔画组成？",
                "answer" => "十一画"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“千里莺啼绿映红”的下句是？",
                "answer" => "水村山郭酒旗风"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“燕山雪花大如席”的下句是？",
                "answer" => "片片吹落轩辕台"
            ],
            [
                "category" => "文学",
                "question" => "香山居士是谁的别号？",
                "answer" => "白居易"
            ],
            [
                "category" => "文学",
                "question" => "唐朝诗人白居易，字乐天，号什么？",
                "answer" => "香山居士"
            ],
            [
                "category" => "文学",
                "question" => "以下作品中，哪幅画不属于徐悲鸿的作品？",
                "answer" => "荷花"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“智者乐水”的后一句是？",
                "answer" => "仁者乐山"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“人生自古谁无死，留取丹心照汗青”的作者是？",
                "answer" => "文天祥"
            ],
            [
                "category" => "文学",
                "question" => "《金铜仙人辞汉歌》中“衰兰送客咸阳道”的下句？",
                "answer" => "天若有情天亦老"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“一道残阳铺水中，半江瑟瑟半江红。”的作者和诗名是？",
                "answer" => "白居易《暮江吟》"
            ],
            [
                "category" => "文学",
                "question" => "《寻隐者不遇》“松下问童子，言师采药去，只在此山中，云深不知处。”的作者是？",
                "answer" => "贾岛"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“奇文共欣赏”的下句是？",
                "answer" => "疑义相与析"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“云想衣裳花想容，春风拂槛露华浓，若非群玉山头见，会向瑶台月下逢”这是李白为谁写的？",
                "answer" => "杨玉环"
            ],
            [
                "category" => "文学",
                "question" => "“推敲”一词是因为唐朝哪位诗人仔细得来的？",
                "answer" => "贾岛"
            ],
            [
                "category" => "文学",
                "question" => "《步辇图》的作者？",
                "answer" => "阎立本"
            ],
            [
                "category" => "文学",
                "question" => "阎立本为李世民接见和亲使者禄东赞所画的是什么？",
                "answer" => "步辇图"
            ],
            [
                "category" => "文学",
                "question" => "盆景艺术是中国历史悠久的一种园林艺术，盆景艺术五大流派包括苏派、扬派、海派、岭南派和什么？",
                "answer" => "川派"
            ],
            [
                "category" => "文学",
                "question" => "古代新春有贴年画的习俗，画中的鲤鱼代表哪种寓意？",
                "answer" => "连年有余"
            ],
            [
                "category" => "文学",
                "question" => "中国古时候有”三皇五帝“之说，著名史书《史记》里也有记载，请问《史记》中记载的三皇，除了天皇、帝皇以外还有一个叫什么？",
                "answer" => "人皇"
            ],
            [
                "category" => "文学",
                "question" => "中国历史上第一部纪传体通史？",
                "answer" => "《史记》"
            ],
            [
                "category" => "文学",
                "question" => "《史记》是一部什么样的通史？",
                "answer" => "纪传体通史"
            ],
            [
                "category" => "文学",
                "question" => "《史记》的作者是？",
                "answer" => "司马迁"
            ],
            [
                "category" => "文学",
                "question" => "被誉为“史学双壁”的两部史书是什么？",
                "answer" => "《史记》《资治通鉴》"
            ],
            [
                "category" => "文学",
                "question" => "下列书法家中，哪位是明代的？",
                "answer" => "董其昌"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“舞落繁枝千万片,犹自多情,学腐随风铃。”的作者是？",
                "answer" => "冯延已"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“可怜九月初三夜”的下句是?",
                "answer" => "露似真珠月似弓"
            ],
            [
                "category" => "文学",
                "question" => "苏轼《赤壁怀古》中的“遥想公瑾当年”一句所指人物是？",
                "answer" => "周瑜"
            ],
            [
                "category" => "文学",
                "question" => "苏轼《赤壁怀古》中“乱石穿空，惊涛拍岸”的下一句是？",
                "answer" => "卷起千堆雪"
            ],
            [
                "category" => "文学",
                "question" => "秦琼字什么？",
                "answer" => "叔宝"
            ],
            [
                "category" => "文学",
                "question" => "唐代书法流派柳体的创始人是谁？",
                "answer" => "柳公权"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“噫吁唏，危乎高哉!蜀道之难难于上青天”是谁的名句？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“问君西游何时还”是出于李白的那一首诗？",
                "answer" => "《蜀道难》"
            ],
            [
                "category" => "文学",
                "question" => "唐朝两位最著名的诗人中，被称为诗仙的是？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "被誉为唐宋八大家之首的是那位文人？",
                "answer" => "韩愈"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“洛阳亲友如相问”的下句是？",
                "answer" => "一片冰心在玉壶"
            ],
            [
                "category" => "文学",
                "question" => "“长风破浪会有时，直挂云帆济沧海”出自李白的哪首诗？",
                "answer" => "《行路难？"
            ],
            [
                "category" => "文学",
                "question" => "《长恨歌》中“后宫佳丽三千人”的下句是？",
                "answer" => "三千宠爱在一身"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“靖康耻，犹未雪;臣子恨，何时灭。驾长车踏破，贺兰山缺”。这首词的词牌名是什么？",
                "answer" => "《满江红》"
            ],
            [
                "category" => "文学",
                "question" => "岳飞《满江红》中“三十功名尘与土，八千里路云和月”下一句是？",
                "answer" => "莫等闲，白了少年头，空悲切"
            ],
            [
                "category" => "文学",
                "question" => "被称为“七绝圣手”的唐代诗人是谁？",
                "answer" => "王昌龄"
            ],
            [
                "category" => "文学",
                "question" => "著名的《女史箴图》是哪位画家的作品？",
                "answer" => "顾恺之"
            ],
            [
                "category" => "文学",
                "question" => "古代名画《洛神赋图》的作者是？",
                "answer" => "顾恺之"
            ],
            [
                "category" => "文学",
                "question" => "唐代大书法家，以草书而闻名，被誉为“草圣”的书法家是谁？",
                "answer" => "张旭"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“忽见陌头杨柳色”的下句是？",
                "answer" => "悔教夫婿觅封侯"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“白日放歌须纵酒”的下句是？",
                "answer" => "青春作伴好还乡"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“冲天香阵透长安？满城尽带黄金甲。”是从谁的诗作中诗作中摘录的？",
                "answer" => "黄巢《不第后赋菊》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“林中失偶子来伴，怕若无心何来惧”打一诗人名？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "《千金方》的作者，被称为医圣的是？",
                "answer" => "孙思邈"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“何以解忧，惟有杜康”的作者是",
                "answer" => "曹操"
            ],
            [
                "category" => "文学",
                "question" => "诗歌《咏鹅》的作者是谁？",
                "answer" => "骆宾王"
            ],
            [
                "category" => "文学",
                "question" => "古代书画按风格来讲，工笔绘画注重？",
                "answer" => "细致写实"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“红稣手，黄藤酒，满城春色宫墙柳。”描写的是谁的爱情故事？",
                "answer" => "陆游"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“人生若只如初见”的下句是？",
                "answer" => "何事秋风悲画扇"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“今日听君歌一曲”的下句是？",
                "answer" => "暂凭杯酒长精神"
            ],
            [
                "category" => "文学",
                "question" => "和张旭齐名，称“素狂”的是谁？",
                "answer" => "怀素"
            ],
            [
                "category" => "文学",
                "question" => "唐宋八大家之一的柳宗元曾经写过一篇以捕蛇人遭遇揭露赋税的苛酷的文章的是？",
                "answer" => "《捕蛇者说》"
            ],
            [
                "category" => "文学",
                "question" => "《小窗幽记》的作者是谁",
                "answer" => "明代陈继儒"
            ],
            [
                "category" => "文学",
                "question" => "唐朝的“唐”字由多少笔画组成？",
                "answer" => "十画"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“明月出天山，苍茫云海间。”的下句是？",
                "answer" => "长风几万里，吹度玉门关。"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“黄鹤一去不复返”的下句是？",
                "answer" => "白云千载空悠悠"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“大漠孤烟直”的下句是？",
                "answer" => "长河落日圆"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“凭君莫话封侯事”的下句是？",
                "answer" => "一将功成万骨枯"
            ],
            [
                "category" => "文学",
                "question" => "“墨”的绝对下联是什么？",
                "answer" => "泉"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“忽闻海上有仙山”的下句是什么？",
                "answer" => "山在虚无缥缈间"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“清瑟怨遥夜”的下一句是什么？",
                "answer" => "绕弦风雨哀"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“千山鸟飞绝”的下句是什么？",
                "answer" => "万径人踪灭"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“春风得意马蹄疾”的下句是？",
                "answer" => "一日看尽长安花"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“长恨春寻无觅处”的下句是？",
                "answer" => "不知转入此中来"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“枯藤老树昏鸦，小桥流水人家”出自宋词《天净沙·秋思》它的作者是？",
                "answer" => "马致远"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“小时不识月，呼作白玉盘。”出自哪位诗人之笔？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "古代所称的“杏林高手”是指什么？",
                "answer" => "医术高明之人"
            ],
            [
                "category" => "文学",
                "question" => "马踏飞燕又称为马超龙雀，是什么朝代青铜艺术的杰出代表？",
                "answer" => "东汉"
            ],
            [
                "category" => "文学",
                "question" => "中国十位名画家各有其长，擅长画虎的是？",
                "answer" => "张大千"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“十年生死两茫茫。不思量，自难忘。千古孤坟，无处话凄凉。”出自苏轼的哪首词？",
                "answer" => "江城子"
            ],
            [
                "category" => "文学",
                "question" => "黄庭坚的“欲问江南近消息，喜君贻我一枝春”中的“一枝春”指的是？",
                "answer" => "梅花"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“几处早莺争暖树，谁家新燕啄春泥。” 出自哪首诗？",
                "answer" => "白居易《钱塘湖春行》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“几处早莺争暖树”的下句是？",
                "answer" => "谁家新燕啄春泥"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“蜡烛有心还惜别，替人垂泪到天明。”的作者是？",
                "answer" => "杜牧《赠别二首（其二）》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“去年花里逢君别”的下句？",
                "answer" => "今日花开又一年"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“去年花里逢君别”的下句？",
                "answer" => "今日花开又一年"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“此地一为别”的下句是？",
                "answer" => "孤蓬万里征"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“举杯遨明月”的下句是？",
                "answer" => "对影成三人"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“明月几时有？把酒问青天”出自苏轼的哪首诗？",
                "answer" => "《水调歌头》"
            ],
            [
                "category" => "文学",
                "question" => "“以史为鉴，可以知兴替，以人为鉴，可以明得失、”这是唐太宗对谁的评价(被李世明的比喻为镜子的忠臣是谁)？",
                "answer" => "魏征"
            ],
            [
                "category" => "文学",
                "question" => "我国古代戏曲有很多描写悲剧的曲目，其中有血渐白绫、六月降雪、大旱三年等情节描写的是那个曲目？",
                "answer" => "《窦娥冤》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“此情可待成追忆”的下句是？",
                "answer" => "只是当时已惘然"
            ],
            [
                "category" => "文学",
                "question" => "李白《山中答问》诗中“桃花流水苜然去”的下句是？",
                "answer" => "别有天地非人间"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“仰天大笑出门去”的下句是？",
                "answer" => "我辈岂是蓬蒿人"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“马上相逢无纸笔”的下句是？",
                "answer" => "凭君传语报平安"
            ],
            [
                "category" => "文学",
                "question" => "曼殊作品《浣溪沙》中“无可奈何花落去”的下句是什么？",
                "answer" => "似曾相识燕归来"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“无可奈何花落去，似曾相识燕归”来是婉约派谁的诗句？",
                "answer" => "曼殊"
            ],
            [
                "category" => "文学",
                "question" => "下列哪位不是属于初唐四杰？",
                "answer" => "岑参"
            ],
            [
                "category" => "文学",
                "question" => "初唐四杰指的是哪四个人？",
                "answer" => "杨炯、王勃、卢照邻、骆宾王"
            ],
            [
                "category" => "文学",
                "question" => "《韩熙载夜宴图》的作者是谁？",
                "answer" => "顾闳中"
            ],
            [
                "category" => "文学",
                "question" => "《写生珍禽图》是哪位帝王亲笔画？",
                "answer" => "宋徽宗赵佶"
            ],
            [
                "category" => "文学",
                "question" => "宋徽宗赵佶是位艺术才能颇高皇帝，他在世期间自创了一种书法字体，这种字体即有鹤体的雅称，楷书的一种，请问这种书法字体被称为什么？",
                "answer" => "瘦金体"
            ],
            [
                "category" => "文学",
                "question" => "被称为“文房四宝”的是哪四宝？",
                "answer" => "笔墨纸砚"
            ],
            [
                "category" => "文学",
                "question" => "下面哪句不是描写梅花的？",
                "answer" => "从陶令平覃后，千古高风说到今。"
            ],
            [
                "category" => "文学",
                "question" => "《诗经》中写弃妇的诗是？",
                "answer" => "《氓》"
            ],
            [
                "category" => "文学",
                "question" => "关于对联格式以下错误的是？",
                "answer" => "必有横批"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“采菊东篱下”的下句是？",
                "answer" => "悠然见南山"
            ],
            [
                "category" => "文学",
                "question" => "喜好饮酒自称“酒中仙”的著名诗人是？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“蒹葭苍苍，白露为霜”的下句是？",
                "answer" => "所谓伊人，在水一方。"
            ],
            [
                "category" => "文学",
                "question" => "世界上已知最早的雕版印刷书籍是唐朝时期的哪部名著？",
                "answer" => "《金刚经》"
            ],
            [
                "category" => "文学",
                "question" => "《明堂人形图》的作者是？",
                "answer" => "甄权"
            ],
            [
                "category" => "文学",
                "question" => "以画竹子著称的书画家郑板桥是哪个朝代的人？",
                "answer" => "清朝"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“正是江南好风景”下句是？",
                "answer" => "落花时节又逢君"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“云横秦岭家何在”的下句是",
                "answer" => "雪拥蓝关马不前"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“一骑红尘妃子笑,无人知是荔枝来”中的妃子是指谁？",
                "answer" => "杨贵妃"
            ],
            [
                "category" => "文学",
                "question" => "唐代书法流派颜体的创始人是谁？",
                "answer" => "颜真卿"
            ],
            [
                "category" => "文学",
                "question" => "唐代著名数学家、天文学家李淳风有一部预言后世的名书叫什么？",
                "answer" => "《推背图》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“天长地久有是尽，此恨绵绵无绝期。”出自哪首诗？",
                "answer" => "《长恨歌》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“危楼高百尺，手可摘星辰”是哪个诗人的作品？",
                "answer" => "李白《夜宿山寺》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“黄河远上白云间”的下句是什么？",
                "answer" => "一片孤城万仞山"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“天长地久有是尽”的下一句是什么？",
                "answer" => "此恨绵绵无绝期"
            ],
            [
                "category" => "文学",
                "question" => "明四家的画家是指哪几位？",
                "answer" => "沈周、文征明、唐寅和仇英"
            ],
            [
                "category" => "文学",
                "question" => "《陋室铭》的作者是谁？",
                "answer" => "刘禹锡"
            ],
            [
                "category" => "文学",
                "question" => "“谈笑有鸿儒，往来无白丁”出自唐朝诗人刘禹锡的《陋室铭》，这句话里的“白丁”指的是?",
                "answer" => "不懂学问的人"
            ],
            [
                "category" => "文学",
                "question" => "唐诗的近体诗分为两部分，律诗和什么？",
                "answer" => "绝句"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“火云犹未敛奇峰，欹枕初惊一叶风。”描写的是哪个季节？",
                "answer" => "秋天"
            ],
            [
                "category" => "文学",
                "question" => "古人称“不惑”是指多大的年龄的人？",
                "answer" => "40"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“紫泉宫殿锁烟霞,欲取芜城作帝家”中的紫泉指什么？",
                "answer" => "长安"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“忽如一夜春风来，千树万树梨花开”出自哪位诗人？",
                "answer" => "岑参"
            ],
            [
                "category" => "文学",
                "question" => "《西游记》是讲述唐僧师徒西天取经的故事，而文中的西天是指天竺这个地方，请问天竺是中国古代对那个国家的称呼？",
                "answer" => "印度"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“千里莺啼绿映红 水郭山村酒旗风”出自那个诗",
                "answer" => "杜牧《江南春》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“东风无力百花残”的上一句是什么？",
                "answer" => "相见时难别亦难"
            ],
            [
                "category" => "文学",
                "question" => "唐代最出名的文学是什么？",
                "answer" => "唐诗"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“书中自有颜如玉”是谁说的？",
                "answer" => "宋真宗"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“商女不知亡国恨”这句诗的作者是谁？",
                "answer" => "杜牧"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“客舍青青柳色新”的上一句是什么？",
                "answer" => "渭城朝雨邑轻尘"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“折戟沉沙铁未销”的下一句是什么？",
                "answer" => "自将磨洗认前朝"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“天不老，情难绝，心似双丝网，中有千千结。”的作者是谁？",
                "answer" => "张先"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“秋水共长天一色,落霞与孤鹜齐飞”出自王勃的哪篇名作？",
                "answer" => "《滕王阁序》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“雄州雾列，俊采星驰”，出自王勃的哪篇名作？",
                "answer" => "《滕王阁序》"
            ],
            [
                "category" => "文学",
                "question" => "《西游记》中去西天取经的“唐三藏”的真名是？",
                "answer" => "陈玄奘"
            ],
            [
                "category" => "文学",
                "question" => "吴承恩的《射阳先生存稿》一共有多少卷？",
                "answer" => "4卷"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“采莲南塘秋，莲花过人头、低头弄莲子，莲子清如水。”这首诗的叫什么？",
                "answer" => "《西洲曲》"
            ],
            [
                "category" => "文学",
                "question" => "《西游记》属于古代小说中的什么主义流派？",
                "answer" => "浪漫主义"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“白日依山尽，黄河入海流。欲穷千里目，更上一层楼。”按字数和句数可分为？",
                "answer" => "五言绝句"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“曾逐东风拂舞筵，乐游春苑断肠天。如何肯到清秋日，已带斜阳又带蝉。”描写的是什么植物？",
                "answer" => "柳树"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“随风潜入夜，润物细无声。”描写的是什么天气？",
                "answer" => "小雨"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“一去二三里，烟村四五家。亭台六七座，八九十枝花。”属于哪种诗？",
                "answer" => "数字诗"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“大弦嘈嘈如急雨”的下一句是什么？",
                "answer" => "小弦切切如私语"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“沧海月明珠有泪”的下一句是什么？",
                "answer" => "蓝田日暖玉生烟"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“伫灵匹于星期，眷神姿于月夕”描写的是哪个节日？",
                "answer" => "七夕"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“白云深处有人家”的上一句是什么？",
                "answer" => "远上寒山石径斜"
            ],
            [
                "category" => "文学",
                "question" => "变脸是哪个剧种的绝活？",
                "answer" => "川剧"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“九曲黄河万里沙”的下一句是什么？",
                "answer" => "浪淘风簸自天涯"
            ],
            [
                "category" => "文学",
                "question" => "《二十四诗品》是探讨诗歌创作，特别是诗歌美学风格问题的理论著作，它是由唐代何人所作？",
                "answer" => "司空图"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“会当凌绝顶，一览众山小”出自杜甫的《望岳》，这句诗所描写的是那里的风景(哪座名山)？",
                "answer" => "泰山"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“鞠躬尽瘁，死而后已”这句话是谁说的？",
                "answer" => "诸葛亮"
            ],
            [
                "category" => "文学",
                "question" => "诗歌在唐代发展到了一个高峰，唐朝诗人李白被尊为？",
                "answer" => "诗仙"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“日照香庐升紫烟”诗句中哪座山？",
                "answer" => "庐山"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“春蚕到死丝方尽，蜡炬成灰泪始干”常被用来歌颂什么职业的人？",
                "answer" => "教师"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“碧玉妆成一树高”的下一句是什么？",
                "answer" => "万条垂下绿丝绦"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“乱花渐欲迷人眼,浅草才能没马蹄”出自白居易的《钱塘湖春行》，这里的钱塘湖指的是什么？",
                "answer" => "杭州西湖"
            ],
            [
                "category" => "文学",
                "question" => "《水浒传》中被称为黑旋风的人物是？",
                "answer" => "李逵"
            ],
            [
                "category" => "文学",
                "question" => "《水浒传》好汉宋江、林冲所受的在额颊上刺字涂墨的刑罚是什么？",
                "answer" => "黥刑"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“青山遮不住，毕竟东流去。”的词牌名是什么？",
                "answer" => "《菩萨蛮》"
            ],
            [
                "category" => "文学",
                "question" => "古人称知天命，是指多大的年龄的人？",
                "answer" => "50"
            ],
            [
                "category" => "文学",
                "question" => "著名童话故事《白雪公主》的作者是",
                "answer" => "格林兄弟"
            ],
            [
                "category" => "文学",
                "question" => "古诗名言“朝辞白帝彩云间”的下一句是什么？",
                "answer" => "千里江陵一日还"
            ],
            [
                "category" => "文学",
                "question" => "按字数唐诗被分为五言和什么？",
                "answer" => "七言"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“大珠小珠落玉盘”的下一句是什么？",
                "answer" => "间关莺语花底滑"
            ],
            [
                "category" => "文学",
                "question" => "镇元大仙的诨号是？",
                "answer" => "与世同君"
            ],
            [
                "category" => "文学",
                "question" => "抱关击拆是指？",
                "answer" => "职位低下"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“夕阳无限好只是近黄昏”的作者？",
                "answer" => "李商隐"
            ],
            [
                "category" => "文学",
                "question" => "初唐四大家之首是谁？",
                "answer" => "欧阳询"
            ],
            [
                "category" => "文学",
                "question" => "初唐四大家是指哪四个？",
                "answer" => "欧阳询、虞世南、褚遂良、薛稷"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“雪径偷开碧浅花，冰根乱吐小红芽。生无桃李春风面，名在山林处士家。”形容的花是？",
                "answer" => "兰花"
            ],
            [
                "category" => "文学",
                "question" => "《三毛流浪记》的作者？",
                "answer" => "张乐平"
            ],
            [
                "category" => "文学",
                "question" => "李商隐有诗：“兔寒蟾冷桂花白，此夜嫦娥应断肠。”请问这首古诗中描述的是汇总过的那个传统节日？",
                "answer" => "中秋节"
            ],
            [
                "category" => "文学",
                "question" => "民间有“劝君莫打三春鸟”的说法，其中的道理是什么？",
                "answer" => "春天是鸟类的繁殖季节"
            ],
            [
                "category" => "文学",
                "question" => "以下哪本诗集是郭沫若的作品？",
                "answer" => "《女神》"
            ],
            [
                "category" => "文学",
                "question" => "把相爱的男女形容成一对翩翩起舞的彩蝶，应该源自以下哪个民间故事？",
                "answer" => "《梁山伯与祝英台》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名言“同是天涯沦落人”这首诗句出自白居易所作的哪首诗？",
                "answer" => "《琵琶行》"
            ],
            [
                "category" => "文学",
                "question" => "京剧中四指(4指)全扣向掌心，唯独伸直大拇指的指法叫什么？",
                "answer" => "英雄指"
            ],
            [
                "category" => "文学",
                "question" => "《诗经》在内容上可以分为哪几个部分？",
                "answer" => "风雅颂"
            ],
            [
                "category" => "文学",
                "question" => "《骆驼祥子》的作者是谁？",
                "answer" => "老舍"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“锄禾日当午，汗滴流下土。谁知盘中餐，粒粒艰辛苦。”这首唐诗读来朗朗上口，是妇孺皆知的佳句，然而，此诗究竟出自恨人之手呢？",
                "answer" => "李绅"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“阆苑风云气，才名锦绣城。诗书翰墨最堪精，宦海艺坛驰聘见双赢。”里面的锦绣城是我国现代那座城市？",
                "answer" => "成都"
            ],
            [
                "category" => "文学",
                "question" => "胡逸之跟随陈圆圆二十三年之中，跟她说过几句话",
                "answer" => "39句"
            ],
            [
                "category" => "文学",
                "question" => "善长画虎的画家是谁？",
                "answer" => "张善子"
            ],
            [
                "category" => "文学",
                "question" => "下面哪一个是三十六计是指？",
                "answer" => "瞒天过海、围魏救赵、借刀杀人、以逸待劳、趁火打劫、声东击西、无中生有、暗渡陈仓、隔岸观火、笑里藏刀、李代桃僵、顺手牵羊、打草惊蛇、借尸还魂、调虎离山、欲擒故纵、抛砖引玉、擒贼擒王、釜底抽薪、混水摸鱼、金蝉脱壳、关门捉贼、远交近攻、假途伐虢、偷梁换柱、指桑骂槐、假痴不颠、上屋抽梯、树上开花、反客为主、美人计、空城计、反间计、苦肉计、连环计、走为上"
            ],
            [
                "category" => "文学",
                "question" => "下面哪一个不是三十六计中的计策？",
                "answer" => "僭越计,计中计,顺水推舟,指鹿为马,反攻计,势如破竹"
            ],
            [
                "category" => "文学",
                "question" => "三十六计中“走为上策”是第几计？",
                "answer" => "第36计"
            ],
            [
                "category" => "文学",
                "question" => "下面哪一个是三十六计中的计策？",
                "answer" => "混水摸鱼,调虎离山"
            ],
            [
                "category" => "文学",
                "question" => "古诗名言“吾日三省呼吾身”说的“三省”的内容不包括下面那一项呢？",
                "answer" => "有朋自远方来，不亦乐乎？"
            ],
            [
                "category" => "文学",
                "question" => "古诗名言“吾日三省呼吾身”说的“三省”的内容为？",
                "answer" => "1.为人谋而不忠乎？2.与朋友交而不信乎？3.传不习乎？"
            ],
            [
                "category" => "文学",
                "question" => "全唐诗共收录了多少首诗？",
                "answer" => "42863首"
            ],
            [
                "category" => "文学",
                "question" => "“观夫海洋，洪涛接天，巨浪如山，而我之云帆高张，昼夜星驰，涉彼狂澜，若履通衢。”这段话中的“我之云帆高张”是指什么？",
                "answer" => "郑和下西洋"
            ],
            [
                "category" => "文学",
                "question" => "“寸草春晖”是比喻父母恩情难以报，它出自唐朝哪位诗人的诗句？",
                "answer" => "孟郊"
            ],
            [
                "category" => "文学",
                "question" => "“人是万物的尺度”这句话是谁说的？",
                "answer" => "普罗泰戈拉"
            ],
            [
                "category" => "文学",
                "question" => "文艺复兴时期的《忏悔录》是谁写的？",
                "answer" => "卢梭"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“清明时节雨纷纷，路上行人欲断魂”是谁写的诗句？",
                "answer" => "杜牧"
            ],
            [
                "category" => "文学",
                "question" => "过年了，每家每户都有贴村春联的习惯，其实贴春联起源于我国周代。“新年纳余庆，嘉年号长春”是我国第一幅春联，它的作者是谁？",
                "answer" => "孟昶"
            ],
            [
                "category" => "文学",
                "question" => "钱币开元通宝中“开元”的意思是什么",
                "answer" => "开辟新纪元"
            ],
            [
                "category" => "文学",
                "question" => "《毛泽东选集》出版时间？",
                "answer" => "建国初期"
            ],
            [
                "category" => "文学",
                "question" => "在影视作品中，林黛玉这一人物形象的原型出自？",
                "answer" => "《红楼梦》"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“还君明珠双泪垂”的下一句是什么？",
                "answer" => "恨不相逢未嫁时"
            ],
            [
                "category" => "文学",
                "question" => "李白曾有诗：“翩翩舞广袖，似鸟海东来。”诗中的海东指的是海东青，早在唐代，“海东青”就是用来朝奉朝庭的名贵贡品。那你知道”海东青“指的是什么吗？",
                "answer" => "猎鹰"
            ],
            [
                "category" => "文学",
                "question" => "有“二十万行长诗”之称的世界最长诗指的是？",
                "answer" => "摩诃婆罗多"
            ],
            [
                "category" => "文学",
                "question" => "《大堰河--我的保姆》的作者是？",
                "answer" => "艾青"
            ],
            [
                "category" => "文学",
                "question" => "子曰：“学而时习之，不亦悦乎？有朋自远方来，不亦悦乎？人不知而不愠，不亦君子乎？”这句话出自哪部名著？",
                "answer" => "《论语》"
            ],
            [
                "category" => "文学",
                "question" => "古人用“卅”字所表示的数值是？",
                "answer" => "30"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“山外青山楼外楼”在原诗《题临安邦》中的下句是？",
                "answer" => "西湖歌舞几时休"
            ],
            [
                "category" => "文学",
                "question" => "古人讲究礼节，说到对方母亲时尊称为？",
                "answer" => "令堂"
            ],
            [
                "category" => "文学",
                "question" => "令堂是古代对对方家属中哪一位的尊称？",
                "answer" => "母亲"
            ],
            [
                "category" => "文学",
                "question" => "著名小说家金庸写过不少脍炙人口的小说，而他将自己最喜欢的十四部小说去了一个字，组成两句诗，分别为“飞雪连天射白鹿，笑书神侠倚碧鸳”，请问其中的“飞”是指哪一部小说？",
                "answer" => "《飞狐外传》"
            ],
            [
                "category" => "文学",
                "question" => "《鸿门宴》“距关毋内诸侯”一句中，通假字解释不正确的是？",
                "answer" => "毋通勿"
            ],
            [
                "category" => "文学",
                "question" => "李清照，南宋女词人，齐州章丘人，请问她的号是什么？",
                "answer" => "易安居士"
            ],
            [
                "category" => "文学",
                "question" => "“勿以恶小而为之，勿以善小而不为”是谁对自己儿子的叮咛？",
                "answer" => "刘备"
            ],
            [
                "category" => "文学",
                "question" => "宋代词人陆游、辛弃疾是属于哪一个流派？",
                "answer" => "豪放派"
            ],
            [
                "category" => "文学",
                "question" => "胡同现今指小街小巷、这个词来自于蒙古语，它原本是指什么？",
                "answer" => "水井"
            ],
            [
                "category" => "文学",
                "question" => "被称为“天下第一关”的名关是？",
                "answer" => "山海关"
            ],
            [
                "category" => "文学",
                "question" => "京剧中拇指扣无名指、其余三指伸开的指法叫什么？",
                "answer" => "怒指"
            ],
            [
                "category" => "文学",
                "question" => "在《诗经》的主要表现手法中，“兴”是指什么意思",
                "answer" => "联想"
            ],
            [
                "category" => "文学",
                "question" => "古代文人所称的怀袖雅物是？",
                "answer" => "扇"
            ],
            [
                "category" => "文学",
                "question" => "《灵与肉》的作者是?",
                "answer" => "张贤亮"
            ],
            [
                "category" => "文学",
                "question" => "“露马脚”的意思是显出破绽、暴露真相。这个词语的典故和以下哪个古人有关？",
                "answer" => "朱元璋夫人马皇后"
            ],
            [
                "category" => "文学",
                "question" => "古人称“古稀”是指多大的年龄的人？",
                "answer" => "70"
            ],
            [
                "category" => "文学",
                "question" => "民间对特定的岁数有各种有趣的俗称，比如把70岁叫“古稀”，100叫做“期颐之年”，那么99岁叫什么呢？",
                "answer" => "白寿"
            ],
            [
                "category" => "文学",
                "question" => "文学家秦观在其代表作《鹊桥仙》中，以高度凝练的名言佳句，借用了哪个民间故事来歌颂坚贞诚挚的爱情？",
                "answer" => "牛郎织女"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“离离原上草，一岁一枯荣”是哪一首诗的内容？",
                "answer" => "《赋得古原草送别》"
            ],
            [
                "category" => "文学",
                "question" => "歌剧《茶花女》的作者是谁？",
                "answer" => "威尔第"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“十步杀一人，千里不留行”这首脍炙人口的《侠客行》出自哪位诗人",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "下列属于法国印象主义画家梵高的名作之一？",
                "answer" => "《向日葵》"
            ],
            [
                "category" => "文学",
                "question" => "《四世同堂》主题区《重整河山待后生》属于哪一种曲艺形式？",
                "answer" => "鼓词"
            ],
            [
                "category" => "文学",
                "question" => "中国历史上第一部神话小说？",
                "answer" => "《搜神记》"
            ],
            [
                "category" => "文学",
                "question" => "中秋佳节，人们通常都会一边品尝美食一边赏月。传说在月亮上有一位常年砍伐的樵夫，你知道他叫什么名字吗？",
                "answer" => "吴刚"
            ],
            [
                "category" => "文学",
                "question" => "古人称弱冠是多大年龄的人？",
                "answer" => "20"
            ],
            [
                "category" => "文学",
                "question" => "“春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少？”这首古诗描写的是哪个季节？",
                "answer" => "春"
            ],
            [
                "category" => "文学",
                "question" => "古语“朵颐”中的颐是指哪个部位？",
                "answer" => "面颊"
            ],
            [
                "category" => "文学",
                "question" => "歌剧《卡门》是哪位作曲家的作品？",
                "answer" => "比才"
            ],
            [
                "category" => "文学",
                "question" => "我国第一部历史批评著作是什么？",
                "answer" => "《史通》"
            ],
            [
                "category" => "文学",
                "question" => "在下列作品中，哪一部小说塑造了俄国文学史上第一个多余人的形象？",
                "answer" => "叶普盖尼·奥涅金"
            ],
            [
                "category" => "文学",
                "question" => "“肉食者鄙，未能远谋”摘自《左传》“曹刿论战”一文，这句话里的“肉食者”是什么意思？",
                "answer" => "有权势有地位的人"
            ],
            [
                "category" => "文学",
                "question" => "我国第一部建筑学专著是？",
                "answer" => "《营造法式》"
            ],
            [
                "category" => "文学",
                "question" => "“晓看红湿处，花重锦官城”中所指的“锦官城”是之现代的那座城市？",
                "answer" => "成都"
            ],
            [
                "category" => "文学",
                "question" => "《孟子》、《论语》、《大学》、《中庸》统称？",
                "answer" => "四书"
            ],
            [
                "category" => "文学",
                "question" => "“不识庐山真面目，只缘身在此山中。”这千古名句出自哪位文人之手？",
                "answer" => "苏轼"
            ],
            [
                "category" => "文学",
                "question" => "乐府双壁指的是？",
                "answer" => "汉乐府诗《孔雀东南飞》和北朝民歌《木兰诗》(《木兰辞》)"
            ],
            [
                "category" => "文学",
                "question" => "“知识就是力量”出自于英国哪一位著名哲学家？",
                "answer" => "培根"
            ],
            [
                "category" => "文学",
                "question" => "唐代文学家韩愈诗中的“祝融万丈拔地起，欲见不见轻烟里。”是指？",
                "answer" => "衡山"
            ],
            [
                "category" => "文学",
                "question" => "古代人所说的寒舍是指？",
                "answer" => "自己的住房"
            ],
            [
                "category" => "文学",
                "question" => "中国古代哪个学派的主张，与绿色和平组织的思想相近？",
                "answer" => "道家"
            ],
            [
                "category" => "文学",
                "question" => "我国第一部韵书是什么？",
                "answer" => "《切韵》"
            ],
            [
                "category" => "文学",
                "question" => "作品想象奇特，用词瑰丽，有浪漫主义色彩，风格独特，被称为“诗鬼”的是谁？",
                "answer" => "李贺"
            ],
            [
                "category" => "文学",
                "question" => "中国传统吉祥图案，用桂花和兰草合成吉祥图画，特指对家中子弟个个成才的祝愿，图称《兰桂齐芳》。那你知道其中的兰桂喻指的是什么吗？",
                "answer" => "子孙"
            ],
            [
                "category" => "文学",
                "question" => "世界名画《和平鸽》的创作者是以下哪位？",
                "answer" => "毕加索"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“千里送鹅毛”下一句是？",
                "answer" => "礼轻情意重"
            ],
            [
                "category" => "文学",
                "question" => "《西游记》中，有一种能延年益寿的食物，它若掉到地上就会钻进土里面消失不见这种东西的名字叫什么？",
                "answer" => "人参果"
            ],
            [
                "category" => "文学",
                "question" => "我国现存最早的兵书是哪部？",
                "answer" => "《孙子》又称《孙子兵法》"
            ],
            [
                "category" => "文学",
                "question" => "“神武”的“武”字一共由多少笔画组成？",
                "answer" => "8"
            ],
            [
                "category" => "文学",
                "question" => "欧阳修有诗：“去年元宵时，花市灯如昼。”，请问这首古诗描述的是中国的那个传统节日？",
                "answer" => "元宵节"
            ],
            [
                "category" => "文学",
                "question" => "“纸灰飞作白蝴蝶，血泪染成红杜鹃。”请问这首古诗描述的是中国的哪个传统节日？",
                "answer" => "清明节"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“惟见长江天际流”出自李白的那首诗句？",
                "answer" => "《黄鹤楼送孟浩然之广陵》"
            ],
            [
                "category" => "文学",
                "question" => "俗话说：“有心栽花花不发，无心插柳柳成荫。”在古代插柳还是一个节日的习俗，请问这个节日是什么节？",
                "answer" => "清明节"
            ],
            [
                "category" => "文学",
                "question" => "“给我一个支点，我就能撑起整个地球”出自哪位科学家之口？",
                "answer" => "阿基米德"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“少年不知愁滋味,爱上层楼,爱上层楼,为赋新辞强说愁! 而今识尽愁滋味,欲说还休,欲说还休,却道天凉好个秋。”请问这是哪位词人的作品？",
                "answer" => "辛弃疾"
            ],
            [
                "category" => "文学",
                "question" => "“心比天高，身为下贱，风流灵巧招人怨”说的是《红楼梦》中的谁？",
                "answer" => "贾宝玉"
            ],
            [
                "category" => "文学",
                "question" => "律诗分为七律和五律，他们都只有几句？",
                "answer" => "八句"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“醉里挑灯看剑，梦回吹角连营”出自谁的作品？",
                "answer" => "辛弃疾"
            ],
            [
                "category" => "文学",
                "question" => "“不敢逾越雷池一步”被用来比喻不敢越过某一界限。这里的“雷池”原本是什么意思?",
                "answer" => "湖名"
            ],
            [
                "category" => "文学",
                "question" => "“天下兴亡，匹夫有责”语出哪位名人？",
                "answer" => "顾炎武"
            ],
            [
                "category" => "文学",
                "question" => "“生当作人杰，死亦为鬼雄。至今思项羽，不肯过江东。”是谁咏赞项羽的名句？",
                "answer" => "李清照"
            ],
            [
                "category" => "文学",
                "question" => "《红楼梦》的四大家族中没有下列哪个姓氏？",
                "answer" => "吴"
            ],
            [
                "category" => "文学",
                "question" => "宋朝著名的《洗冤录集》属于什么类型的书籍？",
                "answer" => "法医学著作"
            ],
            [
                "category" => "文学",
                "question" => "《孔雀东南飞》中的“自挂东南枝”，其原意是指什么？",
                "answer" => "自缢"
            ],
            [
                "category" => "文学",
                "question" => "《一千零一夜》又名《天方夜谭》，这里的“天方”是指什么？",
                "answer" => "阿拉伯"
            ],
            [
                "category" => "文学",
                "question" => "以下哪部作品不属于儒学经典？",
                "answer" => "《道德经》"
            ],
            [
                "category" => "文学",
                "question" => "《水浒传》中的“水泊梁山”就是现在的哪个省？",
                "answer" => "山东省"
            ],
            [
                "category" => "文学",
                "question" => "下列戏曲行当中哪种只指“男性”？",
                "answer" => "生"
            ],
            [
                "category" => "文学",
                "question" => "唐代文学家韩愈诗中的“祝融万丈拔地起，预见不见轻烟里”是指哪座山？",
                "answer" => "衡山"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“郎骑竹马来，绕床弄青梅”出自李白的《长干行》，根据诗中描写，这两人居住的地方在今？",
                "answer" => "南京市"
            ],
            [
                "category" => "文学",
                "question" => "古典小说《水浒传》的作者是？",
                "answer" => "施耐庵"
            ],
            [
                "category" => "文学",
                "question" => "古诗名句“人生如梦，一樽还酹江月”出自苏轼的？",
                "answer" => "《念奴娇·赤壁怀古》"
            ],
            [
                "category" => "文学",
                "question" => "以下哪部文献既是迄今流传下来的第一部编年史，也是“五经”之一？",
                "answer" => "《春秋》"
            ],
            [
                "category" => "文学",
                "question" => "李清照词“人比黄花瘦”中的“黄花”指什么花？",
                "answer" => "菊花"
            ],
            [
                "category" => "文学",
                "question" => "“老吾老以及人之老”是中华民族的传统美德，这句话是谁最早提出的？",
                "answer" => "孟子"
            ],
            [
                "category" => "文学",
                "question" => "三书六礼是中国传统婚姻习俗礼仪，其中三书包括“礼书”、“迎书”和什么?",
                "answer" => "聘书"
            ],
            [
                "category" => "文学",
                "question" => "下列作品中与作者的对应，哪项是错误的？",
                "answer" => "汤显祖《西厢记》"
            ],
            [
                "category" => "文学",
                "question" => "名句“但愿人长久，千里共婵娟”中的“婵娟”指的是什么？",
                "answer" => "明月"
            ],
            [
                "category" => "文学",
                "question" => "我国道家学派创始人是谁？",
                "answer" => "老子"
            ],
            [
                "category" => "文学",
                "question" => "我国古代著名史书《三国志》的作者是谁？",
                "answer" => "陈寿"
            ],
            [
                "category" => "文学",
                "question" => "唐诗“日暮乡关何处是？烟波江上使人愁”中的“江”是指什么江？",
                "answer" => "长江"
            ],
            [
                "category" => "文学",
                "question" => "“琴瑟之好”是什么意思?",
                "answer" => "比喻夫妻间感情和谐"
            ],
            [
                "category" => "文学",
                "question" => "被贺知章赞叹为“天上谪仙人”的是谁?",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "“道可道，非常道；名可名，非常名”出自什么著作?",
                "answer" => "《道德经》"
            ],
            [
                "category" => "文学",
                "question" => "形容美女一般说“沉鱼落雁，闭月羞花”，而这几个词最早的出处，“羞花”是指的哪一位？",
                "answer" => "杨贵妃"
            ],
            [
                "category" => "文学",
                "question" => "古人曰：“熟读《三字经》，便可知天下事，通圣人礼。”《三字经》所反映的是哪家的思想？",
                "answer" => "儒家思想"
            ],
            [
                "category" => "文学",
                "question" => "“惊天动地”作为成语，原本是用来形容什么？",
                "answer" => "李白诗歌影响力"
            ],
            [
                "category" => "文学",
                "question" => "人称“小李白”，中国古代最高产的诗人是谁？",
                "answer" => "陆游"
            ],
            [
                "category" => "文学",
                "question" => "唐代诗人罗隐所写《自遣》中，“今朝有酒今朝醉”的下一句为何？",
                "answer" => "明日愁来明日愁"
            ],
            [
                "category" => "文学",
                "question" => "人们常以“门外汉”来表示外行人。这里的“门”最初指什么门？",
                "answer" => "佛门"
            ],
            [
                "category" => "文学",
                "question" => "《早冬》是一首描写冬天的诗，“十月江南天气好”的下一句是什么?",
                "answer" => "可怜冬景似春华"
            ],
            [
                "category" => "文学",
                "question" => "磨杵成针的故事和哪位诗人有关？",
                "answer" => "李白"
            ],
            [
                "category" => "文学",
                "question" => "《夜雪》是一首描写冬天的诗，“时闻折竹声”的上一句是什么？",
                "answer" => "大白菜"
            ],
            [
                "category" => "文学",
                "question" => "杜甫的《八阵图》中有句“功盖三分国”，形容的是谁？",
                "answer" => "诸葛亮"
            ],
            [
                "category" => "文学",
                "question" => "《西游记》中，玉帝一开始封孙悟空为什么官职？",
                "answer" => "弼马温"
            ],
            [
                "category" => "文学",
                "question" => "《百家姓》是一本关于汉姓的书，该书成于哪一年？",
                "answer" => "北宋初"
            ],
            [
                "category" => "文学",
                "question" => "京剧中，饰演性格活泼、开朗的青年女性的应是？",
                "answer" => "花旦"
            ],
        ];

        $questions = collect($questions)->map(function ($item) {
            return array_merge($item, [
                "created_at" => Carbon::now(),
                "updated_at" => Carbon::now(),
            ]);
        })
        ->toArray();

        Question::insert($questions);
    }
}
