<?php

use App\Models\Question;
use Illuminate\Support\Carbon;
use Illuminate\Database\Seeder;

class QuestionsMathSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $questions = [
            [
                "category" => "数学",
                "question" => "狡猾的骗子到商店用100元的钞票买了9元的东西，售后员找了他91元。这时，骗子称自己已有零钱，提出给售货员9元而要回自己原来的100元。如果售货员同意了骗子的提议，那么他被骗了多少钱？",
                "answer" => "91元"
            ],
            [
                "category" => "数学",
                "question" => "小华相信自己的吉祥数字是7：这天，他把各个数字之和为7的数从小到大列出来：7、16、25、34、43…请算一下这个数列的第10个数字是多少？",
                "answer" => "115"
            ],
            [
                "category" => "数学",
                "question" => "某城市于2009年3月28日中午12：00开始停电，直至2009年4月1日00：00恢复供电。请问该城市此次共停电多少小时？",
                "answer" => "84个小时"
            ],
            [
                "category" => "数学",
                "question" => "从自然数1开始到100截止，所有数字的和是多少？",
                "answer" => "5050"
            ],
            [
                "category" => "数学",
                "question" => "以下哪个定理，在西方国家被称为“毕达哥拉斯定理”？",
                "answer" => "勾股定理"
            ],
            [
                "category" => "数学",
                "question" => "在1，2，3……，2002，2003，2004，2005，2006个自然数中含有数字1共有几个",
                "answer" => "1272个"
            ],
            [
                "category" => "数学",
                "question" => "边长3厘米的正方体箱子中，最多能装几个半径为1厘米的小圆球？",
                "answer" => "8个"
            ],
            [
                "category" => "数学",
                "question" => "现有100个乒乓球，由两个人轮流拿球装入口袋，能拿到第100个乒乓球的人为胜利者。条件是每次拿球者至少要拿1个，但最多不能超过5个，如果由你先拿球，第一次拿几个球才能保证你一定能拿到第100个乒乓球获得胜利？",
                "answer" => "4个"
            ],
            [
                "category" => "数学",
                "question" => "小张一共做了15道数学竞赛题，做对一道题得8分，不做题或做错题扣4分，小张一共得了72分，问小张一共做对了多少道？",
                "answer" => "11道"
            ],
            [
                "category" => "数学",
                "question" => "100个小球放到不同的盒子里，每一个盒子至少装一个，不能出现相同的盒子，请问最多可以放几个盒",
                "answer" => "13个"
            ],
            [
                "category" => "数学",
                "question" => "有个年轻人来到王老板的店里买了一件礼物，这件礼物成本是18元，标价是21元。 结果是这个年轻人掏出100元要买这件礼物。王老板当时没有零钱，用那100元向街坊换了100元的零钱，找给年轻人79元。 但是街坊后来发现那100元是假钞，王老板无奈还了街坊100元。请问王老板在这次交易中损失了多少钱？",
                "answer" => "97元"
            ],
            [
                "category" => "数学",
                "question" => "(直径)边长为4厘米的正方体中，最多能装几个直径为1厘米的小圆球？",
                "answer" => "64个"
            ],
            [
                "category" => "数学",
                "question" => "比武大赛，有10个队参加，每队都要与其他各队赛一场。这些比赛分别到9个比武场进行，平均每个比武场有几场比赛？",
                "answer" => "5场"
            ],
            [
                "category" => "数学",
                "question" => "农夫有21个鸡蛋，除了9个以外都卖出去了，请问农夫还剩几个鸡蛋？",
                "answer" => "9个"
            ],
            [
                "category" => "数学",
                "question" => "(问小和尚)100个和尚吃100个馒头，大和尚一人吃4个小和尚4人吃1个。问小和尚有多少人？",
                "answer" => "80人"
            ],
            [
                "category" => "数学",
                "question" => "小明今年6岁，他祖父72岁，几年后，小明的年龄是他祖父的1/4？",
                "answer" => "16年后"
            ],
            [
                "category" => "数学",
                "question" => "军人常用“大拇指测距法”具体为：平举右臂，握拳立起大拇指;先用右眼将大拇指的左边与目标物连成一线;再估算左眼与大拇指左边的连线对目标物右侧偏移了多远，乘以10后就是人与目标的距离。请问此测距法的主要原理是什么呢？",
                "answer" => "正弦定理"
            ],
            [
                "category" => "数学",
                "question" => "2位数中最大的质数是什么数？",
                "answer" => "97"
            ],
            [
                "category" => "数学",
                "question" => "在直径为2厘米的圆圈中，最多能放几个直径为1厘米的，不相互叠加的硬币？",
                "answer" => "2个"
            ],
            [
                "category" => "数学",
                "question" => "1000+40+1000+30+1000+20+1000+10=？",
                "answer" => "4100"
            ],
            [
                "category" => "数学",
                "question" => "火树银花楼七层，层层红灯倍加增，共有红灯三八一，试问四层几红灯？”从这首诗中，我们可以得知第四层有多少盏红灯？",
                "answer" => "24盏"
            ],
            [
                "category" => "数学",
                "question" => "小王到海南旅游从飞机往窗外望去，看见部分海岛，白云以及一些海域，若白云占窗口的一半，它遮住了海岛的的四分之一，因此海岛在窗口画面只占四分之一，那么，被白云遮住的那部分海域占窗口画面的几分之几？",
                "answer" => "5/12"
            ],
            [
                "category" => "数学",
                "question" => "(问大和尚)100个和尚吃100个馒头，大和尚一人吃4个小和尚4人吃1个。问大和尚有多少人？",
                "answer" => "20人"
            ],
            [
                "category" => "数学",
                "question" => "一只长颈鹿高5米，比一头大象的5倍还多1米，这头大象高几米？",
                "answer" => "0.8米"
            ],
            [
                "category" => "数学",
                "question" => "连续抛9次硬币，第10次出现正面的概率是多少？",
                "answer" => "50%"
            ],
            [
                "category" => "数学",
                "question" => "有一张圆形的厚饼,在不允许移动饼的情况下切3刀,最多可以切成多少片？",
                "answer" => "8片"
            ],
            [
                "category" => "数学",
                "question" => "假设一张一角纸币重2克，一张两角纸币重3克，现有一个装满这两种纸币的大捐款箱，里面的纸币共重100克，已知两角纸币有10张，则箱里一共有多少钱？",
                "answer" => "5元5角"
            ],
            [
                "category" => "数学",
                "question" => "每个笼子里有2只兔子，为了打扫兔笼子，将4个笼子里的兔子放进装有5头饥饿的狼的大笼子里，等打扫好3个兔笼子后，把兔子放回兔笼里。这时还有几只活兔子？",
                "answer" => "0只"
            ],
            [
                "category" => "数学",
                "question" => "小山猪和兔战士两个好朋友去书店逛，两人都想买《梦想世界游戏攻略》这本书，但钱都不够；小山猪缺2.5元，兔战士缺0.01元，用两个人合起来的钱买一本，仍然不够。试问，这本书的价钱是多少？",
                "answer" => "2.5元"
            ],
            [
                "category" => "数学",
                "question" => "瓶子里有不到100粒提神丹，如果每次从里面拿出3粒，到最后还剩1粒，如果每次拿4粒，到最后也会剩1粒，如果每次从里面拿5粒，到最后同样剩1粒，瓶子里有提神丹多少粒？",
                "answer" => "61"
            ],
            [
                "category" => "数学",
                "question" => "一根竹竿两个头，两根竹竿四个头，三根半竹竿几个头？",
                "answer" => "8"
            ],
            [
                "category" => "数学",
                "question" => "3.5吨的重物,重量单位换用千克来表示,应该等于多少千克？",
                "answer" => "3500千克"
            ],
            [
                "category" => "数学",
                "question" => "有一张圆形的厚饼,在不允许移动饼的情况下切4刀,最多可以切成多少片？",
                "answer" => "14片"
            ],
            [
                "category" => "数学",
                "question" => "一杯盐水,含盐量30%,现在放入7克水和3克盐,这时杯子里盐水的含盐量为多少？",
                "answer" => "30%"
            ],
            [
                "category" => "数学",
                "question" => "一根9米铁丝剪成两段，第一段长5/9米，第二段占全长的5/9,两段铁丝哪段更长？",
                "answer" => "第二段长"
            ],
            [
                "category" => "数学",
                "question" => "一队强盗一队狗，二队拼作一队走，数头一共三百六，数腿一共八百九。有多少强盗多少狗？",
                "answer" => "275个强盗85条狗"
            ],
            [
                "category" => "数学",
                "question" => "以知A+15*B=1，则(16-45*B)-A*3的结果是多少？",
                "answer" => "13"
            ],
            [
                "category" => "数学",
                "question" => "一个小于100的数字除以3，除以4，除以5，所得余数全是2。请问这个数字是多少？",
                "answer" => "62"
            ],
            [
                "category" => "数学",
                "question" => "有一根铁丝长1毫米，现用它弯成一个三角形，则以下答案中不可能出现的一条边长是？",
                "answer" => "0.6"
            ],
            [
                "category" => "数学",
                "question" => "小宝今年7岁，妈妈今年31岁，再过几年，妈妈的年龄是小宝的4倍？",
                "answer" => "1年"
            ],
            [
                "category" => "数学",
                "question" => "已知一块三角形木板的两条边长分别为八万八千八百八十八公里和九万九千九百九十九公里，则第三条边的长度“不可能是”？",
                "answer" => "一万公里"
            ],
            [
                "category" => "数学",
                "question" => "一次数学竞赛共有20道题，做对一道题得5分，做错一题倒扣3分，烈阳芒考了52分，你知道他做对了几道题？",
                "answer" => "14题"
            ],
            [
                "category" => "数学",
                "question" => "在跑马场的跑道上，有A、B、C三匹马，A一分钟能跑两圈，B能跑三圈，C能跑四圈，现将三匹马并排在起跑线上，向同一个方向起跑，请问：最少经过几分钟，这三匹马又能并排地跑在起跑线上？",
                "answer" => "1分钟"
            ],
            [
                "category" => "数学",
                "question" => "2008年北京奥运会足球赛预计共有24个球队参加比赛，第一轮分成6个组进行单循环赛(在同一组的每两个队都要比赛)，决出每个组的一，二名，然后又在剩下的12个队中按积分取4个队(不比赛)，共计16个队进行淘汰赛来确定冠亚军，则一共需比赛几场？",
                "answer" => "51场"
            ],
            [
                "category" => "数学",
                "question" => "一个数，加5后乘以5，再减去5，再除以5，结果等于5，这个数是奇数还是偶数？",
                "answer" => "奇数"
            ],
            [
                "category" => "数学",
                "question" => "A和B表示两个时间段,A=1小时20分钟+100秒,B=1.4小时,A和B哪个时间更长一些？",
                "answer" => "B更长"
            ],
            [
                "category" => "数学",
                "question" => "一群兔子排队,从左数小兔子是第12位,从右数小兔子是第13位,这群兔子一共有几只？",
                "answer" => "24只"
            ],
            [
                "category" => "数学",
                "question" => "一群兔子排队,从左数小兔子是第11位,从右数小兔子是第12位,这群兔子一共有几只？",
                "answer" => "22只"
            ],
            [
                "category" => "数学",
                "question" => "在“1,3,5,7,9”这几个数字里,质数有几个？",
                "answer" => "三个"
            ],
            [
                "category" => "数学",
                "question" => "一根10米长的木棍，从一段开始逐次锯成2米一段的小木棍，锯一次用时3分钟，然后休息1分钟，全部锯完要多久？",
                "answer" => "15"
            ],
            [
                "category" => "数学",
                "question" => "一根20米长的木棍，从一段开始逐次锯成2米一段的小木棍，锯一次用时3分钟，然后休息1分钟，全部锯完要多久？",
                "answer" => "35"
            ],
            [
                "category" => "数学",
                "question" => "小华体重是小林的90%，小林体重是小刚的10分之7，他们谁的体重最小？",
                "answer" => "小华"
            ],
            [
                "category" => "数学",
                "question" => "1+2+3+……+47+48+49+50=？",
                "answer" => "1275"
            ],
            [
                "category" => "数学",
                "question" => "把一根木头锯成2段要2分钟，锯成3段要几分钟？",
                "answer" => "4"
            ],
            [
                "category" => "数学",
                "question" => "小乌龟过生日，请来6个朋友吃饭，每人一碗饭，2人一碗菜，3人一碗汤，小乌龟要准备几个碗？",
                "answer" => "11碗"
            ],
            [
                "category" => "数学",
                "question" => "小乌龟过生日，请来12个朋友吃饭，每人一碗饭，2人一碗菜，3人一碗汤，小乌龟应该准备几个碗？",
                "answer" => "22碗"
            ],
            [
                "category" => "数学",
                "question" => "一次考试，共有25个问题，答对1题得4分，答错或不答倒扣1分，某同学成绩为60分，请问他答对了多少题？",
                "answer" => "17题"
            ],
            [
                "category" => "数学",
                "question" => "有一个班的同学去划船，如果增加一条船，则每条船正好坐6人，如果减少一条船，则每条船正好坐8人，问全班有多少个同学？",
                "answer" => "48个"
            ],
            [
                "category" => "数学",
                "question" => "在NPC“铁匠”处使用2个1级如意宝玉可以合成1个2级如意宝玉，依次类推，使用多少个1级如意宝玉便可以合成一个8级如意宝玉？",
                "answer" => "128个"
            ],
            [
                "category" => "数学",
                "question" => "一筐桃子，如果2个2个的数剩1个，3个3个的数剩2个，4个4个的数剩3个，5个5个的数剩4个，6个6个的数剩5个，请算算这筐桃子至少有多少个？",
                "answer" => "59"
            ],
            [
                "category" => "数学",
                "question" => "一个正方形草坪，每边都等距离种了15颗数，四个角上都各有1颗，那么一共种了多少颗树？",
                "answer" => "56"
            ],
            [
                "category" => "数学",
                "question" => "四只兔子分萝卜，每只兔子最少要分到2个萝卜，每3只兔子最少要分到8个萝卜，那么最少需要几个萝卜？",
                "answer" => "11"
            ],
            [
                "category" => "数学",
                "question" => "现有甲，乙两个水平相当的技术工人需进行三次技术比赛，规定三局两胜者为胜方。如果在第一次比赛中甲已经获胜，这时乙最终取胜的可能性有多大？",
                "answer" => "1/4"
            ],
            [
                "category" => "数学",
                "question" => "学前班毕业时，小乌龟，小兔子，小蜜蜂三人互相赠照片一张，他们一共互赠了多少张照片？",
                "answer" => "6"
            ],
            [
                "category" => "数学",
                "question" => "已知一段高速公路长2米，现需要翻修，甲施工队单独修完需要八年，乙施工队单独修完需要十年，现在两个施工队从两端同时动工，大约多久修完？",
                "answer" => "4到5年"
            ],
            [
                "category" => "数学",
                "question" => "一筐萝卜，兔战士3天吃完，小兔子4天吃完，小兔子每天比兔战士少吃5个，这筐萝卜有几个？",
                "answer" => "60个"
            ],
            [
                "category" => "数学",
                "question" => "兔战士有48个萝卜,小兔子有36个萝卜,兔战士给小兔子几个萝卜,他们的萝卜就一样多了？",
                "answer" => "6个"
            ],
            [
                "category" => "数学",
                "question" => "兔战士有124萝卜，兔祭祀有20个，兔战士想让兔祭祀的萝卜数量和自己的一样多，他每次拿出13个萝卜给兔祭祀，请问需要拿几次的数量一样？",
                "answer" => "4次"
            ],
            [
                "category" => "数学",
                "question" => "一个水池里的浮萍每天长大1倍，10天可以长满整个水池，问第几天可以长满水池的一半？",
                "answer" => "9"
            ],
            [
                "category" => "数学",
                "question" => "小明帮妈妈做家务，其中拖地需要10分钟，用洗衣机洗衣服用25分钟，擦桌子用8分钟，烧水用10分钟。做完这些家务，小明最少需要多少时间？",
                "answer" => "25"
            ],
            [
                "category" => "数学",
                "question" => "甲以为自己的表快五分钟，实际上是慢了十分钟；乙的表慢了五分钟，乙却以为它慢了十分钟。甲乙都想赶四点钟的火车，谁先到火车站？",
                "answer" => "乙"
            ],
            [
                "category" => "数学",
                "question" => "一名长跑运动员在运动场环形跑道上进行长跑比赛，他在比赛过程中数了下，发现前面有7个人在跑，又数了下，发现自己后面也有7个人在跑着，请问现在运动场上一共有几名运动员？",
                "answer" => "8"
            ],
            [
                "category" => "数学",
                "question" => "试卷上有6道选择题，每题有3个选项，结果阅卷老师发现，在所有卷子中任选3张答卷，都有一道题的选择互不相同，请问最多有多少人参加了这次考试？",
                "answer" => "13"
            ],
            [
                "category" => "数学",
                "question" => "一张地图上,以2厘米表示实际距离20千米,那么该地图上3平方厘米所表示的实际面积是多少？",
                "answer" => "300平方千米"
            ],
            [
                "category" => "数学",
                "question" => "有30个人参加羽毛球比赛，比赛采用淘汰赛，要决出冠军一共要比赛多少场？",
                "answer" => "29"
            ],
            [
                "category" => "数学",
                "question" => "三个人玩一副扑克，每人摸到18张牌？大王和小王被同一个人(任意某人)摸到的几率是多少？",
                "answer" => "1/9"
            ],
            [
                "category" => "数学",
                "question" => "一根绳子对折，再对折，然后从中间剪断，共剪成几段？",
                "answer" => "5"
            ],
            [
                "category" => "数学",
                "question" => "一条小船要渡37人，一次只能有7人，最少几次能渡完？",
                "answer" => "6次"
            ],
            [
                "category" => "数学",
                "question" => "某年的9月份有5个星期日，其中9月1日不是星期日，那么它是星期几呢？",
                "answer" => "星期六"
            ],
            [
                "category" => "数学",
                "question" => "9个一元面值的硬币，其中有一个偏重，用天平最少几次能保证将此硬币抽出来？",
                "answer" => "2次"
            ],
            [
                "category" => "数学",
                "question" => "在七间房子里，每间都养着七只猫，在这七只猫里中，不论哪只，都能捕到七只老鼠，而这七只老鼠，每只都能吃掉七个麦穗，如果每个麦穗都能剥下七颗麦粒，请问：房子、猫、老鼠、麦穗、麦粒，都加在一起总共该有多少数？",
                "answer" => "19607"
            ],
            [
                "category" => "数学",
                "question" => "张三家过年丢了东西，李四说他在除夕晚上借着月光看到是王五偷了，李四的话能信吗？",
                "answer" => "不可信"
            ],
            [
                "category" => "数学",
                "question" => "老汉带了一些马去答谢除暴安良的梁山好汉。他把一半的马匹送给宋江，宋江把一匹马作为回礼；老汉又把所剩马匹的一半送给卢俊义，卢俊义同样把一匹马作为回礼，就这样老汉给108名好汉都送了马并得到了回礼,最后牵着两匹马回家了。请问老汉上梁山时带了多少匹马？",
                "answer" => "2"
            ],
            [
                "category" => "数学",
                "question" => "小明起床后发现闹钟没电了，他装上新电池并将闹钟调到7点。然后，他步行到博物馆，看到楼顶上的电子钟显示为8点50分。小明游玩1小时后从博物馆以同样的速度返回家中，看到闹钟指在11点40分。请问，此时的准确时间是XX点XX分？",
                "answer" => "11:40(就是说一开始调的时间就是准的)"
            ],
            [
                "category" => "数学",
                "question" => "有人将一张纸对折两次都没有成功，一次长1CM，一次短1CM，两折痕宽多少？",
                "answer" => "1厘米"
            ],
            [
                "category" => "数学",
                "question" => "三斤半的鲤鱼和1500克的猪肉，哪一个更重一些？",
                "answer" => "鲤鱼"
            ],
            [
                "category" => "数学",
                "question" => "一个农场有羊和鸭子共44只。每只鸭子有2条腿，每只羊有4条腿，那么要凑成刚好100条腿，鸭子的数量是多少只？",
                "answer" => "38"
            ],
            [
                "category" => "数学",
                "question" => "老师带领45名同学去游玩，看到售票点的牌子上写着：“请游客购票：每张票票价2元;50人或以上可购团体票，票价按八折优惠。”请问老师购买团体票比单人票省多少元？",
                "answer" => "12"
            ],
            [
                "category" => "数学",
                "question" => "树上有5只小鸟，3只准备飞走，问：树上还剩了几只小鸟？",
                "answer" => "5"
            ],
            [
                "category" => "数学",
                "question" => "把一根竹竿直插入水底，竹竿湿了25厘米，然后将竹竿倒过来，再插进水底，这时竹竿湿的部分比全长的1/3长12厘米，问竹竿全长多少厘米？",
                "answer" => "114"
            ],
            [
                "category" => "数学",
                "question" => "出生后的小毛虫,每天身体长度增长一倍,4天后长度为2厘米,再过多少天后长到4厘米？",
                "answer" => "1"
            ],
            [
                "category" => "数学",
                "question" => "如果1=9，2=19，3=29，4=39，5=49，6=59，7=69，8=79，那么9=？",
                "answer" => "1"
            ],
            [
                "category" => "数学",
                "question" => "蒂莫正在环形的跑道上进行自行车比赛，踏了几小时后他意识到在他前面的参赛者的五分之一，加上在他后面的参赛者的六分之五，就是参加这次比赛的总人数。这次比赛一共有多少人参加？",
                "answer" => "31"
            ],
            [
                "category" => "数学",
                "question" => "一个人花8块钱买了一只鸡，9块钱卖掉了。然后他觉得不划算，10块钱买回来，又11块钱卖掉了。请问他赚了多少钱？",
                "answer" => "2"
            ],
            [
                "category" => "数学",
                "question" => "有一种细菌，经过1分钟，1个分裂成2个，再经过1分钟，2个分裂成4个。把这样的细菌放在一个瓶子里，充满瓶子用了1个小时。如果一开始的时候把2个这样的细菌放到瓶子里，那么，充满瓶子需要多少分钟？",
                "answer" => "59"
            ],
            [
                "category" => "数学",
                "question" => "如果把一种商品的进价降低8%售价不变，那么利润增加10%。则原来的利润率是百分之几？",
                "answer" => "15%"
            ],
            [
                "category" => "数学",
                "question" => "一个服装的工人每人每天可以生产4件上衣或7条裤子，一件上衣和一条裤子为一套服装。现有66名工人生产，每天最多能生产多少套服装？",
                "answer" => "168"
            ],
            [
                "category" => "数学",
                "question" => "小猴与小兔去摘桃，小猴摘下15个桃，当小猴吃掉一个后再将自己剩下的桃分3个给小兔子时，它俩的桃就一样多，你知道小兔子摘了多少个桃？",
                "answer" => "8"
            ],
            [
                "category" => "数学",
                "question" => "一只蜗牛想从枯井里爬出来看看天有多大。它每天白天爬上3米，晚上又退下去2米。整整爬到第8天才爬到井口。这口枯井有多深？",
                "answer" => "10米"
            ],
            [
                "category" => "数学",
                "question" => "有一辆火车以每小时15公里的速度离开洛杉矶开往42公里以外的纽约，另一辆火车以每小时20公里的速度离开纽约开往洛杉矶。如果有一只鸟，以每小时30公里的速度和两辆火车同时启动，从洛杉矶出发，碰到另一辆火车后返回，依次在两辆火车来回飞行，直到两车相遇，请问，这只鸟共飞行了多长的距离",
                "answer" => "36"
            ],
            [
                "category" => "数学",
                "question" => "雌雄一对兔子来到黎明镇开荒定居，假设每过两个月，每对兔子可以繁殖出雌雄各一只的一对兔子，问过一年后黎明镇共有多少对兔子？",
                "answer" => "64"
            ],
            [
                "category" => "数学",
                "question" => "七个自然数排成一排，从第三个数开始，每个数都是它前面两个数之和，已知第四个数是4，求第七个数",
                "answer" => "18"
            ],
            [
                "category" => "数学",
                "question" => "四只兔子分萝卜，每只兔子最少要分到2个萝卜，每3只兔子最少要分到10只萝卜。那么最少需要几个萝卜？",
                "answer" => "14"
            ],
            [
                "category" => "数学",
                "question" => "小兔子拔萝卜，每拔一个萝卜要1分钟，拔5个萝卜要休息1分钟，拔100个萝卜要多久",
                "answer" => "119"
            ],
            [
                "category" => "数学",
                "question" => "小明家位在9楼，他每天从一楼爬到家门口要爬几楼？",
                "answer" => "8"
            ],
            [
                "category" => "数学",
                "question" => "一栋住宅楼，爷爷从一楼走到三楼要6分钟，现在从一楼走到六楼要走多少分钟？",
                "answer" => "15分钟"
            ],
            [
                "category" => "数学",
                "question" => "从一楼跑到四楼需要6秒，问：以同样的速度从四楼跑到八楼需要多少时间？",
                "answer" => "8秒"
            ],
            [
                "category" => "数学",
                "question" => "有两个奇怪的村子，张村的人在星期一、三、五说谎，李村的人在星期二、四、六说谎。在其他日子他们说实话。一天，外地的王从明来到这里，见到两个人，分别向他们提出关于日期的问题。两个人都说：“前天是我说谎的日子。”如果被问的两个人分别来自张村和李村，那么这天是星期几？",
                "answer" => "星期一"
            ],
            [
                "category" => "数学",
                "question" => "注意细节5张饼，一个平底锅最多可放2张饼,每张饼要煎正反两面,每煎一面用1分钟,现在用来煎5张饼,最少需要几分钟？",
                "answer" => "5分钟"
            ],
            [
                "category" => "数学",
                "question" => "注意细节6张饼，一个平底锅最多可放2张饼,每张饼要煎正反两面,每煎一面用1分钟,现在用来煎6张饼,最少需要几分钟？",
                "answer" => "6分钟"
            ],
            [
                "category" => "数学",
                "question" => "今年小明8岁，小亮14岁，若干年后，当两人年龄加起来是48岁时，小明会是几岁？",
                "answer" => "21岁"
            ],
            [
                "category" => "数学",
                "question" => "一个两位数，它的个位数与十位数相加等于5，这样的两位数有几个",
                "answer" => "5个"
            ],
            [
                "category" => "数学",
                "question" => "黄金分割点是指把一条线分割为两部分，使其中一部分与全长之比等于另一部分与这部分之比。请问这个比值约是多少？",
                "answer" => "0.618"
            ],
            [
                "category" => "数学",
                "question" => "注意细节8008年，某岗位工作人员的上班规律为“AABBCCDD”。其中A、B、C、D分别代表早班、中班、夜班、休息，节假日照常上班。如果不考虑特殊情况，请问8008年2月份一位工作人员最多要上几天班？",
                "answer" => "23天"
            ],
            [
                "category" => "数学",
                "question" => "注意细节2008年，某工作单位人员的上班规律为“AABBCCDD”。其中A、B、C、D分别代表早班、中班、夜班、休息，节假日照常上班。如果不考虑特殊情况，请问2008年2月份一位工作人员最少要上几天班？",
                "answer" => "21天"
            ],
            [
                "category" => "数学",
                "question" => "数字规律题 -1，1，-1，-2，2，()",
                "answer" => "-2"
            ],
            [
                "category" => "数学",
                "question" => "68、86、52中最大数的平方与余下2个数之积的差是多少？",
                "answer" => "3860"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 5687-2356+1313-1144 结果等于多少？",
                "answer" => "3500"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 1+2+3+……+98+99+100 结果等于多少？",
                "answer" => "5050"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 49×25+51×25-500 结果等于多少？",
                "answer" => "2000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 3753÷9+5247÷9-100 结果等于多少？",
                "answer" => "900"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 1755-377-623 结果等于多少？",
                "answer" => "755"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 5687-2356+1313-1144-500 结果等于多少？",
                "answer" => "3000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 5687-2356+1313-1444+500 结果等于多少？",
                "answer" => "4000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 3+2-(5×0) 结果等于多少？",
                "answer" => "5"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 99*99 结果等于多少？",
                "answer" => "9801"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 4+4+4+44+44 结果等于多少？",
                "answer" => "100"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 219×53-219×18+35×81 结果等于多少？",
                "answer" => "10500"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 49×25+51×25 结果等于多少？",
                "answer" => "2500"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2750-15-27-85-73-50 结果等于多少？",
                "answer" => "2500"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2700-225-275-200 结果等于多少？",
                "answer" => "2000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 219×53-219×18+35×81+10×11 结果等于多少？",
                "answer" => "10610"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 49×25+53×25-50 结果等于多少？",
                "answer" => "2500"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 49×25+51×25+500 结果等于多少？",
                "answer" => "3000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 3753÷9+5247÷9 结果等于多少？",
                "answer" => "1000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 77+1230-1000+23 结果等于多少？",
                "answer" => "330"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 219×53-219×18+35×81+10×13 结果等于多少？",
                "answer" => "10630"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2750-15-27-25-73-50 结果等于多少？",
                "answer" => "2560"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 (45+78+22+55)×12 结果等于多少？",
                "answer" => "2400"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 45×73-45×53 结果等于多少？",
                "answer" => "900"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 25×5×2×4 结果等于多少？",
                "answer" => "1000"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 770-232-468 结果等于多少？",
                "answer" => "70"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2700-225-275 结果等于多少？",
                "answer" => "2200"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 42×25÷7×4 结果等于多少？",
                "answer" => "600"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 3×15÷21×4×7 结果等于多少？",
                "answer" => "60"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 9900-815-472-185-528 结果等于多少？",
                "answer" => "7900"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 171+2324+6+829 结果等于多少？",
                "answer" => "3330"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 520+1314+1234+686+1480 结果等于多少？",
                "answer" => "5234"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 (45×73-45×53)÷2 结果等于多少？",
                "answer" => "450"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 454+372+546 结果等于多少？",
                "answer" => "1372"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 456+372+544 结果等于多少",
                "answer" => "1372"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2750-15-27-85-73 结果等于多少？",
                "answer" => "2550"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2750-15-27-85-73+50 结果等于多少？",
                "answer" => "2600"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2700-225-275+300 结果等于多少？",
                "answer" => "2500"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 (45×73-45×53)×2 结果等于多少？",
                "answer" => "1800"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 157+333-50+43-33 结果等于多少？",
                "answer" => "450"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 (987-654-33)÷2 结果等于多少？",
                "answer" => "150"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 2750-15-27-85-75+50 结果等于多少？",
                "answer" => "2598"
            ],
            [
                "category" => "数学",
                "question" => "口算结果 (2468-1357)÷11 结果等于多少？",
                "answer" => "101"
            ],
            [
                "category" => "数学",
                "question" => "注意细节1万元，某人各用1万元购买甲乙两种股票，购入时甲每股8元，乙每股4元，当甲、乙分别为12元、3元时全部抛出，问此人一共获利多少元？",
                "answer" => "2500"
            ],
            [
                "category" => "数学",
                "question" => "注意细节2万元，某人有2万元资金购买甲乙两种股票，其中甲每股8元，乙每股4元，此人把资金平均投资到甲乙，当甲乙分别为12元3元时全部抛出，问此人一共获利多少元？",
                "answer" => "5000"
            ],
            [
                "category" => "数学",
                "question" => "注意细节6天吃完，三只兔子一起吃三筐萝卜需要6天吃完，十只兔子一起吃十筐萝卜需要几天吃完？",
                "answer" => "6天"
            ],
            [
                "category" => "数学",
                "question" => "注意细节3天吃完，三只兔子一起吃三筐萝卜需要3天吃完，十只兔子一起吃十筐萝卜需要几天吃完？",
                "answer" => "3天"
            ],
            [
                "category" => "数学",
                "question" => "注意细节求几只，假设每只羊的重量数均为整公斤数。已知一群羊的总重量为65公斤，其中最轻的一只重7公斤，除去一只10公斤的羊外，其余各只羊的公斤数恰能组成等差数列。请问这群羊共有几只？",
                "answer" => "6只"
            ],
            [
                "category" => "数学",
                "question" => "注意细节求重量，假设每只羊的重量数均为整公斤数。已知一群羊的总重量为65公斤，其中最轻的一只重7公斤，除去一只10公斤的羊外，其余各只羊的公斤数恰能组成等差数列。请问最重的羊有几公斤？",
                "answer" => "15公斤"
            ],
            [
                "category" => "数学",
                "question" => "注意细节盈亏值，某书店某天销售两种书，甲种书盈利20%共卖得1200元，乙种书亏本10%共卖得900元，某书店这两种书总计盈利多少元？",
                "answer" => "100元"
            ],
            [
                "category" => "数学",
                "question" => "注意细节盈亏值，某书店某天销售两种书，甲种书盈利20%共卖得1560元，乙种书亏本10%共卖得1350元，某书店这两种书总计盈利多少元？",
                "answer" => "110元"
            ],
            [
                "category" => "数学",
                "question" => "世界上第一个把圆周率的数值推算到小数点后七位的数学家是谁？",
                "answer" => "祖冲之"
            ],
            [
                "category" => "数学",
                "question" => "祖冲之第一个把圆周率准确推算到小数点后第几位？",
                "answer" => "第七位"
            ],
            [
                "category" => "数学",
                "question" => "有两个沙漏，甲沙漏漏完需要3分钟，乙沙漏漏完需要5分钟。两个沙漏同时开始漏沙。第一次，甲沙漏漏完成立即将其翻转过来，乙沙漏不变，继续漏沙。第二次，乙沙漏漏完后也立即将其翻转过来，甲继续漏沙。第三次，甲漏完沙后，再翻转，乙继续漏沙。请问直至乙漏完沙整个过",
                "answer" => "10分钟"
            ],
            [
                "category" => "数学",
                "question" => "小林的体重是小王的70%,小刚的体重是小王的十分之七谁最轻？",
                "answer" => "小林"
            ],
            [
                "category" => "数学",
                "question" => "有十支蜡烛，你吹灭了三支，还有几支？",
                "answer" => "10"
            ],
            [
                "category" => "数学",
                "question" => "一个挂钟敲6下要30秒，敲12下要多少秒？",
                "answer" => "66秒"
            ],
            [
                "category" => "数学",
                "question" => "医生给你3颗药叫你每半小时吃一颗你吃完要多少小时？",
                "answer" => "1小时"
            ],
            [
                "category" => "数学",
                "question" => "10道题，对得10分错扣5分，小明得70分，他做对了几道题？",
                "answer" => "8道题"
            ],
            [
                "category" => "数学",
                "question" => "注意细节人数，王老太去集市卖鸡蛋，第一个人买走篮子里鸡蛋的一半又一个，第二个人买走剩下鸡蛋的一半又一个，这时篮子里还剩一个鸡蛋，请问王老太总共有几个鸡蛋？",
                "answer" => "10个鸡蛋"
            ],
            [
                "category" => "数学",
                "question" => "注意细节人数，王老太去集市卖鸡蛋，第一个人买走篮子里鸡蛋的一半又一个，第二个人买走剩下鸡蛋的一半又一个，第三个人买走前两个人剩下的一半又一个，这时篮子里鸡蛋卖完了，请问王老太总共有几个鸡蛋？",
                "answer" => "14个鸡蛋"
            ],
            [
                "category" => "数学",
                "question" => "篮子里的鸡蛋一分钟增加1倍，12分钟装满篮子，请问篮子里有一半鸡蛋的时候是什么时候？",
                "answer" => "11分钟"
            ],
            [
                "category" => "数学",
                "question" => "猴子每分钟能掰1个玉米，在果园里，一只猴子5分钟能掰几个玉米？",
                "answer" => "0个玉米"
            ],
            [
                "category" => "数学",
                "question" => "一颗树上有20个果子，一阵风吹落了一半，后来果农摘了一半，请问树上还有多少果子？",
                "answer" => "5个"
            ],
            [
                "category" => "数学",
                "question" => "鸡兔同笼，头46只，脚128只，问鸡几只？",
                "answer" => "28只鸡，18只兔"
            ],
            [
                "category" => "数学",
                "question" => "鸡兔同笼，头48只，脚128只，问鸡几只？",
                "answer" => "28只鸡，16只兔"
            ],
            [
                "category" => "数学",
                "question" => "鸡兔同笼，现有数量相同的鸡兔，已知兔腿多42条。问笼子中的鸡和兔子有多少只？",
                "answer" => "21只鸡，21只兔"
            ],
            [
                "category" => "数学",
                "question" => "一元钱一瓶汽水(1元钱1汽水)，喝完后两个空瓶换一瓶汽水(2空瓶换1汽水)。问：你有20元钱，最多可以喝到几瓶汽水？",
                "answer" => "39瓶"
            ],
            [
                "category" => "数学",
                "question" => "有个农场，鸡的数目是鸭的四倍，但是鸭又比猪少九只，鸭跟猪的数目加起来是六十七只，请问整个农场所有动物的脚一共有几只？",
                "answer" => "442只"
            ],
            [
                "category" => "数学",
                "question" => "1到100的100个数字中,共有多少个9字呢？",
                "answer" => "20个"
            ],
            [
                "category" => "数学",
                "question" => "某校举行书法比赛，5、6年级共有20人得奖，在所有获奖者中，有16人不是六年级的，有12人不是五年级的，书法比赛获奖总人数是多少人？",
                "answer" => "24人"
            ],
            [
                "category" => "数学",
                "question" => "五匹马(5匹马)、两个人(2个人)、三条狗(3条狗)和七只鸡(7只鸡)一共有多少条腿？",
                "answer" => "50条腿"
            ],
            [
                "category" => "数学",
                "question" => "阿建比小虎高，小虎的弟弟小小虎比阿宝要高，但是阿建并不是4个人中最高的，那谁最高？",
                "answer" => "小小虎"
            ],
            [
                "category" => "数学",
                "question" => "甲对乙说：“当我是你这么大时你才3岁。”乙说：“当我有你那么大时你刚好15岁。”请问甲多少岁？",
                "answer" => "11岁"
            ],
            [
                "category" => "数学",
                "question" => "一堆西瓜一半的一半的一半比一半的一半少半个这堆西瓜有几个？",
                "answer" => "4个"
            ],
            [
                "category" => "数学",
                "question" => "数列题：2，3，5，9，17，()",
                "answer" => "33"
            ],
            [
                "category" => "数学",
                "question" => "用一对1~6点的6面骰子掷出2个一样点数的概率是多少？",
                "answer" => "1/6"
            ],
            [
                "category" => "数学",
                "question" => "河图与洛书是中国古代流传下来的两幅神秘图案，被认为中华文明的源头是宇宙魔方。在“洛书”上我们可以发现一个有趣的数学方阵--九宫图：数字一至九排成三行三列，每行每列以及对角线上三个数字相加之和都相同。你知道九宫图的中心是哪个数字吗？",
                "answer" => "五"
            ],
            [
                "category" => "数学",
                "question" => "有物不知其数：三三数之剩二，五五数之剩三，七七数之剩二，问此数位几何？",
                "answer" => "23"
            ],
            [
                "category" => "数学",
                "question" => "有一座11尺高很滑的砖墙，一只蜗牛从墙顶开始向下爬。一个小时它爬5尺，但是每爬完一小时后它都要歇息一小时。在这一小时的休息过程中，它又划下去3尺。问蜗牛爬到墙脚要几个小时？",
                "answer" => "7小时"
            ],
            [
                "category" => "数学",
                "question" => "有一座13尺高很滑的砖墙，一只蜗牛从墙顶开始向下爬。一个小时它能爬5尺，但是每爬完一小时后它都要歇息一小时。在这一小时的休息过程中，它又划下去3尺。问蜗牛爬到墙脚要几个小时？",
                "answer" => "3小时"
            ],
            [
                "category" => "数学",
                "question" => "把一块长六分米，宽五分米，高四分米的长方体木料加工一个尽可能大的正方体木料，这块木料的体积是多少立方分米？",
                "answer" => "64立方分米"
            ],
            [
                "category" => "数学",
                "question" => "已知甲打字员每秒钟打1个字，乙打字员每2秒钟打1个字，两人打同样一篇发言稿，甲比乙提前2秒钟打完，这篇发言稿共多少个字？",
                "answer" => "2个字"
            ],
            [
                "category" => "数学",
                "question" => "甲乙丙三个数的平均数是5，乙丙两数和的一半是4.5，甲数是多少？",
                "answer" => "6"
            ],
            [
                "category" => "数学",
                "question" => "如果一国的货币升值，那么进口就会变得相对便宜，还是更贵？",
                "answer" => "便宜"
            ],
            [
                "category" => "数学",
                "question" => "把一根长六分米，宽三分米，高一分米的长方体木料，表面涂满红漆，再锯成棱长一分米的正方体木块。三面涂了红漆的正方体有多少块？",
                "answer" => "8块"
            ],
            [
                "category" => "数学",
                "question" => "我养了7只羊，大儿子分得羊群的一半，二儿子要得到大儿子羊数的一半，三儿子要得到二儿子羊数的一半，问二儿子得到多少只羊？",
                "answer" => "两只"
            ],
            [
                "category" => "数学",
                "question" => "为了决选谁是万兽之王，老虎和狮子进行赛跑，它们比赛的是100米往返跑，共计200米，已知老虎每跨一步为2米，狮子一步为3米，但老虎每跨三步，狮子却只能跨两步，请推断谁最终将成为万兽之王？",
                "answer" => "老虎"
            ],
            [
                "category" => "数学",
                "question" => "力的单位是牛顿，下面表示力的是？",
                "answer" => "N"
            ],
            [
                "category" => "数学",
                "question" => "在一天的24小时中，时钟的时针，分针和秒针完全重合在一起的时候有几次？",
                "answer" => "2次"
            ],
            [
                "category" => "数学",
                "question" => "步兵出城去作战，2个时辰后传令兵骑马追赶，速度是步兵的5倍，多久可追上？",
                "answer" => "半个时辰"
            ],
            [
                "category" => "数学",
                "question" => "周长相等的等边三角形、正方形、圆形，哪一个的面积最大？",
                "answer" => "圆形"
            ],
            [
                "category" => "数学",
                "question" => "有一种商品，降价十分之一后是630元，这种商品原价是多少元？",
                "answer" => "700元"
            ],
            [
                "category" => "数学",
                "question" => "注意细节分钟，一位猎人带着一只猎犬、一只兔子和一颗白菜要划小船过河。如果猎人每次只能携带这三者之中的一个渡河，而每次渡河需要花费5分钟，为了避免猎犬咬伤兔子或兔子吃掉白菜，他至少需要多少分钟才能将它们全部送到河对岸？",
                "answer" => "35"
            ],
            [
                "category" => "数学",
                "question" => "注意细节次数，一位猎人带着一只猎犬、一只兔子和一颗白菜要划小船过河。如果猎人每次只能携带这三者之中的一个渡河，为了避免猎犬咬伤兔子或兔子吃掉白菜，他至少需要划多少次船才能将它们全部送到河对岸？",
                "answer" => "7"
            ],
            [
                "category" => "数学",
                "question" => "一个三角形纸板，用剪刀剪去掉一个角后，再剪去一个角，还剩几个角？",
                "answer" => "5个角"
            ],
            [
                "category" => "数学",
                "question" => "一根铁丝长40米，把它围成一个长方形铁框长师13米，请问宽是多少米？",
                "answer" => "7米"
            ],
            [
                "category" => "数学",
                "question" => "有一根铁丝长12厘米，现用它弯成一个三角形，则一下答案中不可能出现的是一条边长是那个？",
                "answer" => "6厘米"
            ],
            [
                "category" => "数学",
                "question" => "一个面粉厂，用40000千克小麦磨出面粉34000千克，求小麦的处分率是百分之几？",
                "answer" => "85%"
            ],
            [
                "category" => "数学",
                "question" => "请问98、35、51、25中较大的两个数之积与余下的两个数之积得差是多少？",
                "answer" => "4123"
            ],
            [
                "category" => "数学",
                "question" => "冰融化后，变成水，其体积减少了10分之一，请问水再结成冰时，冰的体积增加了几分之一？",
                "answer" => "1/9"
            ],
            [
                "category" => "数学",
                "question" => "什么数除36余1，除54余4，除55正好除尽？",
                "answer" => "5"
            ],
            [
                "category" => "数学",
                "question" => "观察以下数列，按规律写出括号内的正确数字：1，2，4，7，11，()？",
                "answer" => "16"
            ],
            [
                "category" => "数学",
                "question" => "羽毛球运动史深受广大群众喜爱的小型球类运动。其所使用的器材羽毛球的羽毛是用鹅毛做的，那你知道一只羽毛球有多少根羽毛吗？",
                "answer" => "16根"
            ],
            [
                "category" => "数学",
                "question" => "不等腰直角三角形中对着直角的边叫做？",
                "answer" => "弦"
            ],
            [
                "category" => "数学",
                "question" => "“一片一片又一片，两片三片四五片，六片七片八九片，飞入芦花都不见。”此诗传说是乾隆与纪昀合作的咏雪诗，请数一下诗中各数字相加起来等于多少？",
                "answer" => "47"
            ],
            [
                "category" => "数学",
                "question" => "小白和小黑两人扣袋里各有10元钱，两人去书店买书，买完书后发现，小白花去的钱正好和小黑剩下的钱一样多，请问现在他们两人一共还有多少钱？",
                "answer" => "10元"
            ],
            [
                "category" => "数学",
                "question" => "(半径)边长为4厘米的正方体箱子中，最多能装几个半径为1厘米的小圆球？",
                "answer" => "8个"
            ],
            [
                "category" => "数学",
                "question" => "小明去音像店买CD，CD是25元，成本价是18元，小明给老板了100元，老板没零钱去老张那里破钱，然后找给小明75元，小明走后，老张过来说100是假的，老板又给老张换一张真的，请问老板这次赔了多少元？",
                "answer" => "93元"
            ],
            [
                "category" => "数学",
                "question" => "李某是一家鞋店的老板，他每双鞋的成本是18元，加上利润9元，每双鞋的价格是27元，有个人来向李某买鞋，给了李某一张100的钞票，李某没有零花钱找，就到了邻居家，把这张100元的换成了零钱，等找完钱，买家离开后，邻居找了过来，说那张钞票是假币，李某没有办法，只给邻居换一张真的，请问老板这次赔了多少元？",
                "answer" => "91元"
            ],
            [
                "category" => "数学",
                "question" => "4盏50瓦的灯持续照明12小时，共计耗电多少度？",
                "answer" => "2.4度"
            ],
            [
                "category" => "数学",
                "question" => "1块重40克的天平砝码掉到地上摔成了4块，用这4块砝码可以称量1到40克的所有整数重量，请问，最轻的那块砝码碎片重量为几克？",
                "answer" => "1克"
            ],
            [
                "category" => "数学",
                "question" => "已知A+15×B=1，则(16-45×B)-A×3的结果是多少？",
                "answer" => "13"
            ],
            [
                "category" => "数学",
                "question" => "将边长为1的小立方体各个角标上红点，并用小立方体堆积出体积为8的打立方体。若相接触的红点不重复计算，则该大立方体上有几个红点？",
                "answer" => "27个"
            ],
            [
                "category" => "数学",
                "question" => "在一轮PK比赛中，A击败了D，E击败了F，C击败了E，F击败了D，A击败了F，B是第三名，B击败了A，请将比赛的名次排列出来。",
                "answer" => "CEBAFD"
            ],
            [
                "category" => "数学",
                "question" => "注意人数，一辆公交车载着8名乘客从起点车站出发，第一站1人下车、12人上车；第二站4人下车、8人上车；第三站9人下车、2人上车。请问第四站终点站时，应有多少乘客下车？",
                "answer" => "16人"
            ],
            [
                "category" => "数学",
                "question" => "注意人数，一辆公交车载着8名乘客从起点车站出发，第一站1人下车、12人上车：第二站4人下车、9人上车；第三站8人下车、2人上车。请问第四站终点站时，应有多少乘客下车？",
                "answer" => "18人"
            ],
            [
                "category" => "数学",
                "question" => "注意细节交点，用5条线段首尾相接成五角星形，其中有多少个交点？",
                "answer" => "10个"
            ],
            [
                "category" => "数学",
                "question" => "注意细节区域，用5条线段首尾相接成五角星形，其中包含多少个单独的区域？",
                "answer" => "6个"
            ],
            [
                "category" => "数学",
                "question" => "注意细节图形，用5条线段首尾相接组成五角星形，其中包含多少个三角形？",
                "answer" => "10个"
            ],
            [
                "category" => "数学",
                "question" => "12个球和一个天平，现知道只有一个球的重量不同，问用天平至少称几次才能找到那个球？",
                "answer" => "3次"
            ],
            [
                "category" => "数学",
                "question" => "某班有男生24人，比女生多6人，女生是男生的几分之几？",
                "answer" => "四分之三"
            ],
            [
                "category" => "数学",
                "question" => "妈妈给小明一个大盒子，里面装着6个纸盒子，每个纸盒子又装4个小盒子，小明一共有多少个盒子？",
                "answer" => "31"
            ],
            [
                "category" => "数学",
                "question" => "你和朋友玩掷骰子游戏时,连续两次掷出“六”的几率是多少？",
                "answer" => "1/36"
            ],
            [
                "category" => "数学",
                "question" => "自然数1至99加起来的和为多少？",
                "answer" => "4950"
            ],
            [
                "category" => "数学",
                "question" => "某城市于2009.2.28中午12点开始停电，直至2009.3.1凌晨0点恢复供电。请问该城市此次共停电多少小时？",
                "answer" => "12"
            ],
            [
                "category" => "数学",
                "question" => "绿柳红花/9=花红柳绿，求“花红柳绿”这组数是多少？",
                "answer" => "1089"
            ],
            [
                "category" => "数学",
                "question" => "-1的0次方结果是多少？",
                "answer" => "1"
            ],
            [
                "category" => "数学",
                "question" => "一个人工鸟窝挂在大树上，离地8米，这棵树高20米。当这棵树长高到25米的高度后，这个鸟窝离地多少米",
                "answer" => "10米"
            ],
            [
                "category" => "数学",
                "question" => "小明的爸爸有3个孩子，大孩子叫大毛，二孩子叫二毛，三孩子叫什么名字？",
                "answer" => "小明"
            ],
            [
                "category" => "数学",
                "question" => "宋朝理学家邵雍在《蒙学诗》中写道：“一去二三里，烟村四五家，亭台六七座，八九十枝花。”请数一下诗中各数相加起来等于多少？",
                "answer" => "55"
            ],
            [
                "category" => "数学",
                "question" => "有一个数增加百分之二十五，请问应减少所得的数百分之几才能重新得到这个数？",
                "answer" => "20%"
            ],
            [
                "category" => "数学",
                "question" => "把一块长六分米，宽五分米，高四分米的长方体木料加工成一个尽可能大的正方体木料，这块木料的体积是多少立方米？",
                "answer" => "64"
            ],
            [
                "category" => "数学",
                "question" => "出生后的小毛虫，每天身体长度增长一倍，4天后长度为2厘米，再过多少天后长到16厘米？",
                "answer" => "3天"
            ],
            [
                "category" => "数学",
                "question" => "9个一元面值的硬币，其中有一枚偏重，用天平最少几次能保证将此硬币抽出来？",
                "answer" => "2次"
            ],
            [
                "category" => "数学",
                "question" => "一根10米长的木棍，从一段端开始逐次锯成2米一段的小木棍，锯一次用时1分钟，然后休息3分钟，全部锯完要多久？",
                "answer" => "13分钟"
            ],
            [
                "category" => "数学",
                "question" => "小张一共做了25道数学竞赛题，做对一道题得4分，不做题或者错题扣1分，小张一共得了60分，问小张一共做对多少道？",
                "answer" => "17道"
            ],
        ];

        $questions = collect($questions)->map(function ($item) {
            return array_merge($item, [
                "created_at" => Carbon::now(),
                "updated_at" => Carbon::now(),
            ]);
        })
        ->toArray();

        Question::insert($questions);
    }
}
