<?php

use App\Models\Map;
use App\Models\Npc;
use App\Models\Title;
use Illuminate\Support\Carbon;
use Illuminate\Database\Seeder;

class TitlesSchoolSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // 创建管理员
        $items = [
            // 门派基础
            ['name' => '天策弟子', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '天魔里弟子', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '佛门弟子', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '七星方寸弟子', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '魔王山弟子', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '幽冥地府弟子', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '盘丝岭弟子', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '万兽岭弟子', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '凌霄天宫弟子', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '南海普陀弟子', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '镇元五庄弟子', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '东海龙宫弟子', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['初级称谓'], 'description' => ''],
            ['name' => '无名谷弟子', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['初级称谓'], 'description' => ''],

            // 天策女性(未对)
            ['name' => '传令信差', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '红英校尉', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '牡丹御使', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '巾帼英豪', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '剑胆琴心', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 天策男性
            ['name' => '护城小兵', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '威虎校尉', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '飞骑御使', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '神武都尉', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '龙城飞将', 'teacher' => '程将军', 'map' => '天策', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 天魔女性(未对)
            ['name' => '报信侍女', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '飞燕贤女', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '映月伊人', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '妖媚才媛', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '混沌女巫', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 天魔男性
            ['name' => '刺探耳目', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '潜行使者', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '月影武工', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '霹雳军师', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '暗夜王者', 'teacher' => '袁飞', 'map' => '天魔里', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 佛门女性
            ['name' => '佛家小尼', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '救苦良医', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '白衣比丘', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '杏林圣手', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '青莲神使', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 佛门男性
            ['name' => '佛门小僧', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '游方行者', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '妙手金刚', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '济世神医', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '仁心药王', 'teacher' => '大慧禅师', 'map' => '佛门', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 方寸女性
            ['name' => '三清道童', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '灵台道长', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '平妖法师', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '降魔天师', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '符篆道祖', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 方寸男性
            ['name' => '道家仙童', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '三界散仙', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '潇湘隐士', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '八卦天师', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '混元道尊', 'teacher' => '大觉金仙', 'map' => '七星方寸', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 魔王女性
            ['name' => '古怪刁钻', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '魔灵妖女', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '炎天妖姬', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '离火郡主', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '火云邪灵', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 魔王男性
            ['name' => '山精地怪', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '魔寨蛮妖', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '黑风老妖', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '邪魔太岁', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '护山妖圣', 'teacher' => '平天大圣', 'map' => '魔王山', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 地府女性
            ['name' => '鬼灵精怪', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '幽冥女鬼', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '拘魂女使', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '森罗郡主', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '倩女幽魂', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 地府男性
            ['name' => '孤魂野鬼', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '幽冥鬼卒', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '勾魂使者', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '催命无常', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '铁面判官', 'teacher' => '地藏菩萨', 'map' => '幽冥地府', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 盘丝女性
            ['name' => '百媚妖灵', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '勾魂魔女', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '夺命妖姬', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '玉面修罗', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '织情魅魔', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 盘丝男性
            ['name' => '懵懂小妖', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '夺魄灵妖', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '夺命邪灵', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '绝情修罗', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '无上魔尊', 'teacher' => '盘丝大仙', 'map' => '盘丝岭', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 万兽女性(未对)
            ['name' => '婀娜小蛮', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '驯兽妖魅', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '吸血美姬', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '破茧天魔', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '绝命妖女', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 万兽男性
            ['name' => '巡山小妖', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '百兽统领', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '三界妖将', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '噬血狂魔', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '通天魔帅', 'teacher' => '万兽之王', 'map' => '万兽岭', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 天宫女性(未对)
            ['name' => '散花小仙', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '灵霄美玉', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '大罗仙姬', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '逍遥公主', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '广寒天仙', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 天宫男性
            ['name' => '桃园力士', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '天庭守卫', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '雷部天兵', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '瑶池天将', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '镇魔天王', 'teacher' => '杨戬', 'map' => '凌霄天宫', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 普陀女性
            ['name' => '掌灯仕女', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '莲花仙子', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '紫竹仙姬', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '落伽玄女', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '冰心玉女', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 普陀男性
            ['name' => '守山童子', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '护法金刚', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '紫竹护法', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '净瓶使者', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '弘法尊者', 'teacher' => '观音菩萨', 'map' => '南海普陀', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 五庄女性(未对)
            ['name' => '淡雅脱俗', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '百花仙女', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '玉清玄女', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '日月光华', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '乾坤仙姑', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 五庄弟子
            ['name' => '道家仙童', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '三界散仙', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '潇湘隐士', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '八卦天师', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '混元道尊', 'teacher' => '镇元子', 'map' => '镇元五庄', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 龙宫女性
            ['name' => '灵溪小鱼', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '银沙彩贝', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '沧海明珠', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '出水芙蓉', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '幻世龙女', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 龙宫男性
            ['name' => '混水泥鳅', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '巡海夜叉', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '翻江猛蛟', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '覆海神龙', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '飞龙在天', 'teacher' => '龙王敖广', 'map' => '东海龙宫', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 无名谷女性
            ['name' => '霜雪侍女', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['一级称谓', '女性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '空谷幽兰', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['二级称谓', '女性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '冷月战姬', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['三级称谓', '女性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '无双红颜', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['四级称谓', '女性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '谷神居渊', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['五级称谓', '女性称谓'], 'description' => '等级≥110门派贡献值≥300'],

            // 无名谷男性(未对)
            ['name' => '无闻小辈', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['一级称谓', '男性称谓'], 'description' => '等级≥30门派贡献值≥60'],
            ['name' => '闲云野鹤', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['二级称谓', '男性称谓'], 'description' => '等级≥50门派贡献值≥120'],
            ['name' => '雪域奇兵', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['三级称谓', '男性称谓'], 'description' => '等级≥70门派贡献值≥180'],
            ['name' => '界外侠隐', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['四级称谓', '男性称谓'], 'description' => '等级≥90门派贡献值≥240'],
            ['name' => '杂技大师', 'teacher' => '姬长歌', 'map' => '无名谷', 'tags' => ['五级称谓', '男性称谓'], 'description' => '等级≥110门派贡献值≥300'],
        ];

        $npcs = Npc::whereIn("name", [
            "程将军", "地藏菩萨", "大慧禅师", "镇元子",
            "大觉金仙", "盘丝大仙", "大慧禅师", "观音菩萨",
            "平天大圣", "袁飞", "杨戬", "龙王敖广", "万兽之王",
            "姬长歌",
        ])->get()->keyBy("name");

        $maps = Map::whereIn("name", [
            "天策", "幽冥地府", "佛门", "镇元五庄",
            "七星方寸", "盘丝岭", "佛门", "南海普陀",
            "魔王山", "天魔里", "凌霄天宫", "东海龙宫",
            "万兽岭", "无名谷",
        ])->get()->keyBy("name");

        $items = collect($items)->map(function ($item) use ($npcs, $maps) {
            $map = $maps[$item["map"]];
            $teacher = $npcs[$item["teacher"]];

            unset($item["map"]);
            unset($item["teacher"]);

            return array_merge($item, [
                "map_id" => $map['id'],
                "npc_id" => $teacher['id'],
                "tags" => json_encode($item['tags']),
                "created_at" => Carbon::now(),
                "updated_at" => Carbon::now(),
            ]);
        })
        ->toArray();

        Title::insert($items);
    }
}
